{
    "title": "The Shipweck",
    "sections": [
        {
            "image": "./img/shipwreck.webp",
            "paragraphs": [
                "All of you had been swiped from your respective lodgings, or tracked down in the streets, by members of the watch or militia. There was no trial, and you can think of nothing that would warrant this treatment. Certainly those of you who erred on the grey side of the law hadn’t done anything that serious. But somewhere along the way, you were branded, between the shoulder and neck.",
                "You wound up on a prison ship, whose guards treated you well, and in your own individual cells – not usually the accommodation afforded to petty crooks. You can’t recall exactly how long its been, nor what time things got interesting at sea. But many days into the trip – to Aeladh only knows where – the ship was rocked, hulled, and taking on water. You got above deck, where a gang of criminals found each other and killed the captain. They then commandeered a raft, and told the others to join them on land, far in the distance.",
                "You struggled on board the raft, some of you blagging passage on the gang’s raft, led by their leader, Basso, and his dwarf henchman Mattis. Others struggled onto one of the other three, picking the same one by chance.",
                "Your choice of raft was fortunate, as once you pushed off, the other two were overrun and carried too many. One made it to dry land, but the other capsized. Despite their cries for aid, you let the criminals drown rather than returning to rescue them and perhaps endangering your own raft.",
                "Hours of exhausting paddling later, you washed up on the stony beach. There, you saw the surviving crew of the ship lined up by Basso and his few men, and slain. Basso noticed your brands, and put you all in one group of branded criminals. He explained that, being branded, you were clearly a prized criminal, perhaps especially dangerous. Your survival would be noticed, and you sought after. If your jailors searched for you they’d not be searching for him, so he’d let you live, as long as you went where he did not. However, Mattis noticed one of your number was Vallasaari, and so shot him dead with his crossbow. To make it up to you, Basso snapped a longspear in half, and advised you to hunt to survive.",
                "The gang then wandered inland. Of the branded group left behind, several others would not travel with you, seeing as how one of you had the daemonic taint of a tiefling! Several of you - an entertainer, a gentleman, and a eerie young girl, wore locked, metal contraptions over their faces, intended to prevent the speaking of magic. These, the tiefling broke apart, and you hailed each other as fellow travellers.",
                "You gathered up what driftwood you could find. After a few hours, with night descending, you discovered a stream to follow. The stream led to a sheltered copse, where you found enough berries, roots, and water to keep you alive. Cold, dressed only in rags, and bruised, you began to travel inland."
            ]
        }
    ]
}