{
    "title": "The Men of Carrick",
    "sections": [
        {
            "paragraphs": [
                "The Next day, inland from the beach, the rains came on. As some of your party went off to find provisions, a tall, rangy, and unkempt-looking man surprised you all and came to the edge of your camp. The man was a deep-woodsman, a man who also bore a tattoo like yours. He made camp with you, and became one of your travelling number.",
                "As you broke camp, two of you went to explore the region further inland, whilst the woodsman went to find one of the deer he spotted yesterday. You stalked the deer after a short hunt, using a long-forgotten implement to improve the range of the spear and perfectly killed the animal, barely spoiling the deer meat and hide. When you returned to camp, a tracker and a soldier awaited, and took you to meet their lord, Ser Harmand Bryce.",
                "The other group journeyed for some time, finding spell components, before spotting a settlement in the distance. Before you could set off, you were apprehended by a patrol of horsemen, who took you to meet the lord of Carrick, Harmand Bryce, at Elsewatch. (edited)",
                "You were taken to the Elsewatch after a long ride, and spoke with Morten, the guard captain, and one young lad. The local folk knew them by name. The lands you passed through seemed impoverished and the people lean and cold. You arrived at the village and keep of Elsewatch at dusk, and were taken to the stables whilst the lord finished his meal. You met Fiddias, his well-dressed halfling steward, whom the guards nicknamed 'the Fidgeter'. In the stables, you chatted with the smith, and spotted that part of the block had been recently affected by fire.",
                "Ser Harmand Bryce, a grizzled veteran, met you in his spartan chamber. The fire burned low, and he offered you good food, before asking you how you got here. You were honest about the shipwreck, and he responded with an offer of a new start in these lands. His price was a small task - find out what started the fire and killed his best destrier. He had previously posted a notice in local taverns seeking help, and paid coin in advance to some mercenaries who went below the castle and never returned with any solutions, nor his money.",
                "You accepted. Fiddias would ensure you had arms, equipment, and a good sleep. The mood in the lord's hall of Elsewatch was relaxed, and capped off by song and music from Bragi and the woodsman, with Rachel watching on at the foot of Ser Bryce's throne."
            ]
        }
    ]
}