{
    "title": "Elsewatch",
    "sections": [
        {
            "heading": "A Dungeon",
            "paragraphs": [
                "Later that night, two more of you were taken into the castle. Although you weren’t afforded the same hospitality as the trio in the Lord’s Hall, you got to sleep on good beds in with the others.",
                "The first was a Vallasaari, one of the elves of the mortal world, an outcast descendent of the proud and heretical immortal race. The other was Fair, the Tiefling spirit which inhabited the form of a mortal. Neither of you were welcome in the hall of Ser Harmand Bryce.",
                "The next morning, Fiddias and Morten had you equipped, roping the Vallasaari and Tiefling into the task agreed the night before. Rachel alone got a shield, large enough to hide behind, and you received or crafted your focus objects and holy symbols. And then you were taken to the cellars, and shown an entrance uncovered by the mercenaries before you; a secret wall discovered and demolished. Ser Bryce then told you of the guardian they defeated at the entrance. It was a humanoid creature comprised of stones, powerful enough to require help from Bryce’s guards. The tunnel it guarded extended beneath the courtyard. As you stepped in, Bryce realised he’d asked a lot, and promised you possession of whatever they found underground that didn’t belong to him, and a sum of 100 crowns each. With protestations from the miserly Fiddias ringing in your ears, you went beneath the castle.",
                "The tunnel began narrow, descending, then widened. On one side were holes in the wall, where something had been hammered in, and the floor was carpeted with a bed of reeds, making it difficult to sneak along. It was Nilsson who first spotted the bloodstains, very old, on both the walls and floor. And a dampness in the air. Pressing on, Bragi’s keen eyes picked out a wall different from the others, marked with painted plaster, but none of you could understand the markings. Perhaps a skull?",
                "The passage narrowed again. Down a few steps was an open portcullis. Opened by the last band of mercenaries? It still worked, and the lever on the outside was perhaps intended to keep something locked down here. And then more steps down, the corridor widened once more. Again, hammered gouges lined the wall on one side, and empty torch sconces on the other, but a glimmer of metal revealed what occupied these holes long ago – a rung driven into the stone, and manacles that hung from them. This passage held prisoners. Further along the passage was a skeleton still manacled in its place, bones crumbling to the touch. Agis the Vallasaari noticed a circle of soot on the ground, as if a fire was lit here once. But as the party checked the area for hidden traps, a similar circle up ahead illuminated. And with a puff of smoke, dust, and steam, three small demons appeared. Chattering in a mysterious tongue, they spotted you, and charged to attack."
            ]
        },
        {
            "heading": "Demons in the Dark",
            "image": "./img/smoke-demon.webp",
            "paragraphs": [
                "Bragi reacted quickly, blasting the three with wall of sound that disrupted them and pushed the dust demon back. The other two came on, but felt Nilsson’s warhammer. But the creature of dust spun a web of sleep over you, dropping Nilsson and Fair. Agis loosed arrows into them, Rachel, standing by the skeleton, screamed a discordant tone that rent the smoke creature, sending it fleeing into the darkness. Pryce formed eldritch energy into a lance that struck the dust devil, injuring it further. The steam creature, undeterred, blasted boiling air into young Rachel, but quickly found itself disrupted by dissonant tones played by Bragi. Pryce woke Nilsson from his slumber, stepping back to take cover as the lean figure hefted his hammer again. Agis’ volleys of arrows struck home again, and now the steam creature wavered for a moment, barely reforming. Nilsson put an end to its existence with a powerful blow, and now, struck by both Rachel and Pryce, the dust demon wavered too. Bragi thought fast, waking Fair, who discovered a fresh vitality and pounced at the dust spirit with her mace, dispersing it swiftly. And finally, drawing his bow a final time, was ready, as the smoke demon reappeared, chattered wildly, to send it back to the Ethereum from whence it was summoned.",
                "As you gathered yourself after the fight, you noticed the closer of the two soot circles began to sparkle. Rachel understood it to be reforming, perhaps ready to spit out more of the same creatures soon. She also understood that simply dispersing the soot would ruin the glyph. And with a wilful conjuring of air, she swept it away. Nilsson, shunning such extravagance, used his boot."
            ]
        },
        {
            "heading": "Traps and Glyphs",
            "paragraphs": [
                "Seconds after you finished dressing your wounds, you met Risvin, a dwarf soldier sent down the tunnel by Ser Bryce to find out what happened to the last band. Risvin clearly came from the same ship as you. The more the merrier, you thought, and Risvin joined your group.",
                "You turned a corner into a chamber with a reed floor and two exits at the opposite side. A set of rusted loops held a frayed rope around the edge of the room. The low ceiling and a hole in floor in the far corner gave you pause, and you stopped to assess the risk. Stepping lightly into the room, Agis discovered that parts of the floor gave way under weight, like one end of a see-saw. Risvin proved his worth, spotting the flaws in the stonework along the walls and picking out which parts of the perimeter were trapped. Nilsson leapt across to join Agis, quickly moving to the opposite end of the room. The others started across, ready to set up a rope so others could avoid the pitfalls. Leaping to take the rope, Agis misjudged, and fell through.",
                "He fell into a chamber 20’ below, the same size as above. He saw a broken grate at one end, along a gully in the floor, which drained a spout that fed it high on the wall of the opposite side. A ledge above him had a corpse on it. The rest of you, seeing the Vallasaari fall, took extra precautions, but Bragi’s leap also failed, and he joined the ranger below. Others of you decided the danger could be controlled, and roped-up to cross the room below, instead of falling through.",
                "Nilsson had no time for this. You stepped through the exit archway into a room with a carved glyph on the floor. There were no other exits. The walls were lined with shelves, the floor muddy, and the ceiling held a set of manacles. One corner had some straw on it, which covered a drain, into which the carved glyph’s groove led. Fresh air came from a small hole overhead, which you guessed led to the stables - confirmed by Risvin. In another corner, you found a strange material, almost translucent, like snakeskin but softer. But then, the caked mud broke apart, and a figure of stone and mud blocked the archway back. As you turned, the glyph beneath you glowed and filled with magma from nowhere. Slowly a creature of molten rock formed. You fought off the mud daemon, before Fair and Pryce joined you, and together you dispatched the pair.",
                "You left the room and checked out the other exit. It was a dead-end store, of no interest. Below, you took a couple of hours to rest and eat, nursing injuries. You investigated the corpse on the ledge, discovering it was garbed like a northern barbarian, much to Nilsson’s - who took the equipment - pleasure. The grate above on the wall dripped now and again, but the outflow on the opposite side was smooth and slippery. Nilsson again took the lead, and slid down the tunnel at great speed. It twisted, turned, and dropped for several seconds, before opening into a chamber into which you crashed, knocking over pots and pans. The chute continued on, but this offered a resting place. The rest of you followed down the chute."
            ]
        },
        {
            "heading": "A Gnome",
            "paragraphs": [
                "Nilsson was startled as a voice rang out in the cave. The pots and pans belonged to a gnome named Weylin. He was the last survivor of the group hired by Bryce a week ago. Around him were the corpses of his fellows, whose rations he was eating from the pots you knocked over. He was trapped here because, further below, was a scaled creature that shed its skin and came up the chute now and again. Weylin couldn’t face it alone, so hid here until help showed up. And you have. Looking around, your party found arms and equipment suited to your needs. Fair found armour, Bragi a bodhran, Risvin a battleaxe, Agis a longbow. Pryce couldn’t say what he found, but was visibly overjoyed.",
                "Weylin asked for help to escape his predicament. He said there was no point in returning to the surface back to the castle; his party was peppered with crossbow bolts from behind the dropped portcullis, fatally injuring several of them. The demons did the rest.",
                "So with no way back, you had to press on. Again, Nilsson wouldn’t wait long while there was a beast on the loose. And you were off. You dropped for hundreds of feet along the slippery chute, with the others following close behind. You landed in a pool of muddy, filthy water; a sump in front of another broken grate. Beyond that grate was a dark chamber. A door at the far end shimmered with daylight beyond. But beside it, breathing heavily in the corner of the chamber, about the size of a buffalo, was a scaly creature; the beast mentioned by Weylin. So you javelined it."
            ]
        },
        {
            "heading": "The Dungeon has a Dragon",
            "paragraphs": [
                "The creature brushed the javelin off, and turned. It spread out its wings, deep blue, and crackled with lightning. You jumped over the grate and down into the chamber floor. Agis dropped into the pool, backing up and drawing his bow. Then Fair, then Risvin, then Pryce, then Rachel, and finally Bragi, lept into the fray as the creature’s hide resisted your blows. You blasted it with Pryce’s eldritch hexes, Bragi’s whispered curses, and Rachel’s screams that shook its feral mind. Agis’ arrow almost skewered its throat, and it flailed its tail, wings, claws, and ferocious bite in return, all the while sending bolts of lightning from its mouth. Nilsson was felled by a bite as Risvin interposed to prevent his death. It seemed like the creature was about to charge up its lightning bolts again, but Fair’s longsword carried through its guard, sliding barely along its belly, and opening its innards over the tiefling paladin as it fell on top of her.",
                "It was slain.",
                "The beast had slain and feasted on the room’s previous occupant: a nasty, trash-eating Otyugh, and the awful corpse remained. When Weylin joined you, he couldn’t believe you killed them both. On a plinth, a chest was lined with fox furs, and it contained three huge broken eggs, each the size of a man’s head. One had not yet opened. Weylin guessed that when the first egg broke, it ate the contents of the others until it was strong enough to look for better food. The chest was marked with the blue and white crest of Ser Bryce. As Agis investigated the door, it was clearly intended to keep something in. Perhaps the lord of Elsewatch knew of this? Perhaps it was Fiddias’ secret? Either way, returning to the castle would be incredibly dangerous.",
                "And so, while Nilsson and Risvin broke the door down, the rest of you harvested the claws, teeth, and torn hide of the beast. Although not the mantle of a mighty chromatic wyrm, it could yield valuable ingredients. Fair took the egg, kept it warm, and hid it on your behalf among his belongings.",
                "Light spilled into the chamber as the door fell. It was mid-afternoon, and you stood at the base of the hill upon which Elsewatch and its village stood. Weylin pointed down the hillside. The River Else, the edge of Ser Bryce’s lands, was perhaps half a day away, down the valley. The Elseferry was the safest and quickest route across, so he recommended you make all speed to it, before Ser Harmand Bryce and his men caught up with you.",
                "You stepped out into the daylight. Your wounds were painful, but the cold daylight soothed them enough. Most of all, you were on the path to glory, and free once more."
            ]
        }
    ]
}