{
    "title": "An Uneasy Rest",
    "sections": [
        {
            "heading": "Uneasy Rest",
            "paragraphs": [
                "You set off at once from the hidden chamber at Elsewatch, making north and down into the valley of the River Else. You had Bragi’s tunes to keep the mood light Weylin explained that the ferry was based in Camylborne, the lands of Lord Aldred; known to be a fair and wise lord, and in dispute with Ser Bryce of Carrick. Agis scouted ahead a little, checking for Carrick patrols and setting a good route by cover of the forests.",
                "Your wounds still ached, so you decided to find shelter and rest before making the crossing. You found an ideal spot in a copse which afforded a view of the hills back towards Elsewatch. You set a guard and tended your wounds. Oddly, there were large feathers littering the ground. Bragi knew of Rocs, but Agis assured him these were smaller than Roc feathers. Thankfully.",
                "As the evening drew in, Pryce Ward patrolled the camp. You heard nothing of the three bowshots that homed arrows at you. One arrow found its mark, and you fell to cover. You alerted the others.",
                "Backing up against trees, you all tried spot the attackers. Bragi and Rachel saw deep into the woods and picked them out. Three orc archers with longbows, aiming them overhead to fire down into the camp. Bragi began to circle around them, whilst Agis fired a bowshot in return. Rachel and Pryce could only take cover. Rachel was struck by an arrow as she did so. Agis cloaked himself in the woods, stalking through it like a born hunter. Your track was undetected by the orcs. But still they rained arrows into the camp. If you were to get closer, you needed a distraction.",
                "Pryce obliged, conjuring an illusion of shouting soldiers approaching nearby. The orcs were startled. They took cover, hid, stopping firing, and backed away, closer to Bragi’s position. Bragi pressed on, readying your sleeping spell. Agis was halfway to the hiding orc group, but soon discovered their strategy. Your next step hit metal, and jaws of a trap closed around your leg. Looking around, you saw perhaps a dozen more hunter’s traps, but you managed to get free before the orcs spotted your plight. Rachel was incensed with her injury, and screamed as she ran headlong into the woods towards the orcs. Pryce improved his illusion with the vision of soldiers approaching, and the orcs still hid. But then Rachel was clamped by a hunter’s trap too, and could not get herself free.",
                "The snap of metal traps helped the orcs see through the illusions. One fled for help, the other two stayed. The third lanced Rachel with a thrown spear. It lept out and charged. Agis’ bow tracked it and buried an arrow in its shoulder, but it kept on. As it loomed over her, it slumped to the ground as Bragi finally reached you and sent it to sleep. The third Orc lept up as it saw Bragi’s spell take effect, but was diverted at the sight of the Vallasaari nearby. It burst through the undergrowth and pummelled the ranger with its great axe. Agis drew his blades, whilst Bragi spun and drew its black blood from the flanks. Agis’ footwork forced its guard away, cutting across the chest of the orc and felled it.",
                "You took a moment to recuperate and freed Rachel from the trap, as Agis looked off into the distance. Something wasn’t right. Around the orc position feathers littered the ground, and a rope dangled from the branches of a nearby tree. In its boughs was hung a feathered figure, dressed as a Confessioner of the Shadow. Weylin said it but you all knew it; a cleric of the Covenant would be a valuable ally. Still, Agis couldn’t draw his gaze from the shadows in the distance. You cut down the cleric, a hooded kenku priest, who admitted he was ambushed on his way north.",
                "Then you felt it."
            ]
        },
        {
            "heading": "Big Molg",
            "image": "./img/big-molg.webp",
            "paragraphs": [
                "A slight tremor, followed by a grunt. The final orc returned, and with him loped a humanoid figure over fourteen feet tall. The orc mob leader was here; an ogre, clad in hides and wielding a huge mallet made from logs.",
                "It spotted your group and it began to close the distance terrifyingly fast. You tried to lead it into the field of traps. As the orc tried to warn it’s master about the traps, its head exploded like a melon from Agis’ arrow. So on the ogre crashed, headlong into the field of snares. But it simply kicked its way through the field on its way to you.",
                "Agis next arrow puncturing its thick skin at the ribs and dropping it to one knee. It howled as Pryce’s soul reached out to drive an eldritch lance into its mind, but staggered to its feet. The beast lashed out with a wild swing of its club, knocking Agis out. But Pryce’s blast weakened its mind, and you focused attacks there, whittling it down step by step. First Bragi, then Rachel, and then Corwyn, your new cleric ally, who sent a burst of flame at the creature. But it turned to Rachel, its shadow looming over her. She let out a wail, screamed into its soul, and her terror pulsated in ripples from that scream. The ogre staggered, its eyes rolled back, and it collapsed to the ground.",
                "You gathered your wits, dressed wounds, and tracked the ogre’s path back to its lair. Beneath a vine-covered waterfall lay a cave, and deep within that cave was its meagre treasure. The cave was filthy, and attracted all manner of vermin.",
                "You collected what you could, and returned to the camp with Corwyn, to heal, to finish your rest, and then to make up lost time towards the Else Ferry."
            ]
        }
    ]
}