{
    "title": "The River Else",
    "sections": [
        {
            "heading": "Ferry Cancellations",
            "paragraphs": [
                "You made good time to the River Else, arriving before midnight. The ferryman’s house on the opposite shore was occupied, and light spilled from a squat, stone building on your side of the river. A path through the rushes led to the unlit ferry jetty lamp, directly across from its counterpart on the opposite shore.",
                "As you approached, you spotted the absence of any actual boat, and too late, you noticed the ropes that guided it trailing in the water. The rushes on either side of you parted, and three gilled humanoid horrors, skin sagging water, with large, glassy eyes, leaped to ambush you with their long, taloned hands. As an isolated scout, Agis is injured and dragged beneath the mud to suffocate, eventually breaking free as the river creatures are distracted by the rest of the onrushing party. You dispatched all three with some difficulty, realising the vicious damage their talons do to shields, armour, and flesh. But as they fell, sallow skin bleeding ichor, water, and blood, you saw movement from all around the river.",
                "Perhaps a dozen more moaning figures, glassy-eyed with jagged teeth and almost lipless mouths, stood in the rushes and water, and began to lope towards you. You made into the squat building for refuge. The river monsters started to hammer on the door. But from the shuttered arrow slits you soon saw them slink back into the river rushes.",
                "You quickly realised it was a Covenant shrine, dedicated to the Bosun. Entombed within was a fallen knight of Carrick, who protected these lands over 150 years ago, and whose effigy is carved on the tomb. A candelabrum stood at the head of his sarcophagus, with a low-burning candle. It appeared to have been burning for at least a day, with perhaps only one hour remaining. Around the base of the candle was an inscription saying:",
                "In Aeladh’s name I ward; With Aeladh’s voice we three banish.’",
                "You considered that the candle was protecting the shrine, and you within, from the monsters, but that three candles could be triggered to destroy or repell them. Weylin took time to fully appraise the runes, and confirmed this was the case, but only if all three candles were on the candelabrum."
            ]
        },
        {
            "heading": "First Wave",
            "image": "./img/one-who-speaks.webp",
            "paragraphs": [
                "A ladder sat at the base of one wall, leading up to a roof hatch onto the lower roof, the nave of the shrine. From here you saw the lamp in the ferry house flicker, and you made contact with the ferryman, who seemed to have taken refuge inside. He shouted across that the creatures arrived perhaps two days ago, and destroyed his ferry. He said they’re not very smart. You saw from the rooftop that all the bug-eyed creatures looked at him as he spoke, and back at you as you replied. But their ferocity was enough to keep him inside his house; he won’t risk dying to get someone over the river. And he wouldn’t be able to come over with more candles, of which he had half a dozen.",
                "So you tried to lure one out, in the hope it can be charmed. Fair acted as bait, but things didn’t go so well. The creatures skirted around her, keeping their distance until the shrine door was closed behind her. And then they charged. Rachel’s charm spell failed, with Fair almost stranded at the foot of the wall, until Nilsson dropped a rope down to haul her up. But Fair overcame one of the creatures, so Nilsson instead lept down to lend support in the hope of reducing their numbers somewhat. Together with Bragi’s inspirational aid and psychic mockery, Pryce’s horrifying, nether-worldly blasts, and Agis’ bowshots, you felled the three at the base of the shrine. But more, a lot more, were just behind. You climbed back onto the roof, just in time to see them surround the lower portion. And then they began to swiftly climb, catching Bragi off-guard. One tore huge rips in his winter gear, opening a wound. Nilsson and Fair interposed themselves as Bragi fell back. The feral woodsman collapsed the skull of one bulbous head with his great axe, but Fair was quickly surrounded out in front. Her tail whipped in defence, but quickly she was overwhelmed and fell as a casualty. Before she fell from the roof, Nilsson had time to gather her up and run back into the shrine, where Pryce was ready with the door open. Bragi and Rachel retreated through the hatch, and bolted it at the same time as Pryce bolted the front doors again.",
                "As you waited, the padding of clawed feet stopped. The creatures jumped from the roof, and avoided the arrowslits on their way back to the river rushes once more. You took a look around, injured and running low on spells, and saw the candle burning low. It had only thirty minutes to burn…."
            ]
        },
        {
            "heading": "The One That Speaks",
            "paragraphs": [
                "You waited as the candle flickered. And a plan formed.",
                "You had destroyed several of the undead river creatures, and only a few likely remained. You would try luring the remaining monsters from the River Else. The ferryman mention a master among them. Perhaps you could establish what this 'One Who Talks' wants? If that failed, you would rest until the candle burned out, and then defeat them as they attacked the shrine.",
                "So you sneaked onto the roof, while Fair went towards the river. You watched Fair step cautiously towards the river. Fair, armoured head to toe in chainmail and with a shield readied at all times, stopped ten feet from the river. After coercion, the leader of the river beasts spoke to the Tiefling. It asked the party to leave the shrine so it could defile it, as the bones interred there were of a knight that kept the river safe - and weak, at the creature saw it. The shrine protected the river. The creature, with a red fin on its head, explained that its master commanded this. And with that ultimatum delivered, it dropped back into the river.",
                "Fair declined, returned to the shrine, shut the doors, and explained what took place. You lifted the lid of the tomb within the shrine, finding only bones, but holy bones at that. So you took the lead, deciding to protect the shrine from this undead scourge. Unknown to the leader, 'Fin', you used your power to discover there were only six of the undead remaining, including Fin. Enough to lure away.",
                "And so the second plan began."
            ]
        },
        {
            "heading": "The Last Ditch",
            "paragraphs": [
                "Bragi now volunteered to sneak across the river. The undead would be lured away from the river by snuffing out the remaining protective candle. As they attacked, the others on the roof could defend at range until the creatures came close. You'd try to hold them until Bragi, carrying the candles, returned and then lit the candles, banishing the undead once lit.",
                "Bragi snuck out and around the shrine, the others took their position, and Fair snuffed the candle out. Two river trolls rose from the water, and lumbered toward the shrine, taking arrows from Agis. But from behind the shrine came their leader Fin and the three remaining others. They snuck around as you planned your plans. Bragi bolted into the river. The current carried him downstream, but he ended up on the other side.",
                "The shrine was surrounded, and Fair took to the roof to defend the others. As Fin and his allies climbed up, Agis' throat gargled with bile. He was drowning where he stood. Rachel popped off a whisper of dissonance, but the creatures heeded it not. Pryce, cornered on the roof, blasted the back of Fin, then jumped back off and around to the door, where Weylin stood to open it. Fair faced down the creatures, defending the hatch, as the Vallasaari coughed up his bile and regained enough composure to make it through. Rachel was already safely inside. Fair lunged, missed, and had her armour rent by Fin's claws. Its human eyes glowed as it tasted blood. Injured, Fair risked letting them down the hatch if she collapsed, and so she jumped back into the shrine instead. This proved her undoing, as she knocked herself out from the fall. Rachel closed the hatch behind her and Agis closed the shrine doors.",
                "Bragi ran to the ferryman's house, where the ferryman dropped the candles in a sack from the lower window hatch. You saw across the river to the roof battle on the shrine. One spotted you and lept down towards the river again. From the door of his house, clad in many layers of ill-fitting chainmail, came the ferryman, who planted his tower shield in the mud, and levelled his arbalest. You dove into the river.",
                "Pryce took up position at an arrowslit. His blast arced out the slot, hitting the running beast dead before it got to the river. Rachel administered a potion to the fallen Fair, getting her back on her feet. The river trolls hammered on the hatch, almost opening it. Fair looked at the sarcophagus lid and wrapped rope around it and the other end to the hatch to secure it shut. It worked, barely. The front doors also held firm. You could see Bragi at the near shore, ready to return, but with no way in. Again, Fair took the lead, and hefted her shield as Pryce opened the doors. You charged.",
                "Your blade lanced into the nearest horror. With your whispered prayer, radiant energy filled the blade, and the creature was blown apart. Agis notched an arrow, Pryce fired a blast, and Rachel screamed a curse, but your target withstood. From nowhere, a crossbow bolt shattered its head. The way was clear, and in rushed Bragi at last."
            ]
        },
        {
            "heading": "Rekindling of Faith",
            "image": "./img/candle.webp",
            "paragraphs": [
                "But once in the midst of the shrine, Bragi fell, clutching his throat, as Fin stepped down from the roof with the three remaining creatures. It gargled a cry of triumph and tore a gash in Fair's chainmail, felling her once more, and stepping past the bard. The candles rolled from the bag, and Rachel picked them up, placing two alongside the remaining unlit one. You lit the two new candles, but on came the river monsters, Their skin began to char. The snuffed-out candle would not rekindle. Pryce yelled across, and asked what prayer was required to banish the undead. The ferryman replied that any faithful prayer to Aeladh would do.",
                "Rachel replaced the dead candle with the third new one. You looked at the candelabrum, remembering what the ferryman said. Only the prayer of a believer would light them all. And you knew no prayer to light them. Fair, the paladin, had no prayer to this God either. But in their midst was one who's kin held true to Aeladh in their elder days. Agis' life was upholding the ways of his dying people; he knew a prayer. He lit the third candle. Fin gasped. It was over.",
                "The shrine was bathed in light. A blast of radiant flame erupted from the three candles, ridding the three lesser undead of their stolen souls. Fin remained, but took the blast. And had it not been injured before, it might have survived. But Pryces' eldritch wound weakened it enough, and the holy flame of Aeladh blasted it apart. Only charred, dead bones remained.",
                "The protection of the shrine over the river went on.",
                "The ferryman met you and thanked you for your service. He rewarded from his coffers, replenished your potions, and gave you three cases. One held a map of the area. Another was a letter to Maynard of Ashford, soon to be his son-in-law, to take over as ferryman and river warden of the shrine. But the third was your letter of recommendation to his Lord, Aldred of Camelborne, who dwelt at Caer Camlyn.",
                "You rested, healed, and took the next day to help repair the ferry, proud of your deeds on the River Else."
            ]
        }
    ]
}