{
    "title": "Interlude - Something Personal",
    "sections": [
        {
            "image": "./img/archer.webp",
            "paragraphs": [
                "After defeating the possessed Carla and resting in Hambur for the evening Agis travelled to the Vallasaari village with the remains of one of their rangers and trinkets found in Carla’s hut to help identify any others who were missing to their families. Agis was greeted and thanked for any help he had given by Ervain the Vallasaari Emissary to Hambur who then told him a little about the Village of Perydrall set in the remains of an ancient Elven town and that their leader Silat was currently at Caer Camlin.",
                "They explained the Idol that possessed Carla was in the image of a demon called Gullibus and had come across it from items taken off a goblin raiding party who were attacking villages on the edge of the river Tomel while heading south, Belleg had then took the item to Carla for study. Before the companions of the broken spear had encountered her four other rangers who had went searching for Belleg had not returned and were believed to be at a hunting lodge in a forest near Averwick possibly in possession of the Idol and requested Agis help in finding them.",
                "Naven a Vallasaari Ranger from the village and Agis headed to the lodge where they found their trail, picking up the pace they reached the forest in the early evening and the tracks showed one had broken off from the rest Naven suspected this might be Meglan the leader of the party. If it was and he had the Idol they both agreed to track down the others to get more information.",
                "The Rangers tried to set up an Ambush from the trees However Agis spotted this and both he and Naven managed to defeat them without killing any of them, they seemed to be under a stupor and their eyes looked infected. Naven advised he would stay with them while Agis headed after Meglan.",
                "Picking up the trail Agis easily caught up to Meglan who was at a loggers cabin and had killed a human before jumping across the logs floating in the river that were held by a gate waiting to be sent down shore, seeing Agis he stopped while balancing on one of the logs and a ranged fight ensued during which Meglan spoke in third person revealing that he had been possessed by Gullibus and tried to get Agis to join him, using the cabin as cover Agis got a shot with his Bow into his chest and he then fell into the river Vanishing under the logs, Agis tried to use a rope and grapple to save him but missed, other Humans then came out of the cabin and helped set up a net to get the body as they opened the gate sending the logs down the river.",
                "Retrieving the body Agis found a tattered pouch that held the Idol which was now lost in the rivers current. They then headed back to Perydrall with Meglans body and the 3 other rangers who appeared to no longer be under any influence.",
                "Agis then had a conversation with Ervain who explained that Ashford had been stricken with a plague at about the same time Lord Aldred son became sick and these two things and what happened in Hambur may be related, Agis then restocked at the village before heading back to Hambur to see if any of the other companions where there before heading to Ashford."
            ]
        }
    ]
}