{
    "title": "The Pie Competition",
    "sections": [
        {
            "heading": "Pies",
            "paragraphs": [
                "You began the investigation immediately. Jacksal had dispatched his children and wife to their grandparents, but spoke to Pryce and Rachel. Your questions revealed the bitterness of rivalry between Jacksal and farmer Mortimer. You used telepathy to press the questions, but even the reading of his thoughts gave no clues, and you were asked to leave after he took offence at magic being used in his house unasked.",
                "Ser Davian was encouraged. He suspected Mortimer had escalated his long-running feud with Jacksal so tried to kill him. He as happy with your enquiries. Night fell, and you retired.",
                "The next morning, on the eve of the Shieldmeet, Hjulner took Weylin to the church library to research the green flames in Jacksal’s oven. Agis and Nilsson searched the village for more clues, eventually making their way up to the ruins of the old windmill.",
                "Pryce and Rachel went out of the village to speak to Mortimer. He was working on his farm, and seemed agitated to see you. He protested his innocence. Jacksal was a bully, but he didn’t want or try to kill him. It must have been an accident. Rachel tried to read his thoughts as he became agitated, and into your mind came the vision of an apple, with a worm. Mortimer began to sweat, coughing. Pryce probed his motives again, and again the vision of the apple appeared, but also a meeting with a woman. Mortimer got angry, and turned to see Rachel burrowing into his eyes with hers. ‘Who is the woman?’ you asked. “What is the worm?” you asked. And Mortimer broke down.",
                "At the church, Hjulner and Weylin found texts relating to green flames, and their link to demonic appearances throughout history. When banished, these demons left behind an ash used in magic rituals, likely involved in Jacksal’s fire. You joined Agis and Nilsson at the ruins.",
                "Here, Agis and Nilsson looked out over the village. The hilltop was littered with ruined walls of the old windmill, with tumbling stone offering hiding places. Agis conducted a search, and quickly found someone was hiding among the stone, someone small. This turned out to be Jacksal’s daughter Jadya. She was terrified. You pressed her about the fire, and she sobbed, ready to take the blame for all of it. But then another child came out of hiding – Mortimer’s son Timeo – and although unable to look Nilsson in the eye, he admitted setting the oven on fire. They found some weird ash that Mortimer used, and snuck into Jacksals’. They wanted to destroy both ovens, to stop their fathers feud once and for all. They had no idea the ash would burn so strong. They sobbed, and you sent them to Blessed Mother Dakara in the Church while you went to see Mortimer."
            ]
        },
        {
            "heading": "Special Ingredients",
            "paragraphs": [
                "Mortimer and his wife sent the children out of the parlour while she put some tea on. Mortimer sobbed and coughed from illness, and explained that he met the village alchemist Carla two weeks ago. Later, Mortimer felt unwell, and had an apple. He thinks he fainted and hallucinated. In the apple was a worm, which explained to him that he would put the bile that grew within him into the pies for the festival, and cook the pies with an eldritch ash that he could buy from alchemists in the shire. And this he did.",
                "Then Hjulner, Agis, and Nilsson arrived. You heard the full story and conferred with each other over the children in town. Hjulner cast his mind across the farm, finding the taint of fiendish evil growing in Mortimer. But you also found it in tiny amounts in the kitchen. Here lay Mortimer’s pies, ready for the feast. Nilsson burned them in the oven and the taint faded. Mortimer’s face twisted into rage, but he could do nothing, so he asked what would happen to the pies already in the competition. Realising the danger, you took Mortimer back to the village.",
                "It was afternoon. A party had begun and the ale was flowing. You took Mortimer to the church, where Dakara saw him and arranged an exorcism. Outside. Three men demanded and received a taster of Mortimer’s tainted pies, but Davian was fed up with their demands. He admitted to you that Lord Alrded would not visit the village as his son had taken ill. Some rich merchants were upset, so he donated a barrel of his own ale to the feast. The merchants, all arrogant fops, were already several bottles into his best wine too. You saw in them the same illness that Mortimer had. Pryce and Rachel went to investigate the alchemist’s cottage, while the rest of you assisted Dakara in the church."
            ]
        },
        {
            "heading": "Bad Apples",
            "image": "./img/apple.webp",
            "paragraphs": [
                "Dakara oversaw a circle of protection, and began the exorcism. She burned incense and led a chant. As the candles flicked, you saw Mortimer spasm in the middle of the circle. He vomited uncontrollably, his body twisting and shaking, then collapse. The bile spread out, but then rose into two humanoid shapes. These bile monsters developed claws and teeth, and their smell was repellent, but neither you nor Dakara tolerated their presence. Nilsson piled in with your greatsword, Hjulner your warhammer, and Agis your blades.",
                "Outside, the nobles demanded more pies even as you began to destroy them. When the pies were all gone, you watched as their faces contorted in anger. But then something horrifying occurred, and the villagers routed. The three nobles were burst apart from inside, revealing three more bile demons. Davian didn’t hesitate, drew his longsword, and dove among them. Pryce and Rachel took up position at range, and blasted with their arcane powers.",
                "Davian was badly injured by the time the church doors opened, and out came vomit-covered Agis, Nilsson, and Hjulner. You had dispatched the two demons within, blasting one with holy flame and the other with uncaring steel. You charged across the village, cheered on by the onlooking peasantry. Pryce and Rachel’s eldritch blasts, and Ser Davian’s blade took their numbers to two, and with Nilsson and Hjulner’s help, the monsters decomposed into the ground. The village cheered.",
                "Ser Davian was treated by Dakara. Relieved, he paid you 50 crowns each for finding the culprit behind the fire, and offered you a further 100 crowns each to find and destroy the creature behind the demons. Mortimer recounted his meal with Carla, who was out of the village visiting her customers. But Blessed Mother Dakara had another reason she left her home…"
            ]
        },
        {
            "heading": "Sausage Dog",
            "paragraphs": [
                "Marla Spittal ran your bath, while Fair went to look at the house of the missing alchemist, Carla. A dog followed you, and whined as you approached the locked door. With no way in, you stopped, and spoke to the dog, offering it some sausages from the butcher. It wasn’t Carla’s dog, but belonged to her lover, a hunter called Beleg. And it was told to stay put at Carla’s over two weeks ago. It hasn’t seen them since. It told Fair that the vomit smelled like Carla, whose scent led out of Hamber. It picked up another recognisable scent too - Beleg’s master. That scent led to Ser Davian’s castle. When Fair returned to the Inn, Ser Davian had a few words of warning. Whilst your good deeds were welcomed, your lack of supplication to the church was concerning, and drew the suspicions of Aldsere Dakara. As Davian explained, the village had seen its fair share of charlatans.",
                "Agis was summoned to the castle that night. Ser Davian welcomed you to his hall, where he had another guest. This guest was the emissary from the Vallasaari clans, known as Ervane. The Vallasaari spoke in courteous, calm, assured tones. He was aware of accusations against his clan from local farmers. But after several of his hunters went missing, he suspected the farmers of retaliation. He would like Agis to look into the missing hunters and to be aware of the difficulty if evidence was found of conflict.",
                "You adjourned to bed afterwards, where you were reunited with a dwarf who arrived in the night; Risvin, the wise dwarf soldier who helped you in the dungeon of Elsewatch. On the promise of a share of the spoils, she joined you."
            ]
        },
        {
            "heading": "The Feast",
            "paragraphs": [
                "The feast of Shieldmeet was a rousing affair. Marla Spittal and her taproom were bedecked in flowers and bunting, well-noted by Nilsen, and you left the inn to see the whole village turned out in its finery for a service at the church. There, the farmers Mortimer and Jacksal consoled each other and embraced, putting their rivalry aside at last. Fair donated a great sum to the church to show fealty and was noted by Aldsere Dakara. The villagers lined up to pledge their service and labour to Ser Davian, and Ser Davian to protect them. When it came your turn, Ser Davian gave you thanks but asked for no pledge from travellers in his lands. Thus, you pledged to each other.",
                "And so began the merrymaking. After a few ales, your thoughts turned to the task of hunting down the demon that tainted the pies, and back to Carla’s.",
                "Carla’s house was locked, but the smith opened the door, and in you crept. There were alchemical supplies everywhere, but no signs of life. Fair searched for demonic traces and found tiny grubs in among the ash of the fireplace. The dog shied away from them, and whined at the loss of his master again. You destroyed them, and asked the dog if he could lead you to the scent of Carla and Beleg. It gladly did so, as more of the butcher’s sausages were offered."
            ]
        },
        {
            "heading": "On the Scent",
            "paragraphs": [
                "You were led out of town, north to where the track ended, and on into the rolling countryside. After an hour the dog stopped at the top of a hill and waited. Nearby was a copse of trees. You got closer, and heard the sound of flies. Fair divined the presence of a fiend, behind a felled tree trunk. There was merely a corpse, its stomach ripped out and badly lacerated. It was infested with grubs. The dog whined and ran away, as one of the flies and one of the grubs grew into the size of bears, rushing at you all with horrid aggression.",
                "The battle was tough, the stench of the creatures ghastly, but with bowshots from Agis, sword work from Fair, mouth-frothing greatsword savagery from Nilsen, and Risvin’s axe-hacking, both the oversized maggot and the leering giant fly where made into pulp.",
                "The corpse belonged to Beleg, the dog’s master. It could only be consoled with more sausages. It noticed a pungent stink towards the nearby woods. It recognised this path from its days out with the lovers, where they would spend time in a hunting lodge. You asked it to lead you there, and it gladly obeyed."
            ]
        },
        {
            "heading": "The Lodge",
            "paragraphs": [
                "The woods peered in at you as you passed through, but Agis kept you safe from any mishaps or missteps, and soon you happened upon a peaceful clearing, in which lay a slightly dilapidated but homely stone cottage. Beside it, still on tether, was the corpse of a horse. And here and there darted rats. Upon seeing you, they scurried under and into the cottage.",
                "Agis scouted ahead, peeking into a shuttered window to see a hulking form with its back turned, and a lot of movement near the floor. You backed off to the others, who advanced into the clearing. You decided to fire a salvo of burning arrows into the cottage to smoke the figure out, with Fair sure it was the demon. You loosed your arrows, and waited.",
                "First came the rats, dozens of them. The swarm was upon you in no time. They crawled over you, biting and scratching. Arrows were no use, and your swings with axes and blades picked off only a few at a time. The wounds soon started to tell, as Agis was forced to flee, toppling the torch you lit the arrows with to clear you a pathway. Risvin was being bitten everywhere, and even the heavy armour of Fair was proving little protection. But soon their numbers thinned a little. That was when the demon lumbered out of the door.",
                "It was a hulking creature, a huge, bloated woman, clothing torn and skin stretched by rolls of fat all over. In one of her clawed hands was a rotten, infested loaf of bread. She moaned and lurched towards Fair, spitting crumbs and laughing about the dinner she was making. This is what remained of Carla.",
                "She pounded on Fair’s mail and shield repeatedly, battering your arms limp, and drawing blood with her poisonous bite. Risvin’s wounds were severe, but together with Nilsen and Agis you had dispersed most of the swarm and now concentrated your strikes on the demon. Swords and axes carved up fat rolls, drew ichor and blood in equal measure, as she directed most of her wrath at the Paladin. She struck out at Risvin, who was knocked unconscious. But together, with Nilsen’s greatsword drenched in blood, you finally brought her down. She collapsed in a heap of flesh and grub-infested bread in the middle of you.",
                "After the battle, now late afternoon, you stepped into the cottage, and found trinkets belonging to Carla and Beleg. You found the corpse of another hunter, gathered up their belongings, and beheaded the demon as proof of its fate."
            ]
        },
        {
            "heading": "Land and Coin",
            "image": "./img/glutton.webp",
            "paragraphs": [
                "When you returned to Ser Davian that evening, he was overjoyed. He welcomed you to his hall, and rewarded you with coin and some of his weaponry. He took from its stand his own mithril chain shirt, and offered it to one of you. But he also asked that you make Hamber your home, and help to defend it, even for a short time. As an incentive, he gave you some land outside the village, with an abandoned farm on it. He was happy to have other cottars work your land so long as you paid them well and gave him his landlords’ due. But he also asked that you take on an apprentice alchemist, offering you Carla’s house in the village if you did so. Georgina Tucker, whom Nilsen had asked about your dragon’s claws, was the perfect candidate.",
                "You retired to rest and heal. You made plans to hire the cottars and take up the offers from Ser Davian. And after that, you would decide what to do next…"
            ]
        }
    ]
}