{
    "title": "To The Sunless Gorge",
    "sections": [
        {
            "heading": "An Opportunity",
            "paragraphs": [
                "The gift of land to make a home and to farm was generous, but the farmhouse itself was a ruin. Thankfully, a fortnight has passed since you began work on repairs, and the workers pressed into service made good progress. The grateful farmers of Eastwatch, rescued from their doom by Fair and Rachel, were invaluable. So when you all returned from your personal distractions, the farmhouse was suitable to keep the rain off.",
                "Word reached you from Hjulner, stand-in Sere of Ashford, of the disappearance of Maynard, the fiancée of Parsifal the Ferryman’s daughter (‘Ferry Cancellations’, below). He had been sent on an errand by men from Caer Camlyn, a task from Kingsthegn Aldred, Lord of Camelborne, himself. Your hoped-for trip to Ashford to pass the letter from Parsifal to Maynard, to keep the river border safe under his protection, could not be achieved.",
                "Weylin arrived from the village, and explained that he has researched the patterns of your brands as far he could, but the library in Hamber was small. The nearby town of Tarrowby and the valuable library of the Ardsere Mausel, could provide more material. Tarrowby was also home to a tallow-makers guild, from which seals are stamped. The library likely held information on those seals. But without the approval of Kingsthegn Aldred, the powerful Ardsere refuses access.",
                "And so, when men arrived from Caer Camlyn to offer an opportunity to make your names beyond Hamber, Nilssen was first to see the merits. The Lord’s son, Aiden, has been struck down by a disease or a curse that cannot be cured by those at the court. The herald of the Thegn has scoured the shire to find suitable and upstanding folk to find a cure. Aldred’s court wizard knows of a tribe of goblins that sold a single apple which is said to cure all ills, once a year. They dwell from a place to the west of the shire called the Sunless Gorge, beyond the River Attley. Weylin quickly agreed to the quest, seeing the opportunity to gain favour, and permission to research, from Lord Aldred. The rest of you, for various reasons, also agreed.",
                "And so you set off the next day, having acquired supplies and a small suit of leather armour for Rachel. You would take the track to the Tomwood logging camp which Agis had visited, and down the Tomil to Casterbridge."
            ]
        },
        {
            "heading": "Negotiating the Waterways",
            "paragraphs": [
                "The journey overland was quiet. The rolling grasslands and hills of mid-Camelborne were peaceful, and you reached the Tomwood by sun-down. You pressed on to the camp. When you reached the camp, the headman spoke to you all, and seeing the tiefling in your midst, objected to you staying at the camp. But Bragi stepped in, and persuaded the headman of your bravery in defence of Hamber. The headman realised who you all were, and apologised, gratefully offering you the protection of the camp for the night. And furthermore, he had heard of the Sunless Gorge, on the other side of Casterbridge, but unsure of where exactly. But he knew it was near the village of Oakhurst, and the blighted lands nearby.",
                "The next morning at daw the logging camp awoke and you negotiated a loan of their boats down to Casterbridge, with which you made good time downstream. At the confluence of the Attley and Tomil rivers, the boat traffic increased. Many travellers were happy that the way to Ashford was safe, and that the mines could trade with them after clearing the plague and undead infestation that cut the village off. By late afternoon you reached Casterbridge. Travellers forewarned you of its complex politics, as the bailiffs of two local knights contested for control of the bridge and its revenues. Fair remarked that it seemed a distraction from the task at hand. Casterbridge was built entirely on and around the huge bridge structure, guarded by three robust towers along its length which loomed overhead as you moored the boat at the western side.",
                "A surly half-orc harbourmaster arrived to take a tax on your mooring, and demanded to know your purpose at the bridge. The tax seemed high, and the demands ill-met, but the half-orc’s manner was not persuaded by Bragi’s intervention. When Fair got involved, things got worse, and the tax seemed to increase. He backed up his demand with guards at his back. When Nilssen, backed up by the others, appealed to his good sense, the half-orc backed away and took a small sum for the boats and asked no more questions. He did have a niggling suspicion that this own mind has turned against him however…"
            ]
        },
        {
            "heading": "A Tumble With the Weeds",
            "paragraphs": [
                "The evening wore on, and so you bedded down along the trail as it climbed from the river and into the rough hills. Beneath an overgrown escarpment you made camp. It offered good shelter from the cold winds, and good sight over the hillsides. But in the middle of the night the plants of the escarpment came to life, and withered the rest of the land nearby to take tall humanoid forms. They struck at night, with only Agis’ keen eyes alert to the danger.",
                "Three forms ambushed the camp, the first leaping at Agis. It’s tough vine-like limbs tried to grasp at him, but he darted clear. He pounced with two blades, one carved from an archaic wood, and sliced into its dry form, sending dead greenery everywhere. Pryce, barely conscious, flanked it and let fly with crackling bolts from his fingers. The withered plant was wreathed in eldritch power, and crumpled lifeless to the ground. One of its fellows jumped from the top of the escarpment to assault Fair, without her mail armour, and wrapped her in barbed, constricting vines. Big mistake. Fair called on her ancestral power, and used its vines against it, sending caustic flames that reeked of brimstone along their length to engulf and destroy the thing that dared to strike her. The final blighted plant, ignoring the odds, barrelled towards Risvin, but flailed harmlessly as the dwarven soldier rolled out of the way. Rachel’s eyes flickered at the monster the instant a raven dived on it from nowhere, sending slivers of poison through its system with a rake of its talons. Bragi alerted Nilssen to the danger, encouraging the northman to follow the raven’s strike precisely. Nilssen, slow to react at first, realised the call, and bought his great blade down into the shoulder of the vine-formed humanoid. It severed through all from top to toe, crunching into the dry and dead heart of the thing.",
                "The wind blew traces of the creatures away, but not before Fair recalled the last time she heard of this. Possible they were creatures summoned or created by druids in desperation, or corrupted by a disregard for the natural world they swore to protect. Fair kept a vine from one of them. You doubled the watch, but got sleep as required, before you kept on the trail to Oakhurst the next day."
            ]
        },
        {
            "heading": "Friends For Hire",
            "image": "./img/bridge.webp",
            "paragraphs": [
                "Oakhurst was a small, but obviously once-wealthy village that sat on a plateau overlooking the hills you just passed through. The land here was poor, and everyone you saw on the way was wary of you. But here, in the Old Boar Inn, the taproom is alive with people offering to help you. ",
                "The first, a halfling, said he had accompanied a group to the Sunless Gorge already, two weeks ago perhaps. Three people – a sturdy gentleman from Ashford seeking a fabled Goblin Apple, a local woman seeking her fortune, and a hunter seeking the goblin tribal leader. The halfling waited for them atop the crevasse for a day or so, but when they didn’t return from the gorge he made his way back, knowing that others – you for instance – might want guided to the gorge in turn. He asked 30 crowns to show you the way. Fair offered 15 crowns plus a share of the loot, and the halfling accepted the kind offer. Nilssen, for whom counting was equal to sorcery, seemed to doubt the balance of the deal. The halfling left to get his pack and take you there at once.",
                "While he did so, the barkeep offered rooms at the inn and surmised you’d arrived, like so many others, to undertake the task from the Thegn. He offered a scrawled map to the gorge for the sum of only 10 crowns. You accepted, and he drew a map that “climbed up past the cliffs and north to skirt the old woods before heading west into the ashen waste. From there, west past the abandoned farms would take you to the top of the gorge.”",
                "You paid the money, took the map, and explained the change of plan to the halfling when he returned!"
            ]
        },
        {
            "heading": "The Waste",
            "paragraphs": [
                "Your evening at the Old Boar Inn was spent entertaining the locals with song, and learning a thing or two about the local land in return. One farmer pulled up a chair and explained a little of the wasteland, known as the Ashen Waste, between here and the gorge. It existed for many decades, and his family farm tried to work pockets of the land but failed, going to work for another farmer instead. He showed you a clump of twisted vines, remnants of creatures they slew last month. Nothing grows in the waste but barbed plants. And some sprout these vines, which come to life in deadly fashion. Fire is their enemy, he confirmed.",
                "The next morning, you visited the Hucrele store, from where you purchased oil. Kerowyn Hucrele and her husband ran the store, and sold you a selection of potions donated by the Camelborne court mage, who passed this way last month. Their daughter Sharwyn accompanied a warrior called Maynard from Ashford and a Vallasaari ranger to the gorge in search of the Goblin Apple two weeks ago. She learned magic from a young age, but avoided service for her lord. They assumed her dead, but asked you to bring her back from the gorge if she survived. They would reward you with 200 crowns, plus your outlay for the potions (some 300 additional crowns).",
                "And so you made off early for the gorge, climbing the switchback track up the cliffs as the barkeep suggested, following the track north around the gnarled oak woods, and heading west once you climb above the treeline. From there, the bare, lifeless land lay ahead. Agis checked the land as you passed through – it seemed unnaturally desiccated, decades old, and flat. The familiars of Pryce and Rachel spotted ruined, lifeless farmhouses nearby, and a set of obelisks further west. The track disappeared into the dust, and shoots of barbed plant-life sprouted here and there. But in the mid-morning cool sun, you passed through undisturbed, and so to the obelisks.",
                "Two rows of stone pillars marked the end of the trail. But to the north and south, the lifeless plain was torn by a rift some fifty feet across. The pillars marched to its edge, most broken, fallen, or split. A similar pairing of columns lay on the opposite side. You noticed a knotted rope around one of the columns, leading over the edge and down into the ravine.",
                "Pryce sent his familiar down, and saw the rope rest on a ledge some fifty feet down. It had a campfire on it, and signs of passage, both goblin and of others. A switchback stair carved out of the ledge led down to the floor of the ravine, covered in rubble. But the wall of the ravine opposite the stair was made of collapsed masonry, as if a fortress on the surface had been thrown into the chasm. Ruined towers lie strewn across the floor of the area, but from the wall of masonry emerges a round tower, and in front of it a courtyard formed by battlements. The battlements appear as if they are a top of a tower that has been swallowed by the ground. So you descend; down the rope, and then down the stairs, standing in the courtyard in front of the double doors which lead into the ruins.",
                "You step forward to examine the doors, which seem newer than the rest of the structure. Underfoot, some rubble gives way, and Agis steps aside from a fall into a ten-foot deep pit, covered by a trapdoor. In the bottom of the pit lies a goblin corpse, and four giant rats which are annoyed by your disturbance. The rats can’t climb out of the pit fast enough, so you pepper them with arrows and stones to kill them quickly. Volthune, the terrifying familiar of Pryce Ward, sucks up the coins that lie around the goblin body, and regurgitates them in to the grateful hands of its master. Vile."
            ]
        },
        {
            "heading": "Shame and Ruin",
            "paragraphs": [
                "Rachel’s eyes roll back in her head, as the unseen shape of her familiar turns into a centipede and crawls under the door. Inside it sees a hollowed-out round tower, its floors long destroyed. Four goblins lie dead in the chamber, one impaled against the wall by a spear. Two other doors lead off deeper into the ruins. Nilsen watches you examine the doors for traps, before swinging them open. ",
                "The impaled corpse hid a series of runes, written in draconic, that give praise to ‘the Old God Ashardalon’. Heresy.",
                "You stepped over the corpses, all looted. The centipede wriggled beneath the southern door, which Agis determined was the less travelled of the two, and found a half-crumbed room which held little other than a door on its completely-intact western wall. The door was carved in the shape of a rearing dragon, a keyhold carved into its open jaws.",
                "Leaving this room behind, the centipede crawls under the northern door and sees a long corridor. Two doors lead off, one straight ahead and one north, halfway along. Nilsen cared not about the northern door, and as the centipede crawled under the door directly ahead, his patience was wearing thin. The centipede had spotted a large, irregular-shaped chamber in which sat a large cage and with many doors off. Wimpering came from one corner of the room. Nilsen didn’t want to listen to a centipede anymore. He smashed open the door.",
                "At once, a small creature, a kobold with a draconic face and scars across its body lept up. It held only a frayed rope, and looked terrified as you charged in. The creature begged for its life, and you learned its name was Meepo, the Ashamed. Meepo was the handler of a sacred creature called Calcryx, but Meepo had been cast aside by his clan because Calcryx had been stolen by the goblins nearby. Meepo, you soon discovered, was a dragon, pearly white, and twice the size of a cow. This was much larger than the previous drake you faced. Nilsen spoke to Meepo, calling him Meepo of the Rope, and asked about the apple. Meepo did not know about it, but his master Yusdrayl would. Yusdrayl was wise, he said. And so you went to seek Yusdrayl.",
                "Meepo took you through the chambers of the ruins to a room with a long hall lined with dragon-shaped, carved stone columns. Some tougher-looking kobolds stood guard here, and told Meepo the go back to his place of shame. He slunk back, and they discussed that Meepo was not instantly slain by you, so you must not want to kill them. They took you to meet their leader, Yusdrayl. At the end of the hall sat a throne made from bones and bits of an old draconic altar. In the jaws of the dragon-shaped altar lay a brass key. Seated in the throne, almost too small for it, sits the massive figure of Yusdrayl, a troll. Either side of her stands and unarmoured kobold, and around her stand four heavily armoured kobolds, her elite guard."
            ]
        },
        {
            "heading": "The Favoured Servants of Calcryx (one day)",
            "image": "./img/meepo.webp",
            "paragraphs": [
                "Yusdrayl relaxed in the throne. She asked specific questions, one at a time. But Nilsen ignored them, and roared at her for the apple. She disdainfully looked around you all, and asked which apple you sought. There were two – an apple made of apple, and another apple, made of vines. She saw the vine apple leave here many weeks ago, but it had returned, carried by a Vallasaari ranger. The other apple was not here, and must be below, with the ‘outcast’, a creature called Belak.",
                "You asked why Meepo was cast out, and she replied that it was for many reasons. Meepo had brought shame upon himself by letting the ranger, the knight, and the wizard pass by into the Goblin Den. But more than this, he had lost their patron and sacred totem, the dragon Calcryx, to whom Yusdrayl wanted to teach the ways of wisdom and patience. Calcryx was to be their saviour, to grow large, and lead them to glory and power. Yusdrayl looked forward to being the servant of the dragon. You then asked about the runes and the name Ashardalon. She smiled. Ashardalon was an old god, ancient when men first came to this land, not merely the dragon you see carved into pillars here. But Ashardalon is long gone, making this place perfect for raising Calcryx to similar glory.",
                "She looked around again, and Bragi perhaps thought he noticed a spell had been cast, but without any of the kobolds moving. Yusdrayl’s eyes darted to the invisible familiar and she scowled. Displeased, she ordered her guards before her.",
                "She offered a bargain – return Calcryx to them, and defeat the goblins, and she would permit their safe passage. She offered to show where her traps lay on the way, and recommended Meepo go with you to reclaim the dragon. Meepo was sent for, returned, and was armed with a new rope. He seemed to grow taller and take some pride is getting the chance to reclaim his beloved charge."
            ]
        }
    ]
}