{
    "title": "The Sunless Citadel",
    "sections": [
        {
            "heading": "Abandoned Places",
            "paragraphs": [
                "Negotiations were over, and you left Yusdrayl behind. Meepo led the way back to his room of shame, and led out another door to where stood two kobold guards. They looked bored, arrogant even, and hurled abuse at Meepo as he passed. But Meepo kept his head down and continued around the corners to an ancient stone door on the north wall. Here he paused and disarmed two traps, before standing aside and letting you tackle the door.",
                "Rachel’s eyes frosted over again and your centipede-like familiar crept under the door to see a room beyond covered in rat droppings. But it was empty, so you pushed the door and it opened safely. Agis located two sets of tracks, some human-sized, others likely goblinoid. All the tracks led north to another stone door. You checked its edges and found nothing dangerous, so pushed it open.",
                "The chamber beyond was long, with two main rooms connected by a corridor off which were six doors. In the first room was a dried out fountain, carved in the shape of a dragon, upon which Bragi located an inscription. It read 'Let there be fire.' Pryce, Nilsen, and Fair tried to start a flame using means both mechanical and magical, but nothing happened. Around the room you could see small patches of soot, as if caused by small blasts."
            ]
        },
        {
            "heading": "Unquiet Souls",
            "paragraphs": [
                "Rachel led away toward an ornate door opposite the fountain, and sent your familiar beneath it. Inside it saw a room lined with upright sarcophagi, carved with very old Vallasaari figures. At the end of that room was an altar, upon which sat three items: a candle that burned brightly, a crystalline whistle, and a dusty glass vial. Fair looked at the door to this chamber and she spotted an inscription over the door, reading “rebuke the dead and open the way.” But Fair’s creed gave her power over demons, not the undead, and your channelling of that power seemed to do nothing to the door. But you saw that the door was unlocked anyway, and opened it. As it opened, a sharp, scythe-like blade struck out from a concealed cavity in its centre, cutting into your torso. Fair cursed her luck, but things would get worse.",
                "Fair stepped into the room, noting the Elven (or Vallasaari) tombs, and towards the altar. As you stepped halfway in, followed by Pryce, Volthume (his familiar), and Ristvynn, the six sarcophagi opened. From those on the north wall came grimly-armoured skeleton soldiers, possessed of a vengeful menace. From those on the south wall came much more shambling skeletons, armed with poor weapons.",
                "The battle was hard-fought. Ristvynn held off two foes until Nilsen and Agis arrived, outflanking them and eventually cleaving through them both. Fair toiled but eventually left one smouldering in hellfire-ash as Rachel disrupted another’s possessing malevolence enough for Bragi’s crossbow to find its mark. Pryce calmly resisted the sword-blows of your soldier-foe, before casting its possessing force to the far corner of the room. Here, you all pressed your advantage, leaving the last undead soldier a heap of dried and dead old bones. At this point, you saw the whistle was gone from the altar, so you took the other things."
            ]
        },
        {
            "heading": "The Thin Green Line",
            "image": "./img/dead-knight.webp",
            "paragraphs": [
                "Meepo stood back again as you explored further. Agis followed the tracks of the goblins to a door in the west wall of the dragon-fountain room. But those of the humans seemed to head north, before leading back again. Agis followed them north, and into another room with another dried-out dragon fountain. It seemed like two pit-traps had been disabled here, a sign of other dungeoneers’ passing. The tracks led to a door in the west wall of this room.",
                "You discussed options, and decided to head for the goblins first. Ristvynn took a moment and read out the inscription on the first fountain, which filled with bright orange liquid before guttering out. Ristvynn and Nilsen filled a flask each with the liquid. Meanwhile, Fair, Bragi and the others checked the six doors in the corridor, finding them to be empty cells, only home to a few rat nests. Big rat nests.",
                "Meepo felt it unwise to rest here, so you refreshed yourselves instead before doubling back to the door with the goblin prints. The centipede surveyed beneath it, and found the room beyond to be empty, with only a door in the north wall. So you all stepped in, grateful for an untrapped door. Agis leaned against the northern door, listening as the centipede familiar looked beneath it. The room was long, and at its far end was a crenelated wall, behind which the centipede (and Agis) heard the chattering of goblins. But between their defensive position and the door lay hundreds of caltrops.",
                "Fair, realising the danger, counselled against a frontal assault. You agreed a plan instead. Agis slowly opened the door, and avoided the bell-trap that hung above it. The door opened just enough to give Pryce a peek inside. Enough of a peek to put five of the six goblins to sleep in an instant. The remaining leader, shocked at his charges’ laziness, lept to his feet to see Bragi blast the caltrops aside with a blast of wind, and Nilsen’s frenzied form leap over the wall to plant a greatsword into its skull.",
                "Meepo was amazed at your plan. “Their front line was not to tough after all,” he mused, “but better than ours…”"
            ]
        },
        {
            "heading": "The Nest",
            "paragraphs": [
                "You again decided against a short rest. The centipede snuck under the door in the goblin outpost, and made its way down a corridor and around a corner to see a trio of archery targets lined up, and a low, crenelated wall opposite, behind which sat a group of bickering goblins. The centipede traced its way back to your room.",
                "You returned to the second dragon fountain, and saw the tracks of the other humans here. The tracks led to a door to the west, returning again and going south towards the goblin lines. Fair investigated the door and was overpowered by the stench from behind it. Agis and Pryce examined the fountain. It was much like the last; carved in a dragon shape over an empty bowl. A search revealed three things: a set of pipes in the mouth of the dragon, a drum exposed within the dragon sculpture, and an inscription that read, “Let there be death.” You decided not to read this one out.",
                "Riswynn checked the traps on the floor, wedged open with spikes and disarmed. You checked the door for more and found none. You pushed open the door to the stinking room beyond. The door pushed against a horrid carpet of grease, hair, bones, blood, and rotten meat. Shapes shifted in the mass of rotten filth that was the den of a huge mother rat, interrupted as she suckled her young, her hide ripe with pustules. Other giant rats scurried to the door. Fair pulled the pit lid away, and Nilsen threw a flask of oil into the room and set it alight. The mother rat lept out of the door and across the pit, its claws and teeth dripped with disease, fell upon Nilsen, biting and clawing him, but eventually dying by his blade. Between you all, the rest of her brood all perished.",
                "The inside of the den was awful. Nilsen’s boots sank into the mire of filth, but Pryce’s creature, Vulthoom, dove ‘head’ first into it. You all spotted a humanoid corpse there in the muck. Fair pulled it out – the corpse of a Vallasaari ranger. You looted the remains, which you recognised as those of the huntsman who accompanied Maynard and Sharwyn down here. You happily left, especially once Vulthoom resurfaced with coins and gems hidden among the wretched mess."
            ]
        },
        {
            "heading": "The Raid",
            "paragraphs": [
                "Returning to goblin archery range, you worked on a plan. The centipede scouted ahead again, but a new goblin, a shaman of sorts, had joined them, and it spotted traces of your unseen spy. So the centipede familiar escaped under a door to the west of the archery targets. In this room, it saw a cluster of kobold prisoners tied to a bar on the floor, and a cage that held a halfling.",
                "Your plan was now ready, and Fair led the way, shield up, and charged the goblins. But they heard your heavy armoured steps, and got ready. Loosing arrows into your shield, the goblins scuttled back and through the doors behind the defensive wall. Their leader did the same, as did the shaman. One goblin fell to Fair’s blade but the others escaped north and west.",
                "Behind their defensive wall, Vulthoom investigated the squalor left behind by the goblins. Up on the ceiling there was an array of cables and hooks, but no traps nearby. Riswynn entered the prison, and tried to convince the kobolds of their plan to free Calcryx. The kobolds were unconvinced, fearful they’d be killed if released, or killed by your party after they helped. You opened the cage and recognised the halfling instantly: It was the one who planned to guide you here. But this halfling, Erky Timbers, didn’t recognise you at all, explaining how he was ambushed by goblins after leading a group of people down here two weeks ago, and during the ambush he was knocked out by a foe that looked exactly like him! He picked up his Covenant holy symbol, a pendant with the marking of Vigil, and offered a quick prayer before dusting himself down. He was eager to return to the surface, but agreed to help you first for freeing him. Meepo spoke to his kin, who were unhappy that he was the one to rescue them. But they agreed to help after Meepo fetched them weapons. Safety in numbers; kobold reasoning.",
                "By this stage, Nilsen was already over the goblin wall and opening the door the goblin shaman ran through. You were peppered by arrows from the goblins in the room beyond, who again melted away through the far door. But one didn’t run enough, the shaman. You caught it in the midst of the chamber, which was piled high with supplies, rations, ropes, and drums labelled ‘Vallasaari Pudding’. As Nilsen charged, it extended its hand, and lashed a deep wound in Nilsen’s chest. Nilsen accepted the pain, and cleaved the goblin in two. Pryce was next through the door, psychically lighting up another goblin in the far room beyond. And Agis, leaning back, loosed a long-range shot into another goblin, until there was only one. It scuttled behind some pillars and away south.",
                "Fair clambered over the goblin wall and went north, following the leader into a long hallway with a strong door at one end and another opposite the way you came in. You moved to the end of the corridor and, too late, heard a click as you stepped forward. The floor opened, and into a deep pit you fell. Rachel heard this, and rushed to the side of the pit to help. But you had your grapple out and began to haul yourself up. As you climbed, you saw the wall with the sturdy door lightly frosted over, and a chill reached down the pit sides. The minute you clambered back up, the other door in the corridor opened, and out rushed the goblin leader, with a crazed ritualist behind him. You were outnumbered. Rachel, standing opposite the door, felt a volley of arrows hit her, and you instinctively reacted by casting a pall of darkness over them all. But it is the curved blade of the goblin boss that felled you in the corridor, hacking where you stood. The ritualist readied a spell but Fair was too quick to react and drove a blade through its chest.",
                "Riswynn now led Meepo and the kobolds charging out of the stockade, and Meepo’s sling smote one archer inside their chamber. Riswynn and Rachel’s familiar struck, taking down the boss and cleared a path through for Erky Timbers to heal Rachel. Riswynn buried an axe into the head of one of the two remaining archers, and watched Agis dart from his bowman’s stance, across the room, and slice a neat line across the last goblin’s neck in an instant."
            ]
        },
        {
            "heading": "The Trophy",
            "image": "./img/goblins.webp",
            "paragraphs": [
                "Pryce watched as Nilsen approached a door in the room vacated by the goblins. Pryce stood in the supply room, a larder of sorts, and Vulthoom regarded a set of nets with rings attached. It flopped on them, and emoted a series of painful waves. It drew your attention to the hooks on the ceiling in the room adjacent. A falling net trap, evidently, was intended for intruders such as you. But the lazy critters hadn’t set it up. Then you heard Nilsen speak in the next room, which was lined with draconic columns and had a low, white fog that was beginning to rise.",
                "Nilsen stood in front of another frosted-over door. You listened at the door, and heard the rumble of a large creature breathing on the other side, and called the name of Calcryx. It answered in a rasping drawl “At last, I’m becoming bored.” You called for Meepo, who arrived presently, and fresh from chalking up a goblin kill. Meepo the Slayer. He saw the frost and his eyes lit up. “Calcryx!” he exclaimed, “We shall be together and Meepo shall continue the teaching of Calcryx so that she can lead the People of Yusdrayl”.",
                "So you happily explained that Meepo was here to see it, to which it rumbled “Meepo? The torturer?! That pathetic creature? Excellent. You can send my thanks to Durnn for that morsel.” Meepo looked at you, then away, confused.",
                "He said “Perhaps Calcryx has a different way of seeing things, I think.”"
            ]
        },
        {
            "heading": "Calcryx the Magnificent, Ambitious, and Bored.",
            "paragraphs": [
                "You all assembled in the long hall lined with two rows of draconic-sculpted columns, outside the room that held the white dragon Calcryx. But you were eager not to be ambushed, and so you sent the centipede familiar, Sárgo, under the door to investigate. The room was a guard post, packed with terrified goblins. But the goblins here were ready, and five peppered the invisible space occupied by Sárgo, injuring it. Realising the danger, Rachel unsummoned her familiar to safety. But the goblins held out in their barracks. So Fair decided to barricade them into the room, and piled up barrels from the supply store against the door. It served as a warning in case they tried to sneak out while you dealt with the dragon. The kobolds prisoners stood guard as Meepo unlocked the door to Calcryx’s chamber.",
                "Agis investigated the middle northern door, listening at first, then peering through to the empty corridor beyond, hearing distant barked orders from around the corner. And Riswynn put her ear to the door at the end of the hall, and heard many goblin voices. Meepo stood at the door to Calcryx’s chamber, shaking his head at her words, confused as to why she hated him so much. You beckoned him away from the door, and all of you gathered in the supply store to formulate a plan. Then Fair stepped out to Calcryx’s door, knocked, and opened it.",
                "Within was a room dusted with frost, and with the wreckage of furniture everywhere. In the middle of the room was an iron spike driven in the floor, and a broken chain leading off north. A semi-circular wall lay opposite the door, and high up on it were mounted the heads of some creatures; cattle, a kobold, some rats, and other unimpressive specimens. But below these petty trophies lay the glistening form of a white dragon, roughly the size of a coach and horses – Calcryx the Magnificent – which glared at you.",
                "Fair bent low, weapons away, and addressed the creature as its station required. The white dragon described her capture by a large hairy goblin, which snuck up and beguiled her to imprison her in this room. Fair, holy knight of untamed nature, stood before one of its apex predators and praised its majesty. You explained your plan to set Calcryx free, to rid her from the machinations of Yusdrayl and the power games between goblin and kobold inhabitants. Calcryx, impressed at Fair’s honesty, agreed that Yusdrayl was a poor imitation of the dragon priests of old. She offered you the chance to be leader of her new followers, to serve her in the lair that she would make from the gorge and the citadel, and to watch as she hunted these lands as her ancestors did. Calcryx remarked that Meepo, whom she wished to devour, told stories of knights seeking dragons who died at their hands, and pondered if this tiefling had such a quest. Fair was clear, she did not wish to destroy Calcryx, but to let her become a proud dragon, that would be an example to her kin. So the white dragon asked Fair to help her destroy the kobolds, for whom she had no use, and bring her the leader of the goblins.",
                "Fair left the room, and returned to the others. Meepo was concerned at your plan, but did not want to die instantly. But now Calcryx had left her room and into the larger hall adjacent. Here she stretched out her wings, and the kobolds left here to guard the goblin room begged for their lives as she blasted them with her freezing breath. Fair came back out, and stood before the monster once more. He pulled the barrels away, explaining to Calcryx that beyond the door lay some of these same subjects she desired, who disrespected her by hiding within. Calcryx simply waited, and watched. When the barrels were removed, you flung the door open, and dove aside as the goblins again loosed a volley of arrows at you. Calcryx waited, and then asked what Fair expected her to do, as she was still awaiting the goblin leader. As you spoke together, Agis took up a position, hidden behind a pillar, behind the dragon with bow trained on the goblin guards’ door. Nilsen slowly snuck from the supply room and hid behind the dragon at another pillar. But Fair saw as a chilling mist rose from around Calcryx, and saw the dragon instinctively place its four legs wide and lift its head to prepare for an attack. Its tail flicked near Nilsen’s pillar, and its head could reach as far as Fair.",
                "Agis, using the rising mist as cover, tried to dart past the wary dragon. You passed right behind the rear of the beast, but it marked you well, and turned to face, angry and suspicious at your attempts to hide from it, and demanded you stop at once. But you ignored its roaring demands, and darted to the north door, and the dragon struck, buffeting you with its claws on your way out of the room. Now the dragon was furious. It had been disrespected, and it demanded Fair fetch the head of this impudent Vallasaari.",
                "Nilsen had seen enough. You quaffed a potion, and felt the strength of volcano-dwelling giants in your muscles. You lept at the dragon, and with all your frenzied, frothing might, pinned it to the ground. With a free hand you pulled out a javelin, and jabbed it at the beast’s head. It snapped and clawed at you, and swung you around on its neck. It froze the far end of the room with a burst of icy breath, but you were too close to reach."
            ]
        },
        {
            "heading": "Sacrifices",
            "image": "./img/white-dragon.webp",
            "paragraphs": [
                "Riswynn, Meepo and Rachel now stood at the other door to Calcryx’s lair. Meepo unlocked that door too, and you darted through. Riswynn, seeing the battle in the room beyond, could tell Nilsen needed help. You reached into your pack and pulled out a gem. You broke it on the stone floor, and the air swirled. It reached up to the ceiling and took form; an elemental force of air to do your bidding. So you set it on the dragon.",
                "Pryce stepped into the dragon’s mind, and put within it the vision of a silver dragon head bursting through the far doorway. But Calcryx knew it was the only dragon here, and it shrugged off the illusion. However it was enough of a distraction, and let Fair charge across the chamber and back into the fray. The elemental slammed into the dragon, which was pinned by Nilsen’s superhuman strength. It became the focus of Calcryx’s ire, and it bit, clawed, and blasted frozen air at the elemental.",
                "Meepo stared, frozen with anger at your attempts to kill his dragon. His eyes grew red with anger, and he gripped his weapons tightly. Rachel ignored this and perused the dragon’s small hoard, pocketing some scrolls. But Riswynn kneeled to speak to him, explaining that Calcryx was an evil creature, that hated Meepo, and was too dangerous to live. Meepo turned away, and whimpered “I know.” He again regarded the dragon he raised from an egg, but turned away again to Riswynn, saying “You are right. Meepo cannot save Calcryx now.” And as he perused the dragon’s hoard, his demeanor changed. He spotted a crystal goblet. “Thieving dragon took my cup!” Meepo exclaimed, and he seemed sterner now.",
                "Agis tended his wounds, gulping down a potion in the corridor, as Vulthoom took a share of coins and a jade statuette from the hoard, back to a welcoming Pryce. You peered around the corner of the pantry door, and took a pot-shot at the writhing dragon with your eldritch lightning, searing scales from its hide.",
                "Nilsen wrapped his legs over the pinned head of Calcryx, and tried to mount it, grabbing his greatsword from its sheath. As you got both hands on the blade, you lost your grapple, and the dragon finally pitched you off. It reared back, snorting frost as it rose to its full height. Agis now rushed to the doorway behind the beast, notching one of the ancient arrows found beneath Elsewatch Keep. It sank into Calcryx’s wing, and the dragon seemed off balance for a moment. Just as you felt under control at last, the goblins surged out of their hiding place, loosing arrows at anything nearby, and their witch-doctor charged into Agis, but flailed uselessly at the Vallasaari archer. The other goblins fled west and shut the door behind them.",
                "Calcryx reared back, and a layer of frost grew around its bulky body. It drew in the air of the old citadel, and blasted a hurricane of searing cold across the rooms in front of it. Nilsen collapsed from the cold, Pryce and Rachel getting out of the way in the nick of time, but Riswynn faced the cold death exposed. Meepo saw you, and could not bear the loss of two friends in one day. He lept in front of the dwarf, pushing you beyond the reach of the cold, but the blood in his veins froze, and he hit the ground lifelessly. His last words fell from his frosted lips, “You were right.” And at that, Meepo died.",
                "After the blast, Calcryx raged at the elemental, severing its magic bond, sending its essence back to the Ethereum. Free of her strongest foe, her hind leg kicked out at Fair, and it turned to face the you. It growled, muttering draconic curses at you, frost crowning its jaws once more. Riswynn screamed curses, running at the white dragon from behind, but your axe swung into the thickest of its hide, and even the assistance of Erky Timbers couldn’t help. But you ducked the dragon’s riposte, and gave a potion to the lips of the dying Nilsen. The northman struggled, exhausted, to his feet. You all stood, exposed and injured before a dragon now confident of victory. Pryce shook the ice off his fingers and stood in the doorway. You reached into the monster’s mind once more, and pulled a deep paranoia from the recesses there. You used its fear as a blade, as the dragon’s head jerked up, you dove it into the core of the dragon’s bestial mind, and broke it. Calcryx stumbled around, its eyes glazed over, and a wave of frost covered the chamber as it collapsed heavily in the middle of the floor. Calcryx, the wild, ambitious, and magnificent, was dead.",
                "The goblin witch-doctor screeched as the bedraggled Nilsen ran at it, but it couldn’t avade the killing blow that clove it in two.",
                "The room was quieter now, but you all felt seriously injured. Riswynn collected the corpse of Meepo, and the rest of you threw the Dragon’s loot into a rug. You fell back to the goblin outpost again. Vulthoom oversaw the construction of the net trap on the ceiling, and you set up a trigger, some warning if the goblins approached. But they would be cautious and slow, timid for fear of those who could slay their fearsome dragon.",
                "And so, you rested."
            ]
        },
        {
            "heading": "The proposition",
            "paragraphs": [
                "Your watches went undisturbed. The rats generally kept out of your way. Apart from one rat that is, which seemed oblivious to your attempts to shoo it away. When it did, there shortly after came a knock at the door you barricaded. A goblin voice, one that wanted to negotiate.",
                "This was Grenl, the shaman of the Crag Maw goblins. She explained it was good you stopped your assault on their lair because it gave her a chance to parlay. She risked a lot by sneaking away to speak to you. Her tribe was led by Skoag, but he was killed on the surface and a hobgoblin named Durnn had taken over, along with the soldiers he commanded. Now they prepared for battle with the kobolds, expected them to recover their dragon. But with Calcryx dead, the kobolds would be furious, and Yusdrayl’s power great. No chance to escape, no negotiation. Durnn was happy with this, but Grenl didn’t want her tribe to become battle-fodder to enrich a hobgoblin. But Durnn’s temperament presented an opportunity; he needed to rule by fear and strength. If one of you challenged him instead of attacking the tribe, he could not lose face by refusing. Kill him, and his hobgoblins, and Grenl would take his place. She could help the party in return.",
                "She explained that the apples all looked alike, but if you knew how to spot the illusion, it was easy to tell the true nature of the poison apple. Its true form was a sphere of roots, vines, and bark, that seems to resemble a little fat man. Agis recognised the Idol from Hamber immediately. Grenl offered to reveal to them which apple was which if they brought them back to her, after dealing with Durnn. ",
                "You asked about the creature that captured Calcryx. That was a huge goblinoid called Balsag the Hunter. Very powerful, very quiet, very sneaky. He was ‘promoted’ and taken beneath by the outcast Belak, who dwelt in the grove below this citadel ruin. Belak tended the vine creatures, one of which Durnn kept as a pet. But only the outcast controlled them, keeping Durnn here as a watchdog against intruders to the grove.",
                "You agreed to her plan, but kept your guard up as she returned back through the barricaded door.",
                "You completed your preparations, and returned to the room with Calcryx’s corpse. It had been partially harvested of teeth and scales, and you spotted signs of goblin activity here again. Bragi slowly approached the large door opposite, behind which you could still hear a lot of goblinish commotion, to find it rigged with tripwires; perhaps an alarm, perhaps a device to harm. You headed north, in the direction of the deeper, louder voices that echoed down the corridor. You passed an often-repaired door leading south, and the noise of the goblins now hid any sounds of your movement. Ahead lay a stone door with a thick handle laid in. Behind this you heard gruff goblin voices; headmen or the chief perhaps. But you made sure and send Sárgo beneath the door to check.",
                "The familiar surveyed a round chamber with a high, domed ceiling, lit by torches. In the middle of the room was a well and a deep hole, out of which grew hundreds of vines and a dim violet light. They shifted a little, evidence of sentience. The other way out of the room led to a large chamber that must have held the goblin tribe, judging by the cacophony coming from it. But the light picked out the inhabitants of the room, Grenl, her goblin underlings, and upon his throne, the chieftain Durnn with his hobgoblin soldiers."
            ]
        },
        {
            "heading": "Flame of Thrones",
            "image": "./img/grenl.webp",
            "paragraphs": [
                "Whilst you discussed a plan of attack, and Nilsen became increasingly agitated, Durnn bellowed to his goblins to prepare for an attack, and as he roared, one of Grenl’s shamans spotted the tell-tale traces of your invisible familiar. Grenl was shaken, and the shaman flapped at the invisible familiar as it darted from the door across the room and into the domed ceiling. Just as well too.",
                "Agis hauled the door open, and it swung freely on top of you all standing nearby, collapsing the ceiling on you as well. But Agis darted through the wreckage and straight at the nearest hobgoblin, slicing and stabbing past its heavy armour. Riswynn came next, thinking little of the dust covering her, and muscled through the defences of the observant shaman. As it fell, she was swarmed by hobgoblins and goblin warriors. Grenl noticeably held back. Durnn grabbed his greatsword in two hands, quickly opening multiple wounds through your armour and you collapsed to the ground. The hobgoblin captain spurred his soldiers on, and was ready when Nilsen barrelled into him. Your own greatsword sliced through the weak spots in his armour, as Pryce backed off and blasted him with lightning. He shook off Rachel’s whispering doubts that forced him back for a moment. But Nilsen’s roared challenge was laughed off; even Grenl could see this was no personal challenge as she’d hoped. The chieftain, battered and dazed from Nilsen’s relentless assault, yelled for his goblins to aid him.",
                "The other hobgoblins charged into melee with Nilsen and Agis. Agis fended off their strikes, darting from the worst of their flurry but taking cuts and bruising blows. As they readied their next attack, a cloud of biting, slicing blades appeared, and carved through their ranks. Bragi directed the shredding knives through the goblins, who had no time to get clear, and perished under the assault.",
                "Grenl looked at her overlord, and his loyal soldiers, and saw her chance. Weakened by your attack, Durnn commanded her to help. So she helped herself. A roar of flame erupted and engulfed the combatants, making blackened corpses out of the goblins and hobgoblins. Durnn stumbled in the conflagration and fell to his knees, dead. But Nilsen, Riswynn, and Agis also lay unconscious and dying by the second. Erky Timbers rushed forward, but Grenl stopped him from administering aid. She called down the passage to you, and as her goblin tribesfolk arrived to defend her, she asked you to stand down. Durnn was dead as agreed, but no more goblins would die today, unless, she enquired, you wished to watch you fellows die in a further flamestorm.",
                "So you called a truce. The goblins agreed to let you recover, for a short time, under their watch. They quickly went to work making repairs to their lair; Grenl took the throne, and her shamans and enforcers paid homage to her. She asked you not to delay your progress below, to seek out the apples in the grove of the Outcast."
            ]
        }
    ]
}