{
    "title": "The Grove of Gulthias",
    "sections": [
        {
            "heading": "Under the Goblin Gaze",
            "paragraphs": [
                "You rested under the watchful eye of Grenl’s goblins. They continued stripping the corpse of the white dragon Calcryx, and now did the same with their former hobgoblin masters. But they backed down when Nilsen proposed keeping the weapons and armour of their leader, Durnn. Grenl had no use for the armour, and the sword was no use to her either. So his burnished mail armour was adjusted to suit Bragi and his serrated greatsword seemed to suit Nilsen.",
                "Agis spoke to Grenl, and discovered that the Outcast, Belak, lived below in the Grove. There, he was served by many of the twisted root guardians that attacked you above. Alongside these were goblins that he ‘promoted’, including the hunters and their leader, the mighty Balsag. But Grenl had no map to offer, as none of her kin that went down ever returned, aside from Balsag and the other hunters. And the vine creatures that returned below rarely appeared back up here.",
                "You looked down into the vine-covered well-shaft, and a purple haze blocked your vision and darkvision to the room below. Agis tied a rope around a nearby torch bracket, and began to climb down. Vulthoom lept over the edge and tucked its horrid wings in, diving to the floor and below the mist at the foot of the shaft. Both he and Agis arrived in the corner of a large chamber, lined in old stone but covered in thick vines; almost like roots. A haze hung thick in the air, but the room was lit with a violet luminescent fungus that grew in clumps. But gently swaying at the other corner of the room were two robed skeletons. They didn’t move, other than to shift their weight around, and to follow your movement with their dead eye sockets. One held a basket and a small knife, the other a knife and a sickle. The rest of you scaled down the rope and vines of the shaft as Agis checked the southern door for goblin traps."
            ]
        },
        {
            "heading": "Where Nothing Grows",
            "paragraphs": [
                "The room was riven with vines, but few grew around the southern doorway. Fair noticed, and opened the door, leading the way into a passage that led to a deep ravine. The cavern cleft ran for dozens of yards in both directions, and shifted the opposite side of the passage by some fifteen feet. A challenging leap for sure. Bragi led the way, slowly hammering in pitons to form a secure route across for the others. Vulthoom flapped off down the ravine, spotting dozens of similar, two-foot wide holes in the wall of the chasm, all the way down to its bottom some fifty feet below. Sargo buzzed along to the far western end of the gap, and found a mining node with similar holes in the walls.",
                "When you all made it across, Erky Timbers decided to hold the gap and keep watch. You all crossed over, and a passage led around corners to a swollen stone door. Agis again found no traps, but the door took both Nilsen and Fair to pry open. The dust and dirt and water of ages had sealed the room shut. But within, although it was once a grand shrine, you found the room bereft of its valuable trinkets. A statue of a dragon, much like those above, sat at the far end of the room, but instead of a fountain, this one merely held an offering tray. It was empty. Riswynn and Fair identified the room as a safe place to rest, and the whole area had no vines and no foes. And then you heard the shriek of Erky Timbers back at the cleft.",
                "As Agis, Nilsen and Bragi turned the corner, the source of the holes was apparent. Two burning snakes the size of large dogs darted towards the fleeing Erky. Agis sent a volley of arrows into one, helped by Bragi’s poisoned quarrels to bring it down before it reached the halfling. Bragi, having faced these things before, warned against getting too close. But Nilsen ran into the other, recoiling as its snakeskin radiated flames, and chipped away at its burning hide with the help of the onrushing Riswynn’s battleaxe to extinguish its fire. Both lay dead, crumbling to ash, their spirits back to their flaming locales in the Ethereum.",
                "As the embers faded, Sargo flapped along the rift, and found a windy gap in the rock face, through which it flew into a small room with a well-used door that had the sounds of tinkering beyond. The rest of you returned to the shaft room and investigated the other door. All this time the skeletons hadn’t moved, only turning slightly to watch you as you passed by. Behind them the door was sturdy but well-used, and again you heard something tinkering beyond. Checking it over for traps, Riswynn and Nilsen opened the door. Inside was a long room, with pillars carved as dragons, like the floor above. In this long room, working at benches and long tables were goblins dressed in rough working garb, sorting herbs, cutting fungi, and working on the splayed out corpse of a rat. They lept up, startled, and began to run for the door on the far wall. Five other doors closed swiftly along the length of the hall, as goblins inside tried to hide from you. Fair shouted in that Grenl permitted you to pass through, but the goblins wailed back ‘we have a new master now!’ and kept running. And so, in a few short seconds, you cut the fleeing goblins down before they could warn others."
            ]
        },
        {
            "heading": "A Hairy Balsag",
            "image": "./img/balsag.webp",
            "paragraphs": [
                "As Nilsen, Agis, and Riswynn inspected the room, Bragi noticed the vines on the floor move, and turned just fast enough to see a morning star crunch into his side. From the shadows loomed a tall, hairy, goblinoid creature with small eyes and a hunter’s poise. It swung the morning star again, and Bragi fell. Those who remained in the shaft room turned to see him collapse, and saw the tall hunter, which wore antlers as a helm and had a pack of javelins at his back. As you readied yourselves, it whistled, and from the northern passage, you heard something approach quickly. Balsag the hunter had found his prey.",
                "Fair raised her shield and felt the thunderous ball and chain hit, staggering you back sufficiently to lose footing for your own strikes. Nilsen bellowed a warning and charged back into the chamber, only to be faced with a rat of monstrous size, more like a bear with rat-like teeth, whiskers, and tail. It squealed and struck, and you battled back and forth with this abomination and its comrade, which blocked Riswynn’s own path into the fray. Pryce tested Balsag’s mind and felt a beast-like resilience there, shrugging off his mental attacks. Rachel became the familiar once again, her eyes rolling back into whites as the imp turned visible and jabbed its stinger into the hunter. Erky looked for a way back around the the dying Bragi, only to watch as Vulthoom rescued the swashbuckling troubadour by prising his lips apart with a tentacle and using its tail to uncork a potion down his throat.",
                "The hunter again pushed Fair back, relentlessly hammering your shield raised just in time. This allowed Agis a gap to strike, having sized up Balsag’s stance and spotted a weakness in his defences. Your quick blades drew dark, bloody cuts in his hide, and the humanoid turned now to face you. Riswynn dispatched one of the rats, helped by a blast from Pryce, and moved towards the hunter. Fair now found her footing, and you lanced a smiting flame into the side of the goblinoid. It retaliated against Agis, smashing into your arm with a numbing shove. Nilsen struggled with the ferocity of the remaining rat-beast, its face riven with vine-like growths. The thing tenaciously avoided his blows, but found its own mark with its claws and bite. But from the air sprang a hail of knives, whirling through the rat’s hide and sending sickly ichor and blood in all directions. Bragi was back on his feet, hand extended and crossbow levelled. Slowly the tide turned. Bragi loosed a quarrel into Balsag, Fair’s smiting blade found its mark, Agis’ swords ripped at its torso, and Sargo’s sting forced it back. But again Pryce understood when its death was near, drawn to the killing blow like a fly to rotting food. Lightning engulfed Balsag’s antler-helm, burning it’s mind and his body, and it fell to the ground, twitching, but dead.",
                "Seeing its master down, the remaining rat fled back north into the passage. And you were left, gasping for breath and covered in Balsag’s blood, in this room filled with vines.",
                "As the body of Balsag bled out on the ground, you took deep breaths and made some quick spot dressing to your wounds. The sense of danger here, and the ever-watchful skeletons, made you apprehensive about resting for longer."
            ]
        },
        {
            "heading": "Emancipation of The Goblin classes",
            "paragraphs": [
                "You returned to the goblin workshop, and as Bragi listened at doors, you heard some goblins readying themselves for battle. Asking Erky to translate, you instead asked them to surrender, which they did, and opened the door to lay down their arms. A goblin soldier came to the fore, and told you they work for Belak. They talk in awe of Belak and describe him as wise. But when asked if Belak is a goblin, it laughed and turned slowly to look at Agis. Belak, it seemed, was a Vallasaari.",
                "The goblin soldier helped you round up the goblins in each room off the main workshop. In one room was a repair workshop, in another a grog still, a dormitory, an armory, and a test laboratory, where you found a vial of nasty-looking liquid the goblins said was used on some rats. The rats you saw there were dead, eaten from the inside by horrid root-like growths. In one room you found another goblin soldier, who rebuked the first one for surrendering. Another soldier among them rebukes him for surrendering. You told this goblin he must act as your guide. As for the others, Fair eventually proposed setting them free – a peace offering to Grenl above.",
                "As they scurried back out past the skeletons and up the vines to Grenl’s chamber above, an old man’s voice shouted at them to stop and keep working, coming from the skeletons. When the goblins ignored it, the skeletons drew weapons and attacked. Fair intervened, taking a blow to the leg and as it hit, you engulfed the thing in flames. Rachel pulled several of her favourite stones from her pocket, and smashed the skeleton’s skull off with a volley.",
                "This noise attracted the returning enormous rat, Balsag’s remaining pet. Sargo spotted it approach, and Fair stepped out to prevent it reaching the goblins. It gave the goblinstime, and they clambered up the vines and returned to Grenl’s tribe. The rat charged at Fair, but in its wounded state it posed no danger, and you held it off with your shield before striking its weak belly with your blade. You wiped it clean and returned to the others in the goblin workshop. The goblin guide, Ekvosk, explained that the main door at the end of the room led to a garden chamber, and the grove. He said the gardens are tended by gardeners, some skeletons and the hunters, bugbears, under the leadership of Balsag. Fair investigated another door leading out the same direction, a door to latrine, and found it trapped. Thankfully your shield resisted the fusillade of darts meant to kill you."
            ]
        },
        {
            "heading": "Gardeners World",
            "image": "./img/tree.webp",
            "paragraphs": [
                "You all prepared to open the main door described by the goblin. As it slowly opened you saw a mossy, foul garden of fungi beyond. A haze hung low on the ground and the air smelled of rot. Your guide whispered its surprise to see no gardeners here. But nevertheless, their absence left you free to step over the root/lined floor and into the long hallway. Behind each door lay more of the garden complex, which seemed only capable of growing the rotten polyps and glowing fungi you’ve seen thus far. Pryce conjured an unseen servant to avoid the traps, and it prised open one of the doors into a garden chamber. Here, a sickly old tree grew in the centre of an octagonal room. Bragi spotted the mist that covered the ground swirl beyond the tree, and saw one of the fiery serpents hiding there. It had no desire to feel your blade, so kept hidden.",
                "Again, your guide shared its concern at the absence of the gardeners. Either they were away, which was good, or gathering, which was bad, or they were…",
                "…Two shadows sprang from the dim recesses of the hall. One had Pryce cornered, the other loomed up beside Erky Timbers. Both wore black smocks and furry leather armour. Bugbear hunters. Pryce felt the long axe of his foe bite into your side, but it felt a spike of steel from his knife in return. Bragi forced it to flee from the whispers in its mind, and Pryce stabbed again as it fled through the southern door. Erky reacted in time, dodging the first blow from his attacker, who too hit and ran back out of the chamber through the northern door. Agis gave chase. And now, seizing its opportunity, the fire snake darted out to strike Fair.",
                "Agis stood in the doorway, bow trained on the long dark hall beyond. It was much like the one you all stood in, extending the root-covered garden further north and extending into doors north and east. But as your bowshot tracked the room, you saw no sign of the hunter. It had disappeared into the murk again. So you waited. You need not wait long. A long axe jabbed from the shadows, doubling you over, and the creature slammed the door in your face, disappearing off into the shadows once more. Fair darted to and fro with the burning reptile, striking when possible, but getting singed in the process. The creature’s bite found a weak point in your significant armour, and you collapsed unconscious. Pryce looked into the room and saw the creature try to bite and burn your defeated body, and sent an eldritch lance at the thing, followed by more of Rachel’s stones, killing it.",
                "Agis tended his wounds and fell back to the others. The hunters used the dark corridors to their advantage, struck with precision, and melted away.",
                "But Bragi had a plan. Pryce’s ethereal servant opened the door once more, and into the hall crept Rachel alone. You kept your eyes peeled, but as you stepped into the centre of the overgrown hallway, a dark shape landed before you, and stabbed its glaive into your chest. And you disappeared. The hunter turned to see the still-open door and the illusory Rachel fade away. The real Rachel stood beside Agis, who knelt low with your aim trained on the exposed bugbear. As it turned to see you both, its jaw opened and its eyes narrowed. Into the open jaw lanced the bodkin, lifting the hunter by the head and depositing it several yards down the hall, dead before hitting the ground.",
                "The goblin guide whispered ‘one less gardener’ and you looked around for a safe place to conduct more spot dressings, now feeling the effects of several injuries.  "
            ]
        },
        {
            "heading": "Ambushing the Ambusher",
            "paragraphs": [
                "You understood that your hunter foes were too good at opportunistic attacks, so you went on the hunt instead. Standing back to avoid an ambush, you sent the phantasm Rachel through the door to the south of the main hallway. The invisible Sargo marked two groups of goblins trying to hide, and as the fake Rachel moved to the far end of the room a javelin hit the ground through her shape. From above the door growled a bugbear, standing on the door lintel. Nilsen and Risvinn found the creature and dispatched it with your axe and blade.",
                "The goblins were pared down to two by the time the bugbear fell. The remaining two dropped their weapons when asked and raised their hands. Your goblin guide laughed at their surrender and teased them for doing so, but you accepted it and offered them the chance to return above to their fellows. They gleefully accepted, and again the guide was left red-faced with shame as you kept him as a guide.",
                "With the doors south explored, you turned north.",
                "The northern passage held two doors, and behind the eastern one was an arboretum much like the others. This one was in the most advanced state of decay, the sickly grey tree in the centre almost collapsed under the fungi and polyps that grew upon it. You sent in the illusion of Rachel, but this time there was nothing to find. The roots on the floor looked the same as elsewhere, but you now realised that these roots were not coming from these trees. Given the extent of their pervasion around the lower complex, these roots have grown over many decades, perhaps centuries, but their source was unknown. You left this chamber and continued north, and sent Sargo into the room beneath the thick wooden door. This was another garden, with another tree at its centre, much less sickly in appearance than the others before. Roots grew everywhere again, and between them stepped a pair of skeletons who pruned the stalks of the fungi and squeezed the juice from the tree polyps. As they worked, one spotted the dust move abnormally, and creaked towards the hidden Sargo. Rachel snapped her familiar away from the mortal world for a time. Bragi resolved to do away with these things, and both you and Fair charged in, smashing one apart into shards of bone, and chasing down the other, which ran as Erky Timbers brought forth his symbol of The Watchman. But you found the way ahead; a stone door marked with runes led off to the south west. As you stepped towards it, the roots grasped at your feet here and there, but you shook them off easily enough, and gathered with Pryce and the others at the carven stone door.",
                "Sargo was sent beneath it. The familiar saw into a long corridor that opened into a large room with a round side wall, an apse of sorts, in which sat a towering draconic statue of tinted blue marble. A dim red glow lingered in its open jaws, casting long shadows around the room. Nilsen grew tired of listening to Rachel explain what she saw, despite her excellent vocabulary. You opened the door, and strode in to face the dragon statue. This shrine had a carved runic tile set in front of it, just below the dragon’s jaws. Pryce, hearing of the runes, rushed in with wild eyes. You stood behind the flagstone and saw that it read ‘Let the sorcerous power illuminate my spirit’. As the others began to file into the room, you braced your feet, told your unseen servant to stand by, and blasted off eldritch lightning at the statue. Nothing happened. You fired off another cantrip, still nothing. Bragi asked what the runes said, and you told him. As you finished the words, the dragon’s mouth erupted with orange flame, engulfing you. As you stand in the flames, you feel inspired, an afterglow of warmth. As you step off the tile, the shadows behind the statue begin to move."
            ]
        },
        {
            "heading": "And Back to Being Ambushed",
            "image": "./img/shadow-creature.webp",
            "paragraphs": [
                "Erky Timbers and Rachel held off entering the shrine room. Looking at the orange glow from the room, you both missed the roots as they tightened around your ankles. Seconds later, you were both held fast, and two humanoids made from roots and vines stood from the growths beside you. Erky took a clubbing blow that almost knocked him out, but he was free at last and fled the room back into the hallway to the gardens. Risvinn and Agis turned from the enflamed Pryce and assaulted Rachel’s attacker. Rachel disappeared in a puff of mist, reappearing beside Erky, as seen through your familiar’s eyes and unrestrained by roots.",
                "Nilsen turned to lend his sword, but watched the shadows of the room grow, even as the flames receded around Pryce. They formed into vague humanoid shapes, and crept along the walls to stand beside you, Bragi, and Pryce. One struck Bragi with a soul-chilling claw, draining you of your strength. But your blade was mastered by agility, not merely force, and you darted back behind Nilsen and Agis. Agis looked around and saw his escape cut off, and whispered to Aeladh before your feet became a blur of movement. You darted under the grasping claws of the shadows, back through the vine blights, and stood near Rachel and Erky. As you moved, your blade passed through one of the vine creatures, splintering shards of root from it. Pryce backed off behind Nilsen, who heard a whispering in his mind, and in a moment of inspiration you held out the driftglobe, rolled it into the midst of the shadows, and commanded it to burst into daylight. From their dark corners they shrieked as only malevolent spirits might, and flailed wildly at Nilsen and Bragi again. Pryce’s unseen servant got in the way of one, and was destroyed by its passing. But Pryce almost doubled over in mental anguish as your patron’s emissary, Vulthoom, was gripped by the vine creatures in the adjacent room, and perished. The other humanoid stepped into the room of shadows and trapped the fleeing Izbolk, your goblin guide, felling him with crippling slam of its branch-arm.",
                "Nilsen pressed into the swirling mass of shadows, using the daylight to pick each one out. You hacked at one, cleaving through it and dissipating its necrotic evil. Agis darted out and sliced into the injured vine blight, and Risvinn finished it off with a brutal chop. Rachel now returned from hallway with Erky, and smashed the other damaged blight with your stones. Both now fell, and you could see the light and shadows reach out from the doorway to the shrine room. Agis described the scene to the terrified, and badly injured Erky. He stood as tall as his halfling size allowed, and brandished his symbol of Vigilance, He shouted at the top of his voice, and banished all three remaining shadows, forcing them to fall back behind the shrine statue in the next room. Bragi, Nilsen, and Pryce piled in, harrying the undead abominations in their hiding places, and as they were destroyed, the recesses of the room became brighter, and the air less chilled. Finally, the last of them gone, you let your weapons fall from limp arms, and you relaxed for a moment. You gathered back in the shrine room, and saw each other battered and injured, so you agreed to rest here, heal, and figure out where Sharwynn and Maynard had gotten to down here.",
                "You checked under the next door to ensure nothing dangerous hid there as you rested.Pryce used the last of his brimstone to summon Vulthoom once more, and both lept from their rest at the news that the room next door, free from foes, held a library...",
                "You rested, and having healed your wounds sufficiently, you gathered up your gear and readied in the library. Your watches were mostly quiet. Pryce could not be held back from the library, and his red-ringed eyes tell of a man who is accustomed to lack of sleep and reading in the night. But during the middle watches, you heard echoes through the complex; guttural, deep rumbles here, clanking metal there, and now and again, the shifting of some vegetation."
            ]
        },
        {
            "heading": "A vine mess you've gotten into",
            "paragraphs": [
                "Agis and Bragi did a thorough job of making the door beyond the library safe. Pryce spent time pointing out interesting passages, some concerning dragons, others the citadel in which you rested, and the cult that built it. He had to be pulled away from the tomes, but as you opened the door he could be seen stuffing many into the folds of his robes and his pack. The door beyond led to a set of steps and a short passage blanketed by hanging vines and roots from above and through the walls. Some seemed to come from through the floor above, perhaps the dying tree in its arboretum, but most through the walls over the passage. Fair locked a shield in place, readied your sword, and pressed ahead into the curtain of vines. You brushed past them, feeling sickly fungal spores drop onto your armour and to the ground, but once through the vines did not hang back naturally. They curled up, and fell to the ground as one large mass. The mass became humanoid in shape, and ahead, at the top of a similar staircase to that you descended, stood another shambling mass of roots and vines. Some formed a face, so fair decided to speak, asking if there was not a bloodless way to reach their shared goals. The face responded with the voice of an elderly man, but firmly reminded Fair of the destruction they had wrought in place of a bloodless way thus far. Both humanoids pressed on both sides of Fair, and so the others had seen enough.",
                "Risvin and Nilsen both piled forwards, through the vines, and into the flank of the shambling husk. It appeared not to notice the damage they wrought on it, nor that of Agis’ blade as it tore out a large mass of roots. And it made no noise as you all followed it to Fair with ceaseless attacks, falling as it was about to strike the paladin. The other struck Fair with a firm slam of an appendage, which Fair responded to with a flaming rebuke that almost burned it to the ground. Your silvered sword shattered charred vine and chopped the creature to its end. No wail or voice accompanied its death.",
                "You ascended the stairs and slowly reached a corridor lined with alcoves. Within each alcove sat a draconic statue, and in between each alcove was a wall sconce for a torch. But for now, your driftglobe provided all the light in this dim passage. It turned south, and the long corridor gave Agis pause. He meticulously checked, step by step, ahead of the party. After some time, you reached the end of the long passage. Apart from the sickly roots, vines and immobile dragon statues, nothing threatened you. But two doors led east, neither of which revealed any sounds of what lay behind.",
                "Sargo crept under a door, unseen to all eyes. Rachel perceived a room beyond, with orderly shelves, books, and a table laid with notes and scroll tubes. The floor was mossy and covered in soil, with a few stalks rising from it. Before the imp could look any closer, one of the stalks reached out and grasped at it. Another took form behind the table, and prepared to slam down on the centipede form. Sargo lashed out, stinger missing the vines, and it disappeared as its presence in this world was extinguished. Rachel lost sight of the room. But this didn’t matter to the others, who charged in, led by Fair. The paladin assaulted the first vine blight, followed by Nilsen and Risvin. Agis notched a bodkin and struck into the other abomination, and Bragi’s bolt sliced deeper into it. Both creatures soon fell under the weight of axe and greatsword.",
                "Rachel stood in the corridor outside, checking the other door with Erky whilst the others investigated the room. Pryce mused over a tome, written in draconic, as Nilsen and Fair picked through the drawers of the desk, finding hundreds of gold coins. Risvin and Bragi trawled the bookshelves, finding some interesting scrolls. Pryce, fixated on the book, leafed through to a page that came alive with black symbols. He was transfixed. And then the book exploded in a shower of spores, a cloud of poison that engulfed everyone in the room. Choking and bleary-eyed, you recovered to see Pryce looking sheepish, still flicking through blank pages, confused. Agis, who avoided the worst of the spores, put his ear to the door in this study. You checked with Rachel, and feeling a slight breeze under both doors, realised it was likely to the same room she stood at the door of. You simultaneously opened both doors."
            ]
        },
        {
            "heading": "The Grove Gate",
            "image": "./img/tree-creature.webp",
            "paragraphs": [
                "The chamber beyond was strewn with goblin supplies and vines. But its southern wall had collapsed. The citadel wall opened into an immense cavern, dimly lit with fungi and lingering, violet spores. It was overgrown with six-seven foot high vines and sickly weeds, blocking your vision beyond, but above this, in the distant violet haze you saw crumbling towers poke out, and weeds growing up the pillars into the violet-speckled cave ceiling beyond. A nearby tower would afford a vantage point, but before you could assess it for danger, one of the nearest vines sprouted, becoming humanoid, and spoke.",
                "It addressed you angrily and wearily, but answered questions you had, explaining how Belak had tended things here in the grove. It told how Belak allowed one apple into the surface, to grow the vine creatures, who would return here. At times it answered you as if it were Belak, others in the third person. But it then explained how Belak was not yet ready to let an apple go, not until Gulthias had its feast. The apple may be released in good time, but the price was half of the party, who should remain here to serve, as Belak serves. You reminded the creature of Maynard and Sharwynn, whom you tracked here. The voice appeared to remember them. Yes they were here too. So it beckoned that you decide. Whilst you chose, his archers would ensure they maintained target practice. With that remark, eight goblins armed with shortbows sprang up from behind the crumbling tower nearby, and opened fire.",
                "The arrows rained down, peppering Risvin and Nilsen. Fair braced her shield and charged up the spiral stairs to the upper level, arriving as the goblins hid behind the wall, and away from sight from the rest of your party. Only you could see them, so they turned and loosed a volley of arrows into you thick armour. But all armour has weaknesses, and your was no different. You fell under the hail of bodkins, bleeding from wounds beneath the mail coat. But as you fell, a pall of darkness covered the tower. Rachel held it there as Bragi sent a swirling cloud of knives into the dark and you both listening as the goblins panicked amid a horrid slicing of flesh and bone. As Fair bled and slowly died, Nilsen and Erky raced to the top of the stairs, bumping into goblins in the dark and hacking where they stood. Risvin, Pryce, ad Agis took aim, waiting for the darkness to fall and a target to step into their sight. But the stumbling goblins panicked; some walked into the cloud of daggers again, others into the waiting blade of Nilsen, and another off the edge of the stair. Once their positions were exposed, Rachel lifted the blanket of night, and your party rained bolts, longbow shafts, and lightning into the remaining goblin archers. The misbegotten creatures perished, almost to a greenskin, whilst Nilsen held one against the wall, ready for execution. Erky placed his healing hands on Fair, and helped you to your feet again, as Nilsen placed his hands around the neck of the goblin and relieved it of the burden of life.",
                "You stepped looked out across the top of the vine forest, and saw in the distance how the glowing moss and fungi illuminated a dark shape, a tree of sorts, that loomed high over the rest of the growth. Seeing this, Pryce lurched for a second, seeing the tree amidst a vision of something terrifying. You seemed to the others to pause, horrified for a moment, and only returned to the present after extreme exertion of will.",
                "You shared with the others what you saw: A tree, dark and looming, in a violet haze, with long roots extending down and into a hole in the earth, a portal of utter darkness that swallowed all life and light. And around this portal was a ring of symbols, etched in brightest silver. And these symbols swirled around the opening. And they were as those on your brands. You saw into the pit, and only managed, with great effort, to save yourself from being pulled in.",
                "Fair remained at the top of the tower, watching over the top of the thicket of vines and weeds, joined by Rachel, whose sight rarely faltered. Agis stepped to the edge of the sickly brambles, and saw hidden there a forest of nasty thorns and razor-sharp spines on the vines and weeds. But you found a pathway, likely used by the goblins, that provided a safe passage through. And so, in single file, you led the others through, connected by a length of rope."
            ]
        },
        {
            "heading": "Through Thicket and Thin",
            "paragraphs": [
                "Each of you carefully followed Agis, keeping to his exact path, and trying not to panic at the sounds of movement from elsewhere in the cavern. Rachel watched you weave your way into the middle of the thicket. From the recesses of the cavern you spotted the vine-tops swaying, as three creatures converged on the line of party members. They moved slowly, but unerringly, towards the head and centre of the line, so you shouted out a warning. The party readied blades and spells. Pryce’s wild eyes darted here and there, and the moment the creature burst from the thicket you were ready to blast it with lightning. Riswynn rushed to your aid, hacking at it, chopping shards of bark with your axe. Soon Bragi was set upon too, and Nilsen was on hand to aid you by carving it into driftwood. At the head of the line, Agis’s blade quivered, and you reacted fast to strike unerringly up into the onrushing vine creature. Within moments, the creatures were a mass of dead vines on the ground, and you pressed onwards, nursing a few more injuries.",
                "Rachel stepped down from the ramparts, leaving Fair to ensure the coast was clear and leave open an escape route. You scurried into the brambles, and followed the route of Agis. Agis turned you all around and was instrumental in keeping you moving through the brush in the right direction. By the time Rachel caught up, you all passed out the other side of the thicket. And into a lofty area of the cavern. Amid the sharp intake of breath, Riswynn and Nilsen guzzled down a potion."
            ]
        },
        {
            "heading": "The Gulthias",
            "paragraphs": [
                "The ceiling, glistening with violet fungus, picked out the dark branches of a huge and ancient tree. Its knotty trunk twisted as it rose from the bedding of roots and vines at its base to the grim and foreboding appendages that looked like they might slam down on you at any moment. Pryce gazed at the tree, seeing your vision come to life in a way that stunned and horrified you. But something was different; no rune-ringed pit, no roots descending, as if the sight of such a malevolent mangrove wasn’t bad enough. But it was Agis who connected the sight of this horror to the deeper sense of dread here; he explained that this tree was an Elven Kalenuraa. These legendary trees are said to have grown throughout the elven world before the First Sin, growing between worlds to this day. But high up in its boughs was a single apple.",
                "You gathered your senses. Bragi, out of the corner of his eye, noticed a large feline creature crouching behind a nearby ruin, ready to pounce. Agis spotted another figure, standing behind the tree, with a warped staff in hand. But in front of them, fully armoured in thick chainmail and heraldic shield, stood a knight. This was evidently Ser Maynard, which meant that the hiding figure behind the tree must have been Belak. But Sharwynn was nowhere to be seen. Belak began to speak, but his words came out of a vine creature that stood alongside Maynard.",
                "He asked that you bear witness to the Gulthias Tree, which grows from the Ethereum to this world. But now that you have seen it, you cannot be allowed to leave here and bring others, not without submitting to Belak. But the deal still stood; he offered that you leave here and allow half of your number to remain as thralls of the Gulthias, when the apple is ready. But that would take a long time, perhaps months."
            ]
        },
        {
            "heading": "The Battle of the Depths",
            "paragraphs": [
                "You looked at one another, agreeing that this abomination should not survive, and to take the applefrom its cold, dead branches. Nilsen moved to rush forward at the hidden predator in the ruins, but the air began to sing with metal. Daggers filled the area you all stood within, sending shards of metal into your armour and clothing. Nilsen sprang out, as a female figure appeared from hiding behind a further ruined wall. Belak cursed, taking cover behind the Gulthias. Rachel ran from the hail of knives and pointed at the female. Her red hair gave away her identity; Sharwynn Hucrele of Oakhurst. But now she panicked at the whispers Rachel implanted in her mind, and hid behind the ruined wall deeper into the cavern, chased by one of Bragi’s poisoned bolts. The primeval tiger behind the other wall lept out at Riswynn, knocking you down and clawing savagely at your torso. You quickly got up, and aided Nilsen in hacking it back into the cavern.",
                "The speaking vine beast drew up beside you, slamming its arms down onto you, before it was lit up by psychic lightning from Pryce, cackling gleefully. Now Nilsen pulled up briefly, his armour growing quickly searingly hot and burning his skin and hair. Bragi looked at Sharwynn, Belak and Maynard, who was now rushing across the room to aid the tiger. Their skin was rough, bark-like, and their eyes glossy and pitch black. They looked like those of the vine-creatures. They were thralls of the Gulthias, and so the Gulthias must be destroyed. You shouted to Nilsen and Riswynn, who turned towards the tree and exhaled their potions, spewing a gout of flame over the Gulthias Tree, threatening to set it alight. Belak raged behind the tree, and wrapped himself in a cloak of bark armour. Agis backed off, keeping space from the others to avoid getting caught in more dagger-filled clouds. His arrows found their mark in the hide of the tiger. But Riswynn’s axe hit home more assuredly, and the tiger staggered off for a moment, before collapsing and then simply disappearing back to the realm it came from. Maynard was now up to both Nilsen and Riswynn. He drew a longsword of dark metal, an ancient thing, and with expert martial prowess he batted aside the parries and struck into Riswynn, injuring you mortally, before turning to Nilsen. Sharwynn now returned to the fight, and sent off a volley of unerring green arrows from her fingers towards Bragi. The bard already badly injured, fell to the ground. Your numbers were thinning; the thralls of the Gulthias were in the ascension.",
                "Rachel looked up at the tree, and set her face in a fury. You picked a flask of oil from your pack, and hurled it at the tree, coating the upper portion of the trunk, and yelled at Nilsen. But Belak stepped forward, armed with his staff. He stepped towards Nilsen, and a cloud of spores pulsed from his body, swirling around him. He twirled the staff but you avoided his blow, and found another opening to blow a cloud of flame at the trunk, sending the whole tree aflame. Belak gasped in horror, and stepped back to lay his hands on the tree to stop the flames spreading. This left Erky Timbers the halfling a chance to uncord a healing potion and restore Bragi. Sharwynn saw this and attempted to charm the bard, sending a crown of madness over your head, warning the others to stay away lest you attack them. So they did, and you rushed forward with rapiers drawn, striking Sharwynn once through her bark-skin. She put a step between you both, and sent a burst of flame from her fingertips that once again had you on your back and unconscious. Maynard had Nilsen marked, and issued a challenge that Nilsen could not (even if he wanted to) reject as you frenzied. But the knight was equal to your strikes, and took them well. He saw an opening and sliced through your breastplate, giving you a mortal wound. But Maynard’s advantage was short-lived.",
                "Pryce appraised the scene, and realised your strongest warriors were either unconscious or badly injured, whereas their group was at full strength, with a vine-creature still guarding the tree from direct assault. You own arsenal of weaponry was at its limit. But you recalled the scroll from Belak’s study, pulled it from its tube, and unfurled it. The runes virtually read themselves. The tall knight stood motionless, held in place by your spell, and the tide instantly turned.",
                "Agis, standing by, to offer healing to Riswynn. The dwarf soldier got up, you stepped back from the knight and Belak, clove the vine-creature in two, and breathed more fire over the Gulthias. It now began to buckle in the middle, the apple swaying high above. Rachel looked up, and then back down at the stones in your hand. Sharwynn closed in on you, and Belak’s spores strafed tiny poisonous cuts into Agis. You took aim at the base of the tree, and sent one stone at it, chipping part of the blackened truck away. So you aimed a second at the same place, a weak point of the perennial. It struck home. You heard a sickening snap, and then more, and the light from the cavern ceiling changed, as the huge top of the tree collapsed down into its base, breaking branches and sending a column of flaming wood into the air. The Gulthias Tree was destroyed."
            ]
        },
        {
            "heading": "From the Ashes",
            "image": "./img/gulthias.webp",
            "paragraphs": [
                "Belak stopped, horrified for a moment, and then collapsed too. As did Sharwynn, and eventually Maynard. Belak and Sharwynn’s eyes returned to normal. The knight’s helm concealed his eyes but he seemed to pacify too. But then they all began to cough, and up came horrid black and bloody bile. Sharwynn cried for help. Beside her Bragi’s blood covered the cave floor. You were almost dead. Rachel cried out for someone to heal you, and Belak rolled over, extended his arm, and used his final healing spell an instant before you passed. Agis came to his side, and he whispered with his dying breath to fetch his goblins; they would know the method which could cure Sharwynn and Maynard of their thraldom, without which they would die. And with that, Belak’s own life ended.",
                "Pryce stumbled through the embers of the Gulthias, finding a well-protected bole of the tree that held its treasures. But more than that, he found the restorative apple at last. Its healing power would restore Lord Aldred’s son, and the lives of Maynard of Ashford and Sharwynn Hucrele. Riswynn ran to fetch the goblins, and expected to climb the shaft to the level above. But you got to the workshop on this floor and found it guarded by Grenl’s warriors. Grenl had taken up residence now, and she gleefully appraised the goblin wine-making operation. She agreed to repay your mercy by letting the goblin servants make potions from the apple, but would keep the seeds of the apple for herself, as they would grow into lovely vine-creatures that could be of service to her. She thanked you for removing Belak, and said this was her domain now. Once your party was healed, you could return above. But, she finished, this place was hers now, and to return here would mean your death."
            ]
        }
    ]
}