{
    "title": "The Chosen of Ashardalon",
    "sections": [
        {
            "heading": "The End of the People of Yusdrayl",
            "paragraphs": [
                "While some of you rushed to seek the aid of the goblins to make the potions, the rest of you gathered the remaining treasures in the bole of the Gulthias Tree, the corrupted Kalenuraa, and hauled them back to the goblin lair. Grenl was happy to let you return above with Sharwynn and Maynard, but would ensure you could not trouble her any longer. There were many ways to the surface from here, and dark passages led into the deeper caverns of the underdark. And so, when you were ushered back up the shaft to the citadel above, her shamans collapsed the shaft room and the way back down into the grove level.",
                "You got clear of the wreckage, and picked your way through the empty goblin lair, discovering that Yusdrayl’s kobolds had begun to scout the chambers out and also found it empty. You bypassed the earlier passageways and found the boulder had been removed from the short-cut passage between Yusdrayl’s lair and that of Durnn. Whilst Fair fell down yet another pit trap, Agis overheard the kobold scouts drinking goblin wine nearby, so time was running short to avoid bumping into the kobold forces headed your way. Riswynn used her new blade, shatterspike, to break apart the doors with ease, allowing you swift passage towards Yusdrayl’s chamber. Rachel guessed that Yusdrayl may not be with her kobold army, and if not, would not be so well defended. And once you found the boulder gone between  lairs, you realised you stood in a room you’d last been in two days before, right next to the kobold lair. ",
                "You swung open the door, and found the throne-room, this time guarded by only a few elite guards, and three robed sorcerors alongside the throne. But instead of a massive troll, there sat only a kobold wearing white robes and with an expensive ring. An armed servant spotted you first, but could do little to avoid the onrushing Riswynn. She would have vengeance for Meepo. ",
                "Riswynn sliced the guard from shoulder to hip, dropping him. Rachel scurried in, and saw Yusdrayl in her true form, gasping at your surprise attack when she was poorly defended. You aimed the wand at her, and pummelled the kobold leader with a volley of magic missiles from your new wand. Yusdrayl quickly lept off the throne and ran for cover, turning invisible as she did so. Nilsen tried to follow but was cut off by one of her guards, who took a javelin to the chest as it sliced your armour. Pryce felt the darkness well within and summoned a darkness to taste, gnaw, and devour the kobolds around the throne. It blackened the area around the throne, to the screams of the kobolds within, and nothing got free of it. Agis notched a pair of arrows and killed another guard, as Fair’s blade tore apart the other, leaving only one that stood toe-to-toe with Nilsen. Agis, Fair, and Riswynn moved around the passages south to cut off the fleeing Yusdrayl, and Agis flung a hail of caltrops ahead of you all to ensure she couldn’t easily flee past without injury. Pryce sent a storm of lightning at the remaining kobold guard, pushing it back, and giving Nilsen space to bring his greatsword swinging through the air for a clean, ‘all-flesh’ decapitation. And as the kobold’s head hit the ground, a horrifying, pallid white tentacle grasped it and pulled it into the black pit made by Pryce, who felt the satisfaction of his master. Rachel looked into the gaping maw of darkness left by Pryce, her young eyes barely able to comprehend the thing that devoured everything living. But you stepped closer to it, to know more of this thing, to the consternation of the others.",
                "Riswynn joins Fair and Agis, followed by the bloodied Nilsen. But as you turned the corner to box-in the kobold queen, she appeared at the end of the corridor, her hands erupting with a ball of searing flame at you all. Fair dropped instantly, but you charged through it, followed by Agis. Erky Timbers, whose job it was to keep the weakened Maynard and Sharwynn safe, scrambled to assist. Pryce dragged Fair’s dying body from the flames, as another fireball tore through Agis and the others. Whilst Nilsen’s beard was almost ruined, Agis seemed to grow accustomed to the heat and flames, drawing them into yourself and suffering little. And when you spotted Yusdrayl appear once again, you sent her reeling with another pair of well-aimed shafts.",
                "Now Riswynn stood alone with the kobold queen, and she taunted you, asking what became of her failure of an underling Meepo, hoping that he died in the belly of Calcryx before she perished. Riswynn’s crossbow bolt found its mark in reply, but Yusdrayl grinned and focused her power on the dwarf soldier. Until Rachel, who stood the other side of the devouring pit of darkness, hidden there, but fully perceiving through the kobold queen through it, whispered in Yusdrayl’s mind. And those whispers ran riot, driving her momentarily insane, and destroying her mind forever. Yusdrayl, Queen of the Kobolds, pretender to the dragon priests of Ashardalon, was dead. ",
                "At that unfortunate moment, a band of kobold soldiers appeared, and saw that their leader was dead. They looked at you and decided to surrender. They would happily leave the citadel via the way they came to it many moons ago. You accepted this, and watched them squabble their way to the throne room, through a larder, and to a room where the wall had collapsed and opened into a tunnel that led deeper into the underdark. Perhaps, that would wait for another day, thought Rachel as you gazed into the unknown, and listened to the kobolds argue over which of them would be chieftain. ",
                "The others raided the throne area, once Pryce had dispelled his well of tentacles, and found the throne to be made of pieces of a stone dragon altar. In the carven stone jaws was a key, brass and shaped like a dragon. So you took Yusdrayl’s treasure, and the dragon key, to the dragon-carved door located in the early rooms of the citadel. The door, the most ornate in the complex, accepted the key that Pryce turned, glistening with arcane energy for a moment as the wards are relaxed."
            ]
        },
        {
            "image": "./img/sentinel.jpg",
            "heading": "The Sentinel",
            "paragraphs": [
                "Pryce pushed the door open. Beyond was a chamber, long-forgotten, that ended in an arched opening. Tiles on the floor and wall carried through both rooms, cracked and chipped from ages of decay. But the nearest chamber was lined with wall alcoves, and in each was a statue of a human. Some robed, some armoured, but all in stone and pointed at the middle of the room. Below the archway that divided the rooms was a pit, and from beyond it there glowed a green light. Pryce’s mind wandered as the light seemed to sing to him, and you all watched him slowly pass through the door, aimlessly walking towards the pit! Fair was the first to charge in and tackle Pryce to the ground, but you heard the song and were too drawn towards the pit. Nilsen, outside, could hear the faint chords of a song, but realised what was happening and stuffed rags into his ears before charging in and trying to tackle the paladin. And missed. Now Riswynn did the same, but also missed. You both stood at the edge of yet another pit, filled with razor-sharp spikes, and stopped there, as Fair heard Rachel’s voice in her head that blocked the song momentarily, and you recovered your senses. Nilsen stoppered the ears of Pryce before he could rise, and you stood in the room safely at last. ",
                "The three of you stood in front of a large stone sarcophagus. Behind it lay a large suit of pitted and ruin brass armour. The lid of the sarcophagus was cracked, but on the ceiling above it, Pryce could see words, written in ancient draconic: ‘A dragon-priest entombed alive for transgressions of the Law still retains the honour of their position’. Reading it out sent a chill through your group. With a metallic scraping and faintly-audible groans, the brass armour assembled. It came to form an imposing brass quadruped, winged, but more like a ram than a horse. Dusty gas escaped from its nostrils as it towered over you, and stepped forward. Fair wanted nothing to do with this place, and went back across the pit. But both warlocks remained. It tried a few languages before settling on an archaic form of common. And, oddly, it spoke with a calm female tone, seeming despondent.",
                "It explained that it had failed. When pressed, it said it had failed to guard this prison of the renegade dragon-priest Al’Phradeas, entombed here alive for breaking the laws of this citadel. Al’Phradeas had escaped, and had done so with the aid of a guardian. Like her, this guardian was a construct, an ancient thing crafted of silver, in the shape of an armoured knight, and bearing a long polearm weapon that defied her defences. The ancient brass sentinel was unable to leave the wards of this place, but now asked that, in return for the plunder of this tomb, you seek out and return here with the dragon-priest so that her watch might be ended. So you looked into the sarcophagus. There were several scroll tubes, and all but one held their spell scrolls. The sentinel saw it and remarked that the strongest of them had been taken, a shape-changing spell devised by priests who sought to walk freely among others. This dragon priest was free. ",
                "You accepted the challenge, taking the other items, and left the dark ruins behind. You stepped into the daylight, and felt the its winter warmth once more, the Sunless Citadel now left behind."
            ]
        }
    ]
}