{
    "title": "To Caer Camlyn",
    "sections": [
        {
            "heading": "Oakhurst",
            "paragraphs": [
                "You made it back to Oakhurst, lugging around a deadweight of coins, gems, and other loot that made Maynard the Brave and Erky Timbers the Afraid curse ever being rescued from the Sunless Gorge. But when you arrived intotown, a tearful Kerowyn Hucrele rewarded you with her old wand, and the patrons of the Old Boar Inn gave you an roaring cheer.",
                "The landlord Garan provided rooms and baths for the night, and directed your attention to a finely-attired soldier waiting at one end of the bar. He stood away from the dark corner of the taproom so as not to be confused for some northern ranger or ill-met fellow. This was a man of Caer Camlyn, draped in a red and white cloak of House Caster.  He met the toast proposed by Garan and introduced himself. He was Bernardt, a trusted envoy of Lord Aldred. Bernardt was sent directly from Caer Camlyn to escort the cure for Master Aedann Caster. He would prefer if you came with him as further protection but such was its importance that he was instructed to take it regardless of your wishes. His letter of authority could command supplies, food and board, and even fresh mounts where required.",
                "You agreed to go with Bernardt the following day, after a well-earned rest. Maynard would rest here and regain his strength, and Sharwyn reunite with her parents. Erky Timbers wanted to remain behind so hecould find out about his doppelganger’s actions and any trouble it caused. The next day you set off for Casterbridge, where you found abarge that took you upriver towards Ashford, and from there only half a day’sride to the fortress town of Caer Camlyn. "
            ]
        },
        {
            "heading": "The River Attley",
            "image": "./img/cockatrice.webp",
            "paragraphs": [
                "The skipper, a thickset, bearded fellow, happily took you from Casterbridge, and after a halfday you made good progress under sail and oars up the river. The cargo of caged livestock, coal, tools, and lumber were all under tarpaulins. It was Agis who spotted that the barge had become dangerously lopsided, but the cargo and crew were balanced along its length. One crew member went to check the livestock, lifted the tarpaulin, and wailed, before collapsing beneath the cover.",
                "The skipper went to check, and with your help, lifted the cover with an oar. Once lifted, there was a screech, and a flurry of feathers as three crazed cockatrices burst from beneath, catching you all off guard. One darted across the deck at Rachel, biting her on the exposed arm. A grey rot spread over your arm and up your body, dropping you to the deck as you slowly turned to stone. The barge tilted again, knocking Riswynn off his feet. ",
                "The dwarf leant on his broadsword hilt and swung up at the beast's neck, glancing it. Agis cut another off before it could reach the skipper, marking its weak points, and driving blades deep into them, felling the horror in seconds. But they came on, even as Nilsen buried his claymore into the wings of the third cockatrice. It darted across the deck, biting and screeching, before Riswyn caught it between the wings with her sword. Rachel recovered before the petrifaction could take hold, got to her feet, and sent a psychic bolt into the pea-brain of the bird. It shivered, stunned, and reeled back against the gunwale. Price took aim, and blasted the thing up and over the rail, watching it sail across the surface of the river in a cloud of blood and feathers.",
                "The skipper looked at the remaining cargo, including a stone pig, and thanked you for intervening before the whole crew and cargo were sent to the river bed."
            ]
        },
        {
            "heading": "Ashford",
            "paragraphs": [
                "Your skipper, Golith, spent the rest of the day clearing up the deck. As he pulled the tarpaulins from his livestock pens, he saw there nestled in their midst a woman in slightly tattered robes, cradling a spellbook. You questioned this woman, Nilah, who needed passage to Ashford on business. As one oarsman was still a statue, Nilah helped out as best she could to pay her way.",
                "And as the sun went down the warm spring air and easy current made the trip upstream easy-going. You watched the silhouettes of the hillsides roll past, and god what rest you could before the morning. ",
                "The next day, you began to pass into rugged ground, as the River Attley clove between cliffs on its way to Ashford. The skipper explained the reason Ashford was closed for weeks now, falling victim firstly to a plague, then a curse of the dead rising from their graves to assault the living. Only a dwarven cleric called Hjulner stemmed the tide, and found the source of the curse; an undead cleric vowing revenge on his colleague who merely cowered under the protection of the villagers.",
                "Soon, you passed under the wooden bridge and arched stone bridge of Ashford, hoving the barge to the mill-side dock. Three main buildings dominate the village; the Jolly Farmer Inn, the Old Tower, and the Wailing Hall of the Peasant. The overseer instructs the dock hands, and you ask him about each one. He explains about the terrible plague that swept through the village, and how the two clerics tried to put it right. And of the wizard, Janela Fislefond, who lives in the Old Tower, and kept both the undead and begging villagers at bay with fireballs. The inn was your next stop, while Bernardt went to fetch fresh horses.",
                "The Jolly Farmer had the appearance of a converted stable, with booths replacing pens either side of the central walkway, and a low roof supported by posts between the pens. The inn was quiet but busy, mostly with grim soldier-types who eyed each other with restrained emnity. You discovered that one group were retainers of Ser Godmund Elvery, lord of Firstwatch keep, and they were hardy warriors who fought orcs and their kind which hid in the moors of Carrick. Godmund was here to prevent the execution of his brother, Walder Elvery, who was recently tried and found guilty of murder of a fellow cleric and negligence in his defense of his flock. At another table were men of the Covenant court, who had pronounced judgement, and the headsman here to carry it out. You learned from them that Walder was brought to justice by one of your companions, Hjulner the dwarf. ",
                "However, they struggled to find anyone to execute the criminal under the stare of Godmund and his men, and even the fellow sent from Caer Camlyn was intimidated by them.",
                "Bragi left to find Hjulner to learn more, while Nilsen went to find Bernardt and see if he could talk some bravery into the headsman. Rachel and Pryce held back with Nilah, making it clear to everyone that this was not their fight. As the executioner left his seat with the three church militiamen, the men of Firstwatch rose too, and all left for the quickly-erected stage in the middle of the village.",
                "Here, a few acolytes had arraigned Walder, head bowed in shame, and they were joined by the militiamen. They read out the long list of charges, and the villagers assembled, many crying or seething with anger. As the charges concluded, an armoured fellow roared that this was a sham, and that this village would do well to hand over the criminal to him, rather than blame poor Walder for all of their ills. He did not bring the plague, he was but a drunk, and for that he should be stripped of office. He turned to Nilah, asking her if she, a newcomer to town, could be objective and see what the angry villagers were blind to. You responded that death was too harsh a punishment, and the knight agreed. Everyone in the village watched, hands gripped around their meagre weapons and tools, as the knight and his retinue of perhaps fifteen men stood before the small execution party. Bernardt arrived, watching in horror as the headsman stood aside, and Godmund wrestled his brother's chains from the Covenant militia leader. He laughed at them, turning his back in contempt, and calmly led his men away. The impotent militia shook their heads that no-one in the village had the bravery to see justice done. ",
                "Bernardt was angry, but as much at the headsman's cowardice as anyone else's. He reminded the executioner whose headsman he was, and promised a reckoning. Fed up, he turned to you all, and with fresh horses, you left Ashford to the bitter tears of its villagers."
            ]
        },
        {
            "heading": "Uncertain Motives",
            "paragraphs": [
                "You set off quickly from Ashford, taking the afternoon to make your way into the foothills East of the village.",
                "Some of you took the lead with Bernardt, the others lagging back. There, he made small talk, before asking Riswynn what the party sought by letting brigands take the law into their own hands back in Ashford. He heard Pryce mutter about the books of Tarrowby, and his gaze fell on young Rachel. She concerned Bernardt, how one so young could harbour such sinister power. Nilsen shrugged.",
                "As you passed through the rugged lands, Bernardt expressed more concern about the strength of Godmund Elvery of Firstwatch at Ashford. It would worry his master too.",
                "Up ahead, Nilsen was first to spot the clouds turning dark. But as you drew up to the ridge of the next hill, you saw it wasn't the weather but smoke, rising from a cluster of farm buildings around a round tower on the next hilltop. A fire had begun. Bernardt explained it was the stables and farm of the Percers, loyal servants of his lord. He yearned to intervene, but the importance of the mission was paramount. It was Pryce and Nilsen who led the calls for a rescue effort, and you spurred your mounts onwards."
            ]
        },
        {
            "heading": "A Farm In Flames",
            "paragraphs": [
                "Nilsen arrived at the gate first, jumping off his mount which refused to go closer to the flames. You ran into the clearing in the middle of the three barns and the tower, and saw a woman screaming from the top of the tower, something inaudible. The fire had taken hold on one large barn, likely a stable block, and had almost engulfed another. Pryce came next, sending your familiar Valthoom to the tower to listen to the screaming woman. She was yelling for Alvin to come back. Rachel sent her a message to be calm into her mind and she stopped wailing. She responded, oddly, 'Alvin, if that's you speaking to me, come back and be safe.'",
                "Riswyn followed Nilsen to the edge of one barn, and seeing the doors open and the barn empty, moved across the clearing to the well, where Bernardt inspected the pulley gear. Sargo could see the whole farm from its lofty flight, and could see the barn engulfed in flames had its gates open. Valthoom could hear the farming woman calling for two people, Alvin and Orville, and Valthoom could perceive a baby and a young girl inside the tower too, screaming at it. The woman moved to brandish a dagger so the familiar moved to the well. Rachel investigated the trees nearby to see if anything hid there, suspecting malevolent influences as always.",
                "Nilsen could see into the flaming barn now, and saw two people. Whilst the flames kept him back, Sargo flew inside. There, it saw a teenager in charred farmclothes, and a man lying on the ground before him, coughing violently from the smoke and fumes. The boy reacted as if endangered by the invisible presence nearby and waved his arms to create three perfect replicas of himself. Time began to slow down, obvious only to those capable of using magic, and the mortal realm was  momentarily breached. The boy exploded with white light, blinding Rachel's familiar Sargo, before returning to normal. Riswyn charged in, avoiding the worst of the flames, and confronted the scene.",
                "The man coughed and called on Riswyn to calm the boy, Alvin Percer. But Alvin pointed to the ground beside his father, Orville, where lay a sword. Orville had tried to attack his son for some reason, and the boy refused to be sent to the church or lord Aldred for tuition and safe training. Pryce attempted to compel Alvin to be calm, but nothing worked. Nilsen entered the barn, making the case to Alvin to stop this destruction. But he refused. Then, from the opposite gates darted a small incandescent creature, skin of charcoal and eyes burning with flame. Another peered around the side of the stable block near Rachel."
            ]
        },
        {
            "heading": "The Fire Rises",
            "paragraphs": [
                "The first imp grinned in glee as it ran at Riswyn, clawing at her armour and burning her skin. The other was blocked by Bernardt from attacking Rachel, who cast a spell of elemental defense over the Caer Camlyn herald. Time slowed again and Alvin burst with frenzied activity, firing off a torrent of magic missiles that seriously injured Riswyn, before throwing a flaming bolt at Nilsen, narrowly missing. Pryce, at the corner of the intact barn, got line of sight to the imp attacking Bernardt, and sent a blast of force that shattered it to ashes. Bernardt nodded in appreciation, before turning to Rachel and offering her thanks for the spell of protection. He saw in her eyes a flash of satisfaction, and saw an ally for the moment. He looked across at the slithering form of Valthoom on the wall of the well, its tentacles wrapped around an empty bucket. Bernardt and Valthoom met eyes and from that moment they were a team, hauling buckets of water and lobbing them over the gable of the barn before it could fully catch fire.",
                "Rachel now tried her luck with the lad, as Sargo dashed back out of the barn's far door. But Alvin would not abate, so she struck a mind sliver which harmlessly shattered a mirror-image of the lad, while Nilsen wrapped a soaking rag over himself and waded into the flaming barn. There, he tried to calm Alvin again, but to no avail. Riswyn reduced the foes to choose from by cleaving one fire imp in two with a vicious slice, then turned to charge into the mirror Alvins. Alvin had enough of being manipulated, and twinned a mind-control spell over Riswyn and Nilsen. Riswyn remained true, but Nilsen began to see Alvin everywhere; at the well, beside him trying to talk to another Alvin, outside blasting flaming imps, everyone was Alvin. He had no idea which was real.",
                "Pryce blasted out at a mirror image, striking one but missing another whilst toying with the idea of opening a portal to the Outer Realms for an outer dweller to feed on the contents of the barn instead. But Riswyn had enough, and struck out at the two remaining Alvins, shattering the final simulacrum and hacking into the delicate flesh of the real teenager. He screamed, and his concentration on Nilsen's nightmare was ended. The notherner flew into a brutal fury; his first strike sent Alvin reeling with a bloody cleave across the thigh, before catching his torso square on the upward cut."
            ]
        },
        {
            "heading": "Quenched",
            "paragraphs": [
                "Alvin fell to the ground. Nilsen tried to placate him, but sometimes there was no answer to such mania. The son of Niels watched with grim and stoic sadness as the young man died. As he did, the flames died down, and Riswyn lifted the father's arms angrily, dragging him out across the yard unceremoniously, and dumping him at the foot of the tower. She muttered about what kind of man bears arms against his own kin.",
                "His wife emerged in tears, thankful for the return of her husband Orville. Riswyn grumbled as she gave him a healing draught, and Rachel asked Bernardt what would become of them. He looked at the blade on the ground, and the dead boy. Nilsen was already taking the corpse to a plot beyond the hilltop where he found a set of graves. Bernardt pronounced that his lord would have justice here, but also pity that they could not control their son's magical will. Such was the way of youth blessed with power over the Ethereum, but they should have sought aid sooner. His lord would want a penalty rather than a harsher sentence, but the true heroes were the party of the Broken Spear, and to them should rewards be bestowed.",
                "Maireade Percer and her husband gathered some valuables; coins and some healing vials, wrapped up in a bag too small to carry it all. It was a bag of holding. Within were other items, silverware engraved with mysterious sigils and scenes of impossible geometry that interested Pryce. He demanded to know their origin, a wild look in his eyes. The Percers responded that they were heirlooms from a grandparent, Mordlay Percer, who settled in these parts. Pryce thanked them, and looked upon the heirlooms with almost too much affection.",
                "But Orville was grateful to be alive. He wanted an end to magical influence on his house, so he gifted something to the keenest rider of the group. He took Riswyn to the stables. There, at the very back, was a strong gate. And within, there was a powerful, thick-limbed destrier. He had taken this animal in as he found it, origin unknown. But it was a reliable and valuable creature with an otherworldly look in its eyes. Despite the flames, it remained calm, and as it turned to view Riswyn, it stomped the earth in recognition of a new master. This was Blackmoon. ",
                "And so, mounted on rested horses, with a new saddle on Blackmoon, you made back off on the track to Caer Camlyn as the sunlight faded.",
                "You spent the day on the trail. Pryce quizzed Bernardt on the placename Galfell, from where the grandparent of Orville came, owner of the mysteriously-carven silverware. Bernardt has no idea, it was not a name he was familiar with. He detected a certain mania behind Pryce's questions, and rode on. Evening began to draw in.",
                "As darkness fell, a frustrated Bernardt admitted they should seek shelter for the night. A woodland trail had grown into a deep trench, which Bernardt explained was an old river bed formed out of a trail of destruction once wrought by a beast of these parts, long since dead. To the north of that path, you spotted the ruins of an old cottage which could provide ample defence if needed."
            ]
        },
        {
            "heading": "The Not Entirely Abandoned Cottage",
            "paragraphs": [
                "Agis approached and spotted fresh tracks among the older carter and farmer ways, including a set of very deep hoofprints, much deeper than even Blackmoon's. Valthoom haunted across the night sky and through the broken roof of the crumbling stone building. There it spotted little, apart from three statues arranged in one corner of the main room. Nilsen stepped in too, spotting the signs of recent habitation, and warm embers in the fireplace. Nilah examined the statues while Bragi looked around for anything hidden. He spotted a loose floorboard that he prised up and within a puch were 20 gold crowns and two vials of healing. He heard a faint bell ringing as Rachel took out a wand and tested the room for more secrets. Nilah looked at the statues and a cold shiver ran down her spine; they were chipped and worn, but where the chips left a crack or a cove it was blemished with red staining. These statues once lived. In fact, their hands and feet were bound in rope that was also turned to stone.",
                "Sargo had taken flight and both Valthoom and it were scouting across the treetops when Pryce was warned that 'something is coming; something so big it moves the trees'."
            ]
        },
        {
            "heading": "The Returning Patrol",
            "paragraphs": [
                "Agis took up a position at the edge of the tree line. There he spotted humans, a half-dozen, accompanying something big. It moved slowly and had to be led, resembling a huge bull, but with overlapping scales of metal as a hide. Its breath glowed green in the dim moonlight. You could hear them whispering commands to each other, aware you were there.",
                "A vicious firefight ensued, as Nilah put half of the bandits to sleep as they lost control of the armoured bull. It charged forwards and blew a misty breath over the whole area, immersing Bragi, Pryce, and Nilah several times over. But you shrugged off the effects, which stunned you at first but threatened to petrify you, like the statues already in the shack. Other brigands darted between trees, taking cover to awaken their fellows. Nilsen, Nilah, Bragi, and Rachel focused their attention on the huge metal animal, stripping off parts of its hide piece by piece, hexing it, and adding to the accuracy of the barbarian's strikes. Nilsen staggered it, drawing its ire from Bernardt and also Rachel, who darted behind the shack to accompany Riswyn, Blackmoon and the horses.",
                "Riswyn had secured the horses and was ready to join the fray, but her instinct warned her of unseen danger and she threw up a shield spell from her martial arcane tradition, and blocked the deadly blade of the brigand leader. The two slugged it out alone on the opposite side of the of the cottage, until Blackmoon charged in to defend its master, and Rachel gave him a piece of her warped mind. The bandit chief saw that his underlings were dropping to the unerring accuracy of Agis' bowshot and Pryce's force blasts, while their totemic bull-monster was being sliced up by the merciless cuts of Nilsen's greatsword.",
                "At that moment the bull backed off and barged back through the trees, its black blood spattered across Nilsen and Bernardt's armour and blades. The other bandits, seeing this, began to flee, harried by your shots as they melted back into the woods. Their leader was already dashing through the undergrowth towards the deep river-bed track when he was dropped by a magic missile from Rachel's imagination. She liked the look of his dapper clothing, as did Riswyn. Leaping onto the back of Blackmoon, you rode the brigand down. You and Rachel divided up his spoils, while the others picked apart the belongings of his underlings. ",
                "You let the others flee. Agis and Bernardt got to work making up the campfire and setting watches. ",
                "The next morning you left the woods. Shortly, the rolling fields and grasslands offered a view of the road ahead as it curved towards foreboding black basalt cliffs that rose from a promontory near to a wide lake. Atop the cliffs was built a series of black towers, linked by a curtain wall that encompassed both a town and its keep. Bernardt spurred onwards, you had reached Caer Camlyn at last. ",
                "The gatehouse guards stood aside for you and Bernardt, understanding of his errand, and riders parted the people milling around the fortress streets as you made speed for the keep barbican, up the ramp, through the double arches, and beyond the lower ward to the barracks. Bernardt took his leave whilst other guards escorting you on foot through the ornate chambers of the keep to the Great Hall. And here, aside the throne, sat the Chamberlain, Forral Godber. He thanked you for your efforts and applauded your success in bringing the apple. When you presented him with an already-distilled curative vial, he was suspicious. Rachel did little to allay those suspicions by offering to leave with the vial if it was unsuitable. The Chamberlain questioned you further, and from the arches behind his seat came a robed woman who verified your honesty. This was Gwen Redsparrow, mage and arcane advisor to Lord Aldred.",
                "She opened a door to a series of small rooms behind the throne. Here lay the body of Lord Aldred Caster and his son Aedann, linked by a luminous ethereal chain. Lord Aldred's endurance was keeping his son alive, sacrificing himself to save his son. But it could not be sustained long, and gwen took the vial you offered. Forral Godber explained the lofty position you would hold if you saved the life of Aedann, and not to overreach for a reward. (edited)",
                "The vial was emptied and the cure administered. Master Aedann opened his eyes, coughing wearily, and the Kingsthegn Aldred was released from his watchful sustenance of the boy. He blinked, looked around at you, and with something of a surprised scowl, asked 'Who in Aeladh's name are you?'."
            ]
        }
    ]
}