{
    "title": "The Court of Aldred",
    "sections": [
        {
            "heading": "Made of Stars, and Made of Monsters",
            "paragraphs": [
                "The day began crisp, the sound of military drills around the walls of the fortress town. ",
                "Rachel's night time excursions revealed a strange light from the peak of the mage Gwen Redsparrow's tower from time to time. You vowed to investigate, but only after a trip there. As it happened, both Pryce and a druid named Alestri were already in the tower; Pryce to devour the knowledge of Gwen's library, and Alestri to learn more of the land and its lord. Rachel met them both after entering via Gustaf, Gwen's servant. Sargo prowled up the outside of the tower, eventually reaching the top and seeing a window and shutter at the peak of the conical pepper-pot tower. The shutter opened after a few minutes, and then soon after, the window itself. Inside were odd instruments and Gwen Redsparrow herself. She looked at Sargo, and beckoned him inside, speaking to him as if he were a person, and not a crow. Then she realised, and left the strange room, going back to her library, and addressing Rachel directly. You were invited into the previously-locked room. All around were instruments used to measure the position and brightness of stars; you instinctively felt the importance of this, and an odd kinship with those very stars Gwen observed. And when you asked how they worked, Gwen was more than happy to explain.",
                "Nilsen and Agis collected the items harvested from the beasts you defeated, and took them to the smiths of the fortress. There you procured a balanced crossguard and hilt for Nilsen's greatsword, crafted from dragon horn; the softer drake scales they had crafted into a supple cloak, and the scales of Calcryx were formed into a strong coat of scale mail, all able to withstand the might of a dragon's terrifying presence. The other dragon horn went to form a powerful longbow for Agis, and the Manticore spines a set of arrows that could pierce the toughest of hides.",
                "Riswyn gathered her belongings and you found a quiet spot in the fortress. The walls should be more guarded than they were, so you found ample time and space to conduct a small ritual, bringing into being, for the first time, your new familiar. Shortly after, you rejoined the others, who were summoned to meet Lord Aldred, thanks to Agis' diplomacy with the Vallisaari emissary, Methild.",
                "Aldred greeted you together, thanking you individually for your efforts, reminding you of the importance of Caer Camlyn to the defence of this realm. He walked the walls with you after confirming that he had written to Ardsere Mausel to allow you access to his archives. He produced a letter from the scribe Weylin, already in Tarrowby, who was overjoyed at the access he had already gained to the library. He promised to meet you upon your arrival in the town.",
                "Aldred turned to his fortress and explained it could be held with half the number of soldiers he commanded, but his reach beyond its walls was limited by the meagre forces at his disposal. Trouble brewed in the West. Ser Harman Bryce of Elsewatch was well-armed and ambitious, sending only his sneaky halfling advisor to offer fealty at the feast of Vows many weeks earlier. Ser Godmund Elvery of Firstwatch was also a threat, honing his soldiers on the orcs and worse found among the Carrick Cairns. Aldred feared they might combine their powers and mount a campaign against Camelbourne. You explained the presence of a Drake beneath Elsewatch, and Gwen Redsparrow was shocked for a moment. The presence of a Drake, a gift from an old, powerful Dragon, to its vassals, told a tale of great danger. Rumours swirled that a dragon had made its home somewhere in the realm, but it was clearly smart enough, and powerful enough, to remain hidden. Other threats were in plain sight.",
                "He brought from his cloak a refined blade, marked with a rune. Pryce recognised the rune as the same found on the scroll case from the Sunless Gorge. Khundrakar, it meant, and referred to a secret mountain-hollowed stronghold of dwarves. Aldred explained this blade was recovered from a scouting party of orcs in the West, and it was crafted in better fashion than those of his own smiths. He needed to know where these were being made. Such blades could be turned over to outfit his own men, and swing the tide of a battle against Bryce and Godmund, or prevent one at all.",
                "But a promise was a promise, and that task would await their return from the Adsere's Archives at Tarrowby. You agreed, and Pryce marched off to find the Silversmith he gave a set of plates to earlier in the week."
            ]
        },
        {
            "heading": "Little Shop of Eldritch Horrors",
            "paragraphs": [
                "Pryce knocked on the door but no answer came. A few locals noted they hadn't seen the silversmith around in days, and he was rarely out of town. You decided to give it another day.",
                "Returning the following evening with Valthoom and Alestri, Pryce asked around before knocking. No-one had spotted the smith, but they were sure he had a sign in the window yesterday. You had enough of waiting, and called for the others to keep an eye out while you popped around the rear of the shop. There, Alestri granted you the power to spider climb, and you ascended the yard wall to the unkempt garden and workshop yard. No signs of occupation. You darted up the main wall of the house and onto the roof; You needed a diversion to get past the guards on the roof, which Alestri provided. And while on the roof, Alestri became a ferret and followed you, sneaking to the chimney top. There were signs of a warm fire below, but maybe days ago. Someone was here recently, and wasn't answering the door.",
                "Riswyn, Agis, Rachel, and Nilsen had arrived, and waited at the front door. You looked through the windows, and thought you saw someone. But knocking the door once more, no-one appeared. Nilsen was annoyed at someone stealing from you all, but remained calm. Rachel stood at the door and peered inside through the window, curiously whispering that she could pop in and have a look around. Barely had you affirmed her request, than she disappeared in a silver mist and reappeared inside the room. You looked around, seeing through the pitch blackness, and you stared into the empty shop, seeking out items of magical power. An object at the far end of the room glimmered for a moment. And you felt the presence of something nearby. Alestri in ferret form appeared, and sprinkled a veil of faerie fires around the room. And to your horror, there loomed over you both the figures of four grotesque shades - women in dresses and mourning veils - who whispered to you in a dark tongue.",
                "Naturally, Nilsen had seen enough. He burst through the door and into the middle of the room.",
                "Rachel ran, swapping places with Riswyn, who charged into the room, as Agis darted in to take the shade unawares, severing its link to the mortal realm in a few quick strikes. Nilsen opened the strap on his pouch, and rolled a globe onto the floor. There, he uttered the Huor word for daylight and the sunlight from his orb burned at the dark specters, including three more that had remained unseen until now.",
                "You battled the creatures to and fro; their chilling claws injured your very souls, but they shrieked in the burning daylight each second they fought you in it. But one of their number fought with terrifying bitterness, reaching out of the doorway and into the moonlit street to chase after Pryce. This shade screamed at Pryce, burying its claws deep into his chest and almost dropping him where he stood."
            ]
        }
    ]
}