{
    "title": "Tarrowby",
    "sections": [
        {
            "heading": "Wrapping up in Caer Camlyn",
            "paragraphs": [
                "Once the Castellan was done taking evidence, he was sufficiently satisfied that your break-in at the silversmith's workshop was warranted in light of the other-worldly creatures found there. He ordered the contents of the shop to be quarantined, and at Agis' suggestion the fortress Sere examined the pieces for ethereal taint. Once he was happy that everything was safe, he ordered everything to be carted to Tarrowby and the Silversmith's widow.",
                "The Castellan realised this was a perfect chance for you to travel with his guards to Tarrowby, and to protect the cargo en-route. The following morning you set off. Pryce invested some crowns in a tailored brigandine of studded leather, and wore this beneath riding gear. The note from Weylin, who was already in Tarrowby, beckoned you to meet him in the Dead Herring Inn."
            ]
        },
        {
            "heading": "Smoke on the Water",
            "paragraphs": [
                "You made good time along the road to the River Halbeck, and paused at the Helbeck Ferry, where Riswyn and Nilsen met the boatmen you helped before. The ferry was working again, and doing brisk business. The fee was steep, but Nilsen contested a game of smoke rings with two of the boatmen. Despite the competition from the otherwise dim Big Lungs Bill, Nilsen wowed the waiting travellers with a surprising trio of smoke rings split by a single square smoke ring. The boatmen happily let you across, and made up their wagered loss by increasing the price for the remaining travellers.",
                "Beyond the ferry, and into the afternoon, the track became a road again, and patrols of wardens nodded at the Camelborne men accompanying you. Other travellers greeted you politely whilst keeping a wary eye on your weapons. The road became busier, and soon you saw the spring sunlight glint off the spire of Tarrowby Cathedral, with its bright copper roof. You entered the westernmost gate, the Camlyn Gate, by late afternoon."
            ]
        },
        {
            "heading": "City Slickers",
            "paragraphs": [
                "The open square beyond the gate, signposted as Camlyn Square, was bustling with the usual sorts, and its width narrowed towards the main boulevard leading uphill. Nilsen immediately asked for directions and was confronted with a series of lefts and rights that made your head hurt. So you tried someone else. And then someone else. Eventually Riswyn intercepted a wandering cutpurse before he could make away with your coin, and chasing the would-be thief along the row of shops, the dwarf offered a coin for more reliable directions. And also a name - Revus - to mention in case you ran into trouble in the Warrens.",
                "Everyone you asked about the Dead Herring seemed surprised that you could afford such an establishment. You turned up Coppersmith Lane to another square, and along a street parallel to the main Market Street, it ended at Toman Street. This street, known to Bragi, led uphill and away from Market Square, snaking East in line with the town walls. Unsure of the next steps, the frustrated Nilsen dew breath to ask a gentleman for the final time before going berserk. But Pryce dusted himself down, donned his spectacles, and took over. The gentleman, Gerald, laughed at your terrible jokes but happily showed you the way, begging you pass greetings to the delightful Calli, the proprietress. Enduring a series of posh puns, you both bade farewell to one another, with likely equal parts disdain and relief. At the end of the street, snaking North then East, you came to Friary Street, and the Friar's Gate, at which stood the impeccably turned-out Dead Herring."
            ]
        },
        {
            "heading": "This is a Dead Herring",
            "image": "./img/weylin.webp",
            "paragraphs": [
                "As well as the main path to the front door, Agis noted a worn path that seemed to lead directly into a wall to one side of the establishment. When you asked the footmen, they politely requested you keep your inquisitive thoughts to other things.",
                "Upon entering, you met the svelte, charming, red-haired owner, Calli. She chatted briefly about your trip, noted your delightful diversity, and laughed when you mentioned Gerald. She discussed his knack of leaving people wishing they were dead after ten seconds of his 'wit', and took payment for four rooms, including stabling, for an eye watering rate. But you could bathe, and avail of the perfumed soaps in each room. Luxury. And when you returned to the taproom for a drink, you all looked in excellent shape, notably Nilsen, who combed his beard and hair sharply to one side in a brave effort to look smart. Calli loved it, and nobody else was brave enough to say otherwise to the seven-foot Huorman.",
                "You drank and ate. The local dish was a spicy sausage, called a pudding, and the Dead Herring specials board proudly declared 'This One's Dead!' for some reason. The patrons were polite, lower noble types; the kind that didn't have this kind of luxury at home. And then the door opened and in walked Weylin, bundles of papers stuffed under his arm. His spectacles steamed up as he greeted Calli with a bow and a blush. She pointed up to your table, and he dashed up the steps to the balcony level and hugged each one of you in turn.",
                "He then went on to explain that he was able to access the library at last, and that he had met the Ardsere in person. But there was a mystery: several volumes relating to important topics, like family histories and heraldry, although referenced in other books, were absent from the library. Discussing the matter with the librarian drew ablank too. Some books had been removed. Furthermore, after meeting the guildmaster of the Chandlers Guild, Juanti Lieu, he discovered that their dies for signet ring casting had been removed from the vault by the Ardsere's men. They feared someone - perhaps even you - might try to steal them. But that wasn't all he discovered. Days after meeting the Guildmaster, he was approached in the street by someone with an ill disposition, who explained that access to the Ardsere's library was a rare thing, and had value to his people. He could be found at his workshop on the Middle Ring most days if what he had to say was of interest. And Weylin met others, who explained the origins of an odd festival each year, the significance of the pudding joke, and told him the Ardsere's archives could help solve a family history. All kinds of weird people appeared once you got into the upper circles of the town, it seemed.",
                "Weylin therefore proposed you meet the Ardsere himself, Sirenian Mausel, after one of his services in the Cathedral. Tomorrow afternoon might be good."
            ]
        }
    ]
}