{
    "title": "The Ardsere and His Library",
    "sections": [
        {
            "heading": "Catwalk",
            "paragraphs": [
                "You awoke the next day well-rested and eager to meet the Ardsere. Knowing his station in society was so high, you asked Calli for directions to a tailor to outfit you for the church service. Along Friar Street, you found 'Marial Barsted's Fine Clothing' Seamstress' shop. She looked you all up and down, and up a little further to Nilsen. Clapping her hands she got to work, picking out a fur-lined cloak for Agis, a high-collared samite doublet and top hat for Pryce, and a fitted doublet in ivory brocade for Nilsen. Riswyn kept her armour, but you picked out some pieces to add to it. Sadly these were ornamental decorations for a coach, but you were undeterred. Marial paired these with silver silk, which made Riswyn reflect almost every inch of sunlight that hit her. Nilsen was happy with his clothing, and you picked out a hunter's hat to top it all off. Your old clothes were sent back to the Dead Herring for you. And then it was off to church."
            ]
        },
        {
            "heading": "The Cathedral of the Dutiful Son",
            "paragraphs": [
                "Weylin took you on a loop around one of the three 'rings' of the town; streets that wound around different levels of the hill upon which the Bailey Castle and Cathedral Precinct sat. The precinct was accessed by a staircase that rose from the Market Square and King's Square, and it was a peaceful place high above the town, with formal rows of ash and lime trees. The Cathedral was imposing, moreseo because of its position atop the town than its size. A tall nave supported from two buttressed aisles was ended in a large stained glass rose window and topped with a copper roof that shone across the surrounding region in the sun. From within you could already hear chants and singing as the service had begun.",
                "Each of you attempted to follow proceedings as best you could, despite you varying experience with the rites of a Covenant ceremony. Agis kept you all correct, barring occasions when Nilsen remained standing when you should kneel, or the clanking of Riswyn's armour on the flagstones. Ardsere Mausel, often wreathed in incense haze, noted your presence, and gave a sermon that focused on small sacrifices, their impact on the mortal world, and the hope for a world uplifted in praise for Aeladh. The service ended, and the congregation began to file out, while Weylin passed a message to Mausel via an attendant."
            ]
        },
        {
            "heading": "Ardsere Serrenian Mausel",
            "image": "./img/Ardsere_Mausel.webp",
            "paragraphs": [
                "The attendant brought you into the vestry where the Ardsere was changing from his ceremonial robes into daily attire. This, for him, was a long green tunic with overlapping cape and collar, and a silvered armour chestpiece and pauldrons. He had not yet looked up as he asked you why you wanted his library, but when he did, the thickset features, grey hair, and steely stare reminded you this was as much a soldier as a cleric before you. He was direct, and gave the confidence of a man who did not need to care for your reaction. He walked you through the Cathedral again, flanked by guards and his attendants. You noted that fewer people accompanied the lord of the shire; this was also a man who enjoyed the trapping of authority.",
                "Agis was pushed to the fore. You explained that some books had gone missing from the library, which he said you should direct to his librarian instead of the chief cleric of the region. But you also questioned the disappearance of the moulding dies from the Chandlers' Guildhall. He replied that he ordered the dies taken to a safer place in his vaults to avoid their theft. But he spoke highly of your impact on the realm; a civil war had been avoided thanks to your heroism to save Aldred's heir. You had earned the right to question these things, if you needed them. But Mausel admitted he also needed them, and to study them. He had discovered a branded pattern on several prisoners that the normal texts had not revealed to him. Possibly the original and historic dies would yield answers instead. He would keep them for two more days, and then seek your aid if his divination revealed nothing. And so you agreed to await his response.",
                "Agis noted the cynical look Mausel's attendants gave at his response to you. You read into this that perhaps, despite his sincerity, he was fobbing you off. But the Ardsere was busy, and the meeting was over."
            ]
        },
        {
            "heading": "Vol. Four-Oh-Four Not Found",
            "paragraphs": [
                "And so you decided to visit the library. This was located in another building of the precinct, and an attendant gladly took you up, opening the small door to reveal a well-kept but dark place full of reclusive scholars who instantly resented their peace disturbed. Pryce dashed to the librarian and quizzed him on the indexing system in use. After a few exchanges, the librarian realised he was too deep into the rabbit hole of Pryce's mind, and went to help Nilsen, who had no idea why such a place might be of use. You bumped and dragged a desk over the stone floor to your chair, drawing glares from everyone else. Pryce was busy looking for information, and Riswyn didn't find such a room very safe to keep such knowledge. No important knowledge of the dwarrow would be written on such flimsy material!",
                "Weylin rushed to show you what he saw from before; a reference in a history book to Alber Ward, Pryce's father. In a margin note was a cross reference for more information, pointing to volume 59 of a collection of other histories. But when Weylin directed you to the shelves, the book was not there, along with its neighbour. The librarian explained that the books could not be taken from the library. Various incantations were cast upon the books when interred, usually by the senior cleric, but often by the Ardsere himself if deemed important enough. He was rattled by the loss, and ordered everyone from the room, while he conducted a search to find what other books had disappeared. You left, and found some food."
            ]
        },
        {
            "heading": "Heretics and other Friends",
            "image": "./img/hovel-library.webp",
            "paragraphs": [
                "Weylin remembered he had an appointment with an horologist who had discovered he had access to Mausel's library. The gnomish scholar directed you through the market square and downhill towards the western walls, where you identified the delightful smell of the slaughterhouse. This was adjacent to the Chandlers' Guildhall, in an area known as Tallowtown. At the end of a little alleyway you found a run-down old clock workshop. The door opened, and a weasley-voiced man with spectacles and along leather coat invited you in.",
                "His name was Faliver Whins. He looked you all up and down, but his gaze fixed on Pryce. He seemed to recognise him, or someone like him, and when he went into the back room to make tea, he watched as Pryce lost sight of him, making fun of your inability to see in the dark. He returned with tea for you all. He placed a book in Pryce's lap, and pointed to a line of text. This book could not be found in libraries of the town, he said, for it was a prescribed text; heretical to even own. But he and his fellows were seekers after clarity, reason, and banishment of idle superstition. When questioned, he was unsurprised some books were missing from the library, but it was not he who took them. Rather they might be removed for repair or they might also have some heretical messages in them. In such events they could be kept in the vault beneath the Cathedral - oh you didn't see anything? - but likely the world will never see them again. Faliver guessed there might be other texts that he and his fellows could make use of down there, bring clarity to the people, and force the Covenant to admit to the contradictions in An B'Aelathil. So this is why he wants to hire you, to go beneath the church and find the missings books. He will pay around one to two hundred crowns per tome",
                "Around the small hovel, for very different reasons, you all nodded."
            ]
        },
        {
            "heading": "Evening Strolls",
            "paragraphs": [
                "Rachel arrived and you left Faliver's workshop. Faliver was keen as mustard to help you in any way he could, but he had no information on any way under the cathedral, apart from the counterweight mechanism he described before.",
                "You left, looking at the wells around the town and considering if they connected up underground, or how the town sewer worked. Until you realised there was no sewer, only carts of excrement bound for the stream to the south or tipped over the cliffs into the river. But the cliffs themselves piqued your interest. Rachel asked Sargo to take a look, as you walked up into the upper town along the walls where the cliffs were highest. Here you got a close up look at the Tower of Penance, a soaring pillar of granite topped with an unlit brazier. The bridge linking it to the town was lined with statues and heavily guarded. You weren't entirely sure what the tower held, but few people here spoke of this place as anything other than ominous. A place of repentance, they called it. They didn't clarify if it was voluntary.",
                "Sargo wheeled back up, unable to see anything beyond a few nesting spots. Perhaps there was something hidden under the river, but it could see nothing from here. So you went back to the Ardsere's Courtyard, but again the library was still closed. Guards kept watch to ensure no-one tresspassed, but Pryce managed to shuffle off Valthoom into the well to check down there. The tentacled horror slithered down, enjoying the slippery walls as it hit the water. Riswyn slipped over theatrically to mask the sound of the splash. But the nearby guard saw your simulation and blew his whistle, threatening to take action if Riswyn's foul action continued. Vatlhoom returned back up the well, having slightly spoiled the water with her presence, but found no way to get below ground from there."
            ]
        },
        {
            "heading": "Toilet Humour",
            "paragraphs": [
                "So your next port of call was the Cathedral itself. The guards of the precinct kneeled to say hello to Rachel, teasing her with a coin trick. Until Sargo emitted a days' worth of excrement from her raven form onto the guard. His partner almost fell laughing, and Rachel grabbed the coin - a platinum sovereign. As the guards departed to clean up and spread the hilarity, you walked into the Cathedral precinct again. The concourse, elevated above most of the town, was quiet as usual, with only a few monks and solitary citizens engaging in quiet contemplation. You examined the front door of the church, finding it understandably locked but unguarded. After finding the rear doors guarded by heavily-armoured Aegir and unmoved by Rachel's pleading, Sargo was called upon once more. ",
                "The creepy familiar scaled the cathedral wall, popping in through an open window, and spotted a young cleric in the midst of cleaning. Progressing deeper into the empty nave, the now-invisible rat Sargo spotted a set of keys on one of the church prayer stools. Sargo noisily and visibly dragged the keys away, chased by the acolyte out a side door and into a cloister. Snapping invisible again, Sargo waited by the door for the acolyte to search the cloister gardens and darted back inside. There, Rachel appeared in a puff of mist, took the keys and opened the door for Riswyn, Pryce, and Nilsen to enter, before locking up again."
            ]
        },
        {
            "heading": "Suspense Drama",
            "paragraphs": [
                "Riswyn looked at the two large chandeliers and examined the stonework of the thick columns, finding part of them to be hollow. You climbed the metal stair to the clerestory above, looking along between the arches down at the nave below. Here, Nilsen, Rachel, and Pryce examined the nave, and saw a gap in the floor that suggested the steps up to the altar could move. Up above, Riswyn located hollow panels in the columns that had metal cranks within. They seemed attached to chains rising up, and the only other chains nearby were those that suspended the huge metal chandeliers with their brazier centrepieces. There were four cranks in total, and four of you. But turning cranks and lowering braziers might be noisy; no place for a nosy cleric. So when the acolyte returned, the door opened, and Nilsen's fist awaited the poor preacher. Nilsen dragged him to a pillar, bound his hands and feet, and went upstairs to attend a crank handle.",
                "You all began to work a crank on each corner of the transept. They each maneuvered one step from the raised altar to form a step down below it. So some handles only worked after others were completely turned. But quickly, it was obvious something was amiss. Dust began to fall from above the transept, where the gallery rose to the bell-tower, and a dark shape silently descended on stone-grey wings. It was humanoid, bearing a dull green halberd and clad in verdigris copper armour. It wore a helm of the same armour, from where burned a dull flame in place of eyes. It came to rest at a clear spot in the transept, its head slowly surveying the empty space as its stone tail rose behind it, tipped with another halberd-head. For a moment, it looked around the nave, and saw nothing, so moved closer to the transept. Nilsen didn't wait any longer."
            ]
        },
        {
            "heading": "Death from Above",
            "paragraphs": [
                "As your hound looked on, you lept down onto the back of the huge gargoyle, driving your greatsword between its wings. It roared, struggling to remove you from its back as you struck at its joints with merciless chops. Rachel took cover behind the arches of the gallery, and aimed a mind sliver at the guardian, but it rejected such an intrusion. Pryce knocked the creature back a step with blasts of darkness from his fingertips as the gargoyle finally managed to throw Nilsen free. It swung the halberd, catching you as you tried to parry, and opening a wound on your shoulder. It hit hard, a huge weight behind its strikes, but you managed to dodge its tail strike.  Riswyn looked at the steps alongside her, too far away to reach the gargoyle from. You dropped the crank handle, lept across the gap to the chandelier, and drew shatterspike. The blade's adamantine flecks glittered in the candlelight, and as you lept off the metal chandelier, your golden clothing gleamed. The huge gargoyle turned too late. You plunged the sword into a weak point opened by Nilsen. Like a spike in stone, you split the creature apart from the spine, felt it crumble beneath you. Your boots hit the tiled floor, and either side of you fell the ruins of the guardian.",
                "The others stood and blinked in disbelief as the dust settled. The acolyte murmured a little tune he was singing, almost coming-to. You tied him tight to a column, and finished the cranks. The steps dropped, sliding into place to form a stair down beneath the altar."
            ]
        },
        {
            "heading": "Taking the Company Crypto",
            "image": "./img/bell_tower_gargoyle.webp",
            "paragraphs": [
                "As you descended, you saw a candle lighting a crypt chamber in the distance. Perhaps a point of no return? Sargo and Valthoom were sent to find the others of your party, as you cleared as much of the gargoyle wreckage as possible into the hole. Once you were ready, you looked to one another, collectively shrugging, and Nilsen lifted the acolyte over his shoulder, and descended the steps. At the foot of the staircase was a lit torch, and a crank handle. It held a chain that was under great strain - a lever to close up the entrance again. So you closed it, and covered your tracks, stepping into the crypts..."
            ]
        }
    ]
}