{
    "title": "The Crypt",
    "sections": [
        {
            "heading": "Ardseres, Ardseres Everywhere",
            "paragraphs": [
                "Bragi and Agis arrived, and joined you beneath the altar. You closed up the entrance again, as the unconscious young cleric murmured his tune in his sleep among the broken chunks of the guardian gargoyle.",
                "You stepped into a richly-decorated crypt, a vaulted ceiling to a room lined with stone sarcophagi and paved in chequerboard tiles. Lit torches gave off a magical aura discerned by Rachel, and proved too much for Nilsen to avoid treating like levers for secret doors. The torches illuminated wall carvings and impish gargoyles on the columns in the middle of the room. Bragi and Pryce examined the coffins to read the names of former Ardseres spanning hundreds of years. Odd, as the church above was clearly much older. A sanctified air hung in the room, perhaps the reason none of you voiced intentions to plunder these tombs. Agis and Pryce stepped to the far end of the room, and Pryce's wand found there was a hidden doorway, as well as something else behind him. Agis located the door precisely, and Bragi checked the stonework of the sarcophagus next to it. A gap, not enough to grip beneath, but different to the lids of the other tombs. Bragi felt it budge a little, and Nilsen, who has no time for budging, shoved the lid, and opened the wall hidden door.",
                "You questioned the acolyte, who had finally come-to but had difficulty accepting his situation. He knew little of this place, only tales of things that squashed intruders and made shredded corpses of robbers. He was not permitted here, normally. And as Riswyn dragged him across the floor tiles and into the next room, he protested, saying that he'd not fare well if he ran anyway, so you cut his bonds."
            ]
        },
        {
            "heading": "Hidden in Plain Sight",
            "paragraphs": [
                "The room beyond the hidden door stepped down to a level with a single damaged column in the middle, and beyond that a parapet wall that led to two further staircases. Down these steps it ended in an ornate metal door, etched with intricate patterns. And in front of that door stood a tall limestone statue of a scholar. Nilsen played with the torch on the wall again, which, he was amused to find, actually closed the hidden door once more. When everyone was through, Bragi climbed onto the wall to get a look at the statue. Agis examined the steps down for traps, perhaps considering it odd that so few wards were placed about these rooms. But again you found nothing, and so descended to the lowest level. Riswyn looked at the pillar and saw a pool of blood to one side and a damaged stone face, but nothing obvious to have caused it, and no corpse. But Pryce saw the trail of blood leading to the wall Agis stood at, with a curious look on his face. you recognised it as another hidden door, but couldn't work out its opening mechanism. Meanwhile, Rachel stood in front of the statue. It was powerfully built, and muscular, apart from an atrophied left arm. You examined it further, and pulled the arm like a lever.",
                "'It's not a swing,' growled the polite, but gravelly voice of the statue, as you stepped slowly back to the door.",
                "The statue, which had a name it could not remember, was tasked with guarding the metal door. the statue threatened that anyone trespassing would understand why it enjoyed being made of stone and how squishy non-stone things were compared to it. It threatened, in a polite and passive-aggressive manner, to turn anyone who tried to pass through the door into a fine meat paste. It would permit anyone through the door who it determined was a faithful member of the Covenant upper clergy; in other words, the Ardsere, to whom it referred as 'The Boss'."
            ]
        },
        {
            "heading": "Like Talking to the Wall",
            "paragraphs": [
                "Rachel looked at the door, and asked if she didn't try to open the door, would she be allowed to pass through to the other side.",
                "The statue responded with a knowing smile; 'If you mean teleporting or some such, be my guest,' it grinned. ",
                "When asked about the bloodstains and damaged pillar, the statue seems slightly embarrassed. It hoped someone could clean it up, but there was a lot of blood left by the robber who came here just over a week ago. It also seemed saddened by the damage done to its plinth, on which a broken vase and some broken piles of books sullied the otherwise pristine limestone renderings of skulls and flowers. It hadn't always been here, it said, but couldn't remember where it had been before. As it spoke, it notied Bragi and Agis inspecting it from afar, trying to determine where, if at all, there was a command word, if it was a golem. It chuckled a little, and told them 'it's written on the back of my neck.' Unamused, Bragi recalled that it wasn't. "
            ]
        },
        {
            "heading": "Sluice and Juice",
            "paragraphs": [
                "So you turned your attention to the hidden door, and spotted the outline it should take in the stone work. The statue, amused at your poking around, explained that there was a stone that could be dislodged, but it always made sure to pop the stone back in. Together you located the stone in question, and it took three of you to dislodge it. But behind it was a switch, which opened the door slightly. Nilsen pushed it more and it swung freely and easily. Confidently stepping in, Nilsen saw an empty torch bracket at the top of a steep ramp that led down to a stone-framed pit. Seconds later, as Agis and Bragi stepped in, all three of you were taken off your feet and propelled towards the chute. Only Agis reacted fast enough to avoid falling.",
                "Bragi reacted fast enough to utter a feather fall spell to avoid injury from the fall, extending it to Nilsen below him. You landed safely in a waist-deep pool of viscous green liquid, at the bottom of a flight of steps into a room with a door at one end, and a burned out campfire set before an ajar door.",
                "Above, Rachel identified a dull metal plate on the wall next to the open wall-door as the source of the wave of force. You and Agis made a safe rope chain to the pillar next to the sarcastic statue. Agis' climbing harness would give a safe way down, avoiding the worst of the force-trap. As Agis set up the harness, you noticed another chute in the ceiling. From it dropped a dollop of green goo down to the foot of the chute, where Bragi and Nilsen narrowly avoided being covered in it."
            ]
        },
        {
            "heading": "In the Belly of the Jelly",
            "image": "./img/jelly_nilsen.webp",
            "paragraphs": [
                "The goo didn't settle at the bottom of the liquid-filled pit however. It reformed into a large translucent blob, feeling its way around the ceiling of the room and extending little gooey tendrils along the wall. Nilsen drew his blade, and you sliced deep into it, keeping calm in the face of this new, odd threat. Bragi darted back, and placed a shower of blades between he and the cube. As Nilsen pushed a torch into it, and the light was snuffed out, you tried to pull your arm back, but it became trapped in the mass of this blob, as it towered over you and collapsed, engulfing you completely. Its innards burned with acid. Your skin became scoured through fine clothing and armour. You couldn't breathe, and couldn't move. The blob pressed on towards Bragi, becoming shredded by the hail of knives, but doing nothing to avoid them. It passed through them, and finally Nilsen managed to struggle free, falling to the left of it, fumbling blindly for a light source, and illuminating the driftglobe. ",
                "The translucent menace almost had Bragi trapped in the corner, as you fired off a poison bolt into the jelly mass. It lashed out, burning your neck with an acidic appendage. You heard a roar, and Nilsen wasn't calm anymore. The Huorman tore into the flank of the ooze with one, two, then three strong cuts, chopping huge chunks from it. It gave Bragi enough space to blast the creature with a wave of roaring thunder, pushing it back into the slicing blades, which tore it to gloopy shreds, and finally destroyed it.",
                "Above, Agis had the harness completed, and beckoned the others follow you down. But something niggled at Pryce. You went back to the crypt chamber, using the last charge of your wand to discover what it hinted at before, hoping to find another route out of the chamber, but despite the wand's ambiguous sense that something was still hidden in the room, you couldn't find anything.",
                "And so, carefully trying to avoid the pulsing push plate, you all grabbed part of the rope chain and descended the gooey chute to meet Bragi and Nilsen."
            ]
        },
        {
            "heading": "'Pectin' to the Tightest Places",
            "paragraphs": [
                "You gathered in the room with the gooey pit. Agis and Riswyn took a few moments to appreciate the decor, badly damaged as it was. The walls here were different, of older stonework, and there was more than a hint of Elvish or Vallasaari architecture in the slender ribs and vaults of the ceiling and the broken remnants of the wall friezes.",
                "Bragi took the lead down a narrow corridor, which was taller than it was wide, ascending up to a sooty, blackened ceiling. You tip-toed along, checking every inch of this place for anything that looked like a trap. It was slow-going, as Nilsen muttered from the rear. But even he appreciated, this was the perfect place to install traps. You turned a corner, spotting a hidden doorway to your left. Riswyn came alongside, pushed the wall open, and your face lit up with an eerie green glow, as the driftglobe reflected light back off the glistening surface of another enormous gelatinous blob. You cried a warning, and Nilsen came surging forwards to help you and the bard.",
                "'It's not a swing,' growled the polite, but gravelly voice of the statue, as you stepped slowly back to the door."
            ]
        },
        {
            "heading": "Inspirational Quotes",
            "paragraphs": [
                "Bragi dusted himself down. You stood at the bottom of a staircase lead up. It was a grander stair than others on this floor, but the ceiling had collapsed in, and it was now impassable. But scrawled in large letters on the wall opposite the hidden door were the words 'You Left Us To Die!'' A chill going down your spine, you left the staircase alone.",
                "Returning to the others, you took the lead again, painstakingly examining every inch of the walls. Descending the stairs as they doubled back, you arrived at a landing off which led two doors on your left. Scorch marks under one, nothing under the other, but strands of dried goo here and there across the narrow passage. And beyond these doors, more steps leading down and to the right.",
                "Nilsen stood before the door, paused, and pulled down hard on the torch sconce next to it. It fell off but nothing else happened, much to your irritation.  You tried the door but it was locked. This was not your day. So you took two sides steps to the ri- left, and opened the other door. It led into a chamber with more decoration than the passage. A ruined statue and a grand fireplace. And on the floor a sigil. The same sigil as the wall sconce you now held. Riswyn stepped in, and spotted the stonework of the sigil was newer than that of the rest of the room. Agis examined the broken statue. Much smaller than the talking one back up the chute, and less imposing. Perhaps Vallasaari. It was odd; Vallasaari are a nomadic people, not given to making underground homes, never mind decorating them in such a fashion. There was a door, probably to the same room as the locked door outside, both of which had soot under the doors. Riswyn posited that perhaps someone lit fires here (someone who passed here a short time ago, added Pryce) to protect themselves from the blobs. Rachel knelt on the sigil, to the horror of the acolyte, who realised it was a symbol of the old god St. Vorennus, a pitiful deity of peace worshipped by heretics in the South, and worshipped here hundreds of years ago. ",
                "The door opened with a hard shove. This one was swollen as well. The room it opened into was a longer chamber, more richly decorated still, much of it lined with soot from the two old campfires by the doors. At the far end of the room was another alcove and a statue, an academic-looking humanoid, mostly broken on the floor. On the right-hand wall are a set of alcoves, like large pigeon holes, each marked with an engraved wall tile saying variously 'try again', 'no', 'do not repeat', and 'possibly'. But alongside them, scrawled chillingly on the wall, in large letters, the words 'Vorennus Protect Us', and, even larger: 'VORENNUS ISN'T HERE, SCREAM LOUDER!'"
            ]
        },
        {
            "heading": "Notes From the Nightmare",
            "paragraphs": [
                "Despite the crazed text, you chose to remain here for a while, and examine the pigeon-holes. Pryce gathered up a collection of trash including a bloody and shredded brow cloak and smock, a makeshift shiv, a bottle of pure alcohol, and firewood and coal dust for perhaps three campfires. Rachel's alchemical knowledge led her to explained the bottle was a potion base, but along with the base was a torn and blood-stained note. The note read '3 passed here... [illegible] slow but clear...and quiet [illegible]... 1 knife eater, and horror [illegible]...'",
                "Pryce again checked the remaining alcoves, helped by Agis. He discovered a mechanism within one, and triggered it. A stone released to reveal a hidden space behind. Containing. A. Book. Your eyes darted open.",
                "The book was a small notebook, light leather, strapped shut and tied with string. It was a journal, recording instances of disease. And in the margins were remarks:",
                "‘Our little hospital was moved again today, this time out of the temple precinct and into the slums themselves. Likely the mounting cases too much for the rich clerics and nobles up there. But the water down here is fetid, so we need to send lads up for more anyway.’ ",
                "One week later:",
                "‘These buboes ravage our own men, and still no sign of a cure. Not even the priests’ prayers can treat this. The gods test our resolve it seems.’",
                "Two weeks later still:",
                "‘Moved again. This time to the ruins under the temple. So much space here, and light. The painted walls shed so much light and keep us tied to night and day as the sun becomes a moon over the forest boughs. Can only guess at who made these ruins. Vallasaari hid here maybe? Or perhaps older still.’ ",
                "One month later again: In the margins, beside scrawled out tables with case numbers is written:",
                "‘Supplies moved down here too. But no-one allowed back up until a cure is found. Stench of dead becoming intolerable’ ",
                "Two months later, beside a roster of alchemical supplies:",
                "‘Not only stench now. Clerics sent to quell risen dead. Surface must be horrible now, we stopped getting the ill sent here, now just corpses. Office and quarters are still snug though.’ ",
                "One week later, and finally:",
                "‘Solved. Found the cure, so simple really. But challenge now is to reach the surface past the risen dead.’ ",
                "Back in the hallway, Bragi and Agis led the way along the corridor as Pryce read the notes in an ever-more feverish tone. You sensed a growing feeling of dread as you walked down the passage to the foot of the stair and a door. Agis listened carefully, asking you all for hush. A crackling noise somewhere beyond. Slowly you opened the door, and stepped carefully into a broad hallway."
            ]
        },
        {
            "heading": "Hot Plate and a Burnt Pudding",
            "image": "./img/huge_black_blob.webp",
            "paragraphs": [
                "You stepped into what appeared to be a main hallway. Doors stood opposite you and a crackling noise emanating from the ornate metal door to your left, down a short flight of stairs. In the opposite direction, the hallway turned a corner. As you assembled, a sense of dread began to grow, even as your claustrophobia lessened in the roomier hallway. ",
                "Rachel walked down the steps a little, and felt dangerous heat from the crackling door. Magic, dangerous heat. Sargo, who had no problem with heat, fluttered to the door and peered inside. The room beyond seemed to be a dining chamber, with a large open fireplace, a dozen skeletons, and a lot of broken furniture. You left that door for now, and turned your attention to the two doors opposite the way you came in. Bragi examined the furthest one, which sat ajar, and within was an assortment of damaged furniture but little else you could discern. The door was damaged, missing its iron binding, like the other door here, Agis realised. Riswin walked in, noticing the door had no hinges and couldn't be locked. This was a long room held aloft by two thick pillars that reached up to the dark ceiling. More broken furniture lay on the opposite side of the room, and Pryce poked around to spot anything of note. You could sense something here alright (something not in the plans), and you could sense movement, everywhere, like there was something in the room. You said to yourself that was impossible. Until you looked up. And a huge mass of darkness engulfed you, burning your armour from your body and scarring your skin. ",
                "Nilsen and Riswyn turned, and saw a mass of thick, dark strands of goo, which ate through the metal of Pryce's armour with ease, and slithered off his burned form to stand around eight feet tall and about as broad. As it moved, you could hear a faint moan, like a dying animal, and an echo of a wail as it struck out an acidic appendage.",
                "Nilsen pounced, gritting your teeth into a frothing frenzy and hefting your greatsword in wide arcs through the slow-moving miasma. It split here and there, throwing blobs of black goo onto the ground in front of Riswyn and Pryce. Each blob reformed into a smaller version of the great black pulp. Three of the four blobs lashed out at the barbarian, wrapping you in acidic darkness and dropping you to the ground. Rachel let out a squeal, connecting to the mind of the darkness, causing it to flinch momentarily. But for a moment you saw into its mind, and into the cacophony of agony of hundreds of other consumed souls. Agis responded to the threat with a volley of arrows. These shredded one of the blobs without splitting them off. Pryce retreated, healing a little, and left room for Riswyn to attack with the battle axe. Pausing for a second, you used the flat of the blade against the moaning acidic masses, dropping a small globbet of the stuff into the floor where it died. But the axe was ruined.",
                "Rachel darted into the room, and pulled the fallen barbarian to one side. You administered a healing potion, revitalising the Huorman. Bragi used the door as cover and send a bolt of poison into the largest blob. It struck out again, inflicting a burning lash on Riswyn, as the last of its offshoots was flattened by the dwarven knight. This left the largest slab of acid, injured, and with a weakness that Agis could identify with both arrows readied. Loosing them both, Agis sliced into the creature, sending splashes of acid across the room.",
                "The thing was dead, its acidic remnants all over the room. You gathered your battered party together, and considered your next moves.",
                "Nilsen calmed down. You nursed your injuries and looked to the others. Somewhere above, midnight had come and gone. You needed time to recover. Bragi agreed, as did Pryce. But all looked to Nilsen, without whom they might all need a lot more healing if he was denied rest now. The chambers moan and creak and drip and shudder occasionally, or maybe it was merely your imagination. From the hallway beyond, you hear the crackle of dust on the burning metal door. You set watches, but they are undisturbed.",
                "During your rest those of you feeling fresh looked into the room next door. It was empty, bereft of inhabitants, including any clinging to the ceiling. On the walls were scrawled the words 'Vorennus Help Us!' and 'We were wrong!'. You hunted around for anything of note, but there was only a broken bed frame in one corner, and a broken chair in another. You could hear the others preparing to move on, and so met them in the hall. With no obvious way to open the burning metal door, you made your way down the staircase at the opposite end. Pryce looked back and pondered.",
                "You made your way down, and at the next landing down was a gaping hole in the stone wall, from which came a fetid odour on the breeze. Your dim torchlight picked out only the archways of a colonnade below. But Rachel peered into the hole, and you described what you saw as a large open space, columns supporting the floors you're on, and between the columns, bones. Everywhere. Pryce piped up. Rather than go down there, with all these bones and dead things, why not let you try to open the door with a spectral hand spell? Would it work, maybe, but worth a try. And as you approached the door, and cast your ethereal hand at it, the door opened."
            ]
        },
        {
            "heading": "Leftovers",
            "paragraphs": [
                "The room beyond hadn't changed since you last glimpsed. It likely hadn't changed in several hundred years. Dust hung everywhere and piles of bones lingered in every corner, which didn't disturb Rachel so much as the impression of a figure standing in the room when you blinked, only to disappear as you opened your eyes. You looked carefully around the room, its broken furniture, and its grand fireplace on the North wall, and the tall vaulted ceiling with no huge black monstrosities clinging to it. But as you stepped into the room, the clusters of bones erupted, and reformed into humanoid skeletons that brandished weapons to attack.",
                "Nilsen was characteristically right into the fray. You and Riswyn charged in, shattered skeletons with each swing, while a startled familiar Sargo took blows from three of them and was subsequently recalled by Rachel, who hung back beside Bragi. The bard turned and looked at a skeleton that rose behind him, slicing it down to size quickly. Even the gormless acolyte managed to drop one, hurling a ball of radiant flame at it. Blasts of energy from Pryce's fingertips made short work of another. Rachel -somehow- dropped one with only a rock or two. but it was the rapid reactions and instincts of Agis that destroyed the rest, aiming at the crowns of their heads with successive, precise, and deadly arrows from his longbow. And as the final bones settled back down, a figure glimmered into view by the fireplace."
            ]
        },
        {
            "heading": "Barter with Bartler",
            "paragraphs": [
                "The figure, a woman in a surgical smock, perhaps middle-aged, shimmered as she looked around the room, tutting.",
                "This was Velma Bartler. Was Velma Bartler. She was now a ghost, and she knew it. she asked how you got here, before politely answering why she was here. she was the Chirurgeon here, and worked with others to bring an end to the plague that afflicted the town around 400 years ago. It swept through the slums, and a field hospital was set up there, but it soon needed more space, so they took over the temple and got help from the clerics of Vorennus. Until the nobility grew tired of the stench, when then took over the complex beneath the temple, at a time she says 'when a little light still shone'. They sent the sick down, but no-one could find a cure.",
                "And the sick piled up and died. So much death attracted wraiths and demons that possessed the dead, and soon they needed more clerics to fight them off. But still the sick came, until the clerics above merely sent down the afflicted dead. Corpses piled up by the dozen. Some clerics came up with a solution. They summoned creatures to consume the dead, great slimes and oozes that cared not for possession, had no fear,  and had no souls to corrupt or feed on. It worked, and at last, a cure was found.",
                "A creature was slain above ground, a horrid spawn of the sea called a Chuul, known to be in thrall to the routed Ulla Conir. It proved the source of the disease, and a cure was made. With the undead fought back, the clerics made their way back to the surface, but the way was barred by walls of translucent slime, a mass of Oozes that turned against them. With the dead consumed, they came for the living. Tears ran down the face of the ghost as she recalled that 'We were trapped. And here we died. Or worse.'"
            ]
        },
        {
            "heading": "Tales of Below",
            "image": "./img/female-ghost.webp",
            "paragraphs": [
                "She pointed out her bones, and asked they be taken and buried above ground. but to free her spirit she needed the warding symbols of Vorennus placed around the complex to be destroyed. Pryce reluctantly agreed. She mentioned that others came this way, from below but never from above, and often fled upon sight of her. Agis asked who these people were, and you were answered simply with 'I know not, but they were starved and haggard, like prisoners, and they heeded not the physical wards in this place' as she pointed to the fireplace. ",
                "Rachel sent Sargo up the chimney and, as expected, the fireplace erupted with a flaming trap. Shrugging these off, Sargo found the flue joined with another, the fireplace of the room which held a slab inscribed the symbol of Vorennus from earlier. But the flue ascended further, to a small alcove. Here Sargo found a pair of candles, and a vial with a silver chain, in which were two fingerbones. But beyond this alcove, a hiding place for these odd treasures, the flue was collapsed in. So you summoned Sargo back.",
                "Bragi explained to Velma that they would certainly interr the bones, and would seek out the symbols of warding on the way back up to the surface. Velma believed you, and let you all go on your way, tutting that she would need to clean up after you all. ",
                "And so you returned to the grand staircase, and descended. The wide hallway turned another corner and continued down, around another corner and down far below the rooms of the slimes and cubes. It opened into a long passageway far below the rooms you fought through before. It opened on one side to an arched colonnade, and a dark space beyond."
            ]
        }
    ]
}