{
    "title": "The Deep Academy",
    "sections": [
        {
            "heading": "Charnel Cloister & Welcome Party",
            "paragraphs": [
                "You stepped cautiously along the passage, seeing it open to your right and down through a series of slender archways to a cavernous space below. And then you saw what Rachel saw. A level below, a four-sided quad of archways rising from a sea of bones, glistening humanoid bones, many feet deep. Too many dead to count. A rising dread filled your hearts, sensing the tightness of this chamber against the walls of the immortal realm. And always from beyond, a clicking sounds, rhythmical, which reverberated around the space.",
                "From the darkness you hear a strange bowstring noise, and seconds later a volley of arrows rained in from the darkness opposite, striking Riswyn and Agis. You all darted for cover behind the parapet walls overlooking the bone pile below, Agis making it to the next pillar, and Nilsen following behind. You sought refuge behind either of the two doors to your left, but behind one was only a collapsed chamber of rubble. You took cover from pillar to pillar, and Agis made it to the far corner and sheltered there. Around you peered. Illuminated by only the light from beneath a door below, you picked out the shapes of five skeletons at the foot of a staircase, armed, and approaching, with one much larger skeleton looming behind them, all of their feet rhythmically clicking on the stone slabs beneath them.",
                "As they dashed forwards, you loosed arrows into them, cracking bone and downing one. On the others came, and now Nilsen came alongside, followed by Riswyn as the undead turned the corner. Rachel hung back, readying your bullet-pebbles. Pryce took aim with force blasts at skeletons as they turned the corner into view. Two dashed at Riswyn, injuring you, as Nilsen beheaded another. Bragi looked for an opening, and loosed a bolt into one, as a chill went up your spine. You reacted and turned, to come face to face with an apparition of a dockworker, face twisted in hatred. It sank a claw through your armour, draining your life from your body. Rachel squealed, only to find a spectral nobleman standing behind her, chilling your soul with a lunge into your heart. You struck back, Bragi reacting first and searing it with your rapier, and then Pryce blasted it into pieces of spectral smoke. The other drew back into the wall, and away from the shrieking Rachel. Arrows again rained in, hitting only Pryce. Agis lined up another shot, downing his mark, and damaging another for Riswyn’s blade to finish. You kept your awareness, and lifted your new shield up to parry an incoming blow from an axe-wielding skeleton that was destined for Nilsen.",
                "Behind the final two lumbered the hulking giant skeleton, and they darted into combat with Riswyn and Agis as the giant climbed the stairs, reaching for Nilsen. From the wall the spectral nobleman lunged at Pryce, finding itself then the target of Rachel’s hex, which it shrugged off. It didn’t shrug off Pryce’s psychic bolts so easily, and you backed it towards the wall, for Bragi to finish off with a blast of thunder that reverberated around the entire complex. Riswyn again took a blade to the thigh - just a fleshwound – and answered with a longsword crack of the creature’s skull. Nilsen pulled out a javelin and you hurled it at the giant beast, momentarily knocking it from its stride as it came forward on all-fours, eager to pull your flesh apart. It flinched for a moment as a glimmer of metal appeared in the air above it, then more, and yet more. It reared back, uttering a horrific howl as a dozen blades rained upon it, shredding bone from socket. It could find no way past, and so it bellowed back and charged back down the staircase and out of sight. You could hear the knocking of bone on stone around the central cloister, but thought better of pursuing it. Instead, Pryce stepped up and smashed open the door of the room at the corner you took cover in."
            ]
        },
        {
            "heading": "Room With No View",
            "paragraphs": [
                "The room beyond was a mess. It looked like a futile last stand of a few soldiers, judging by the pitted arms and wrecked armour strewn about. Around the corner stood a battered barricade that toppled loudly the moment Riswyn went near it. Behind it lay a desiccated grey corpse wearing ruined armour with a symbol of Vorennus embossed in the breastplate. The old cleric (or perhaps paladin) lay on top of a cloth that covered a shield. Riswyn picked it up and saw her face in it, almost a perfect mirror surface. But you already had a shield, so you passed this one to Nilsen, who examined his beard in it and slung it onto his back. All the while, Pryce was fascinated by the wall opposite the door. Here was an alcove, and in it was a perfect replica of a window, but without the glass; only a flat, blank stone face. Riswyn examined it too, and Rachel looked at it through her eldritch sight. The background magic of the whole complex grew stronger here, if only a little. But the stonework was centuries old, maybe even a millennium old or more. But it was perfect, as if someone had petrified a typical wooden window frame. To cheer everyone up, Pryce flashed an illusion of some hills and trees into the window. It seemed to work, but for the corpses everwhere. And so, despite liturgical differences, you encouraged the acolyte to perform burial rites over the corpse.",
                "Stepping out again, you carefully made your way down the steps to the door from which torchlight shone. Nilsen grabbed another wall sconce on the way down, and it was clear to Riswyn that these sconces were not part of the original complex, hammered in as they were with crude metal nails. Rachel sent Sárgo under the door and scouted ahead. Within was a long chamber filled with broken benches, broken braziers and alchemical equipment, and rubble, lit with a single torch at one end. To Sárgo’s right was a grand fireplace, with an curved line engraved around it. Outside, Bragi got to the door and pushed it open. As you stepped in, the door slammed shut again, and only Nilsen managed to roll in before it did."
            ]
        },
        {
            "heading": "Sticks and Stones",
            "paragraphs": [
                "The torch flickered, and as you began to hear singing from somewhere, you saw many of the items in the room begin to levitate, and then hurtle towards you both. Bragi, you were forced into the air and smashed against the ceiling, only to take further injury as the ground came hurtling back at you. Nilsen took some furniture to the chest.",
                "Bragi and Nilsen looked everywhere for the creature that was either singing or throwing things at them. Nilsen swung at somewhere near the middle of the room, but hit nothing. Bragi got up and searched around the fireplace, from where the singing seemed to come. Outside, Pryce applied his hands to the door and pulled the trigger, blasting the lock off noisily. Blasting most of the door off in fact. The acolyte looked over Pryce’s shoulder and saw four skeletons turning the corner, bows drawn. He took an arrow to the knee, but it was just a flesh-wound and wouldn’t affect his career. Then another struck Riswyn, but Rachel backed away from the corner up the steps and then dropped a huge cloud of darkness on the skeletal archers. But over your shoulder, you saw a huge boney arm haul the giant skeleton over the parapet wall from below.",
                "Riswyn charged into the room, looking for something to hit. Bragi immediately noticed something wasn’t right in the corner near the door, and you launched a salvo of magic missiles at it. Nilsen fought through a hail of old candlesticks and pottery to the corner of the room and felt a chill in your head. Riswyn looked back out of the door, and saw two skeletons run past to attack Pryce, and so you cut them off and destroyed one with a magic missile. Pryce obliterated the other with a storm of eldritch energy. Another skeleton loosed an arrow to Rachel but missed, and Rachel ran back down the stairs and away from the giant, pointing your wand at the unlucky archer and destroying it in a hail of magical missiles. But Bragi tracked the invisible presence, skewered and destroying it. And you learned of the return of your old giant foe, and stepped out of the room at last. It had marauded down the stairs and threw a rock at Pryce, but missed. In the room, Riswyn looked around and saw an apparition gliding around above Nilsen, and without anything to hide, it now lunged down at the Huorman, sending him back from the corner, and you swung your blade back at it, unsure of exactly where it lay, and connected with two savage strikes to destroy it. And all of the floating and flying detritus now fell to the ground."
            ]
        },
        {
            "heading": "Always with the Knives",
            "paragraphs": [
                "Beyond the room, and its singing, the huge quadrupedal skeleton came on, and Bragi faced it down, goading it on until it got almost within reach. And then it stopped, roaring, as the air erupted with knives that shredded it again. Pryce sent a volley of blasts at it, and Rachel whispered a scream into its soul. It turned and fled, before regaining its wits and coming back for more. As it returned, it surveyed the knife cloud and Bragi taunting it on the other side. The acolyte threw  a tiny radiant fireball at the beast, Sargo hampered it then struck at the back of the thing, and finally it could take no more. It  lept through the knives at Bragi, swinging wildly but Bragi ducked, and the knives rained down on it, chewing through its bones, and shattering the spell that animated it. The final skeleton archer made a retreat somewhere in the darkness.",
                "And now all that remained was the singing.",
                "You waited to patch up some injuries. The singing continued. Riswyn examined the fireplace, and Nilsen decided to check if the flue was clear above and threw a bottle of alcohol and a lit rag at it. The flames and smoke erupted and seemed to take a lot of the smoke before it began to gather in the room. When the inferno died down, Valthoom slithered up the chimney to investigate. And sure enough, the be-tentacled, creeping horror found that the chimney flue doubled back down to another adjacent room."
            ]
        },
        {
            "heading": "Ifhalla the White Lady",
            "image": "./img/ifhalla.webp",
            "paragraphs": [
                "This room was well-decorated, and in better condition than the others. It was lined with opulent cabinets and desks, and in the middle of the room was a woman who sat on the floor singing. Around her were several items, including a cittern, some gems, a chalice, and a jewellery box. She spoke gently to Valthoom, and then directly to Pryce through the wall as if it were you in the room, not your familiar. She asked you to join her, to find the entrance to the room through a secret panel in a cupboard in the room adjacent. And true enough, there was no door in the room in which she sat. So you cautiously made your way along the corridor to the corner, and to a door that lay ajar. Beyond was once a bedroom, with broken cabinets and smashed lanterns adorning the walls. On one wall stood a smashed and rotting bedframe, and on another was a stone window. Opposite the bedframe was a wardrobe in good condition, and you found its back to be a false panel. It swung around to reveal the room beyond.  A symbol of Vorennus carved into the floor at the threshold beyond the closet. Bragi stepped over it first, drawing a gasp of glee from the lady in the middle of the room. Everyone stepped into the chamber, and the lady grew more excited. Rachel was last in, reluctantly stepping over the symbol on the floor, but the acolyte dared not cross it.",
                "The woman spoke with a fragile, honeyed voice, firstly quizzing Bragi on the world, and asking if you were all here to study. She noticed Bragi was half-Vallasaari, and you realised that she was Vallasaari too. And she asked if you were here to study, had you spoken to the Dean, her wonderful Dean, whom she addressed as Remulen, and whose office was on the floor below.",
                "She beckoned Rachel over to play with her trinkets, and let you examine them. In fact, you spotted that one of the items exhibited a strong magical aura, the cittern embellished with scrollwork and Heathen knots.  Ifhalla shone with happiness at your presence, and said she had toys for Rachel to play with. Nilsen questioned what this place was, but she remained coy about what knowledge she possessed. A trinket or another toy might work as a show of friendship, she suggested. Pryce passed over a bloodstone, graciously accepted. You asked agin, and for how long she had been here. She responded that she was a tutor, and came here to protect the knowledge of the elders with her beloved Remulen, and pass it on, hidden away from the harrowing hand of the Meargha. She explained to you that they came here, to the lands above, and hunted for something, deep and hidden, among the roots of the land. And you got dizzy for a moment, as those words triggered a memory or a vision. A dark pit, roots disappearing into it, and a ring of runes around the edge; runes branded onto your backs. She went quiet now, whispering that nothing could stay hidden forever, and when the power of this place waned and the Ulla Conir ruled the land. And when the windows lost their shine, and the sunlight of lost Ilantha was gone. Riswyn recalled that much of what she said sounded like the tales of ancient history, almost one-thousand years earlier.",
                "You explained that you needed to go and find Remulen. She clapped her hands with glee and said how she kept all of the things from his study desk, like the little prism toy. And she sensed life from below that he might still be there. You should go and begin your studies. But she could not. And she wept as she said that she didn't want to be alone again. Rachel must stay, remain here, and play with the toys. And argue as you might, and persuade as you tried, she was adamant that someone should stay behind, and she liked the girl best. Perhaps a reminder of the children she and Remulen intended. But as you argued with her, her visage changed, and her veil of comeliness faded. Momentarily, she appeared as a withered crone, translucent and evil, and from the closet the acolyte mutter 'I knew this was a bad idea'. But as a favour she let Rachel chose an item. Bragi licked his lips at the thought of a magical instrument, but you chose the trinket box instead. And so Rachel offered to remain here, and asked that you go and find Remulen for her.",
                "The ghostly woman set the toys out for you to play, and combed her hair as the others left the room. You picked up the cittern to try to play with it, putting the trinket box in your pocket, and closing your eyes to concentrate on the notes. The others had gone back into the bedroom adjacent, along with Sargo. For a second you saw through Sargo's eyes, and in a puff of smoke, you vanished, to appear, via a misty step, in the hallway outside.",
                "It only took seconds, but Ifhalla suddenly knew, and her rage at being duped was terrifying. You felt it tear through each of your minds like a wave of pain and fear. A scream that echoed in both worlds, and catapulted you to the darkness of your first and greatest fears. You recalled horrors that forced your child-like mind to harden, your age of infancy gone in a flash, your mortality made manifest. Tears pooled in your rigid, open eyes, and you stood still for a moment until the terror passed. Pryce, Bragi, and the acolyte dropped to the ground, soon to die. When your minds were clear, Rachel and Nilsen helped the others recover, and closed the closet door, retreating back into the hall."
            ]
        }
    ]
}