{
    "title": "Deep Academy Cloister",
    "sections": [
        {
            "paragraphs": [
                "You were rejoined by Agis, who helped you back to the barricade room to heal your wounds. The singing had stopped, and as dawn broke in the world above, you felt the power of some items restored.",
                "Bragi led the way back to the destroyed passage, with a gaping hole, over which Nilsen lept with ease. You fastened a rope to help the others across, but Bragi lost footing and almost fell, but reacted quickly enough to stall your fall and grasp the edge of the walkway. The hole led down to a pit of bones thirsty feet below. With the gap traversed, you carefully stepped around the corner and down a flight of stairs, behind the wall again, and away from the central open chamber. Another hallway wrapped around the chamber, with a doorway halfway along, and a gaping hole where the staircase down to the bone-covered floor should be.  As you drew closer to it, you recognised this door was sealed against the stonework, and Rachel saw the magic emanating from it. A warded door.",
                "Pryce spotted a celestial inscription 'Only the purest spirits may enter, unlike those that dwell outside', and neither Agis, Nilsen, nor Riswyn could prise the door open. Bragi considered the bottles of potion spirit base in his pouch, but having imbibed quite a few potions already you were in no mood to drink pure alcohol just yet. Nevertheless, when you tried to push the door, it opened freely, and the ward was broken."
            ]
        },
        {
            "heading": "Unsafe Haven",
            "paragraphs": [
                "The door opened in front of you to reveal a large room that showed signs of habitation more recent than many of the rooms here. Broken furniture continued the theme of this level, but a lot of it was split up to use as firewood, and there was evidence of a campfire used to cook food. Small bones, perhaps rats, littered the area. But across the walls, the inhabitant seems to have scrawled writing:",
                "‘No, no, no, no, NO! I will not die like the others!’ was scrawled across the shorter wall.",
                "‘I hear them beyond the door, waiting, hungry. To retreat here, trapped, and feel myself die by the second. Both stupid and luckless.’",
                "‘Anyone finding this, please, free my fellows below and tell the king what Mausel is doing here. Save us from the Abomination.’",
                "But there was no remains of anyone here. Perhaps they escaped or fled? Or perhaps they still lived down the collapsed hole at the north-eastern corner of the large room. You looked down and saw a room filled with rubble that led off south below you. Nilsen climbed down, along with Agis. Rachel sent Sárgo to help while the others investigated the large chamber further. Below, you found only a small portion of a room that had not yet collapsed. And here lay a corpse, likely for quite some time. It was a human man, and around his body he had etched something into the floor slabs:",
                "‘It is over. I cannot get out. I will not become like them. I will die as I am. My name is Farron Dwall. Should anyone find me, bring my corpse to my mother.’ ",
                "Agis looked over the body, assessing it for signs of how it died. The bones revealed nothing of trauma from an attack, but both legs were broken. Likely Farron Dwall died from starvation after falling down this hole, unable to climb out and unable to magically heal his injury. A pathetic, banal death, in a place filled with so many horrifying threats."
            ]
        },
        {
            "heading": "A Shortcut to Squashedrooms",
            "paragraphs": [
                "But Sárgo spotted enough gaps in the collapsed rubble to squeeze through. So you sent your imp, and eventually, it found another chamber in the rubble, strewn with very old corpses, many with tattered cloaks of the old 'god' Vorennus. Most lay under rubble, and inaccessible, but one was apart from the others, propped against a wall. It wore damaged armour and alongside it a bastard sword rested in its fine scabbard, still gleaming after so long. After crawling over it, Sárgo spotted two exits from the chamber. Both narrow, but enough to squeeze a person through. Sárgo made its way to the southern gap in the wall, and there looked into another chamber that had mostly collapsed. But here the floor was a little damp and a depression in the floor was filled with a murky liquid in which things swam. Before discovering if they were mermaids or mini-kraken, Sárgo returned to the room with the paladin corpse, through the rubble, and back up the hole in the floor to rejoin you all. Only the acolyte held back, pondering silently what his master the Ardsere Mausel could 'be doing here', as the graffiti suggested."
            ]
        },
        {
            "heading": "Crunch Time",
            "paragraphs": [
                "You gathered back your rope and tools, and prepared to descend the hole where the stairs to the skeletal pit should be. You dropped a rope down, and one by one your boots hit the thick carpet of bones that formed the floor here. Every step you took, to adjust your step, to reposition for the next person coming down, echoed a crunch of bone meal as you crushed and shifted the bones under your feet. The quiet here made it worse, but what really hit home was the recollection from the chirurgeon's notes that this is not only where bodies decomposed, but also where the leaders above discarded the diseased living. You could all sense the thinness of the veil between the world of the living and the dead here, but those of you with the power to harness the Itheria could almost feel the press of it against your minds.",
                "The acolyte came last, offering a whispered prayer perhaps in fear, or perhaps asking forgiveness to the souls of the corpses upon which his boots came to rest.",
                "You stood together at the northern end of a bone-filled cloister, like that of the church abbey above, with a high, arched ceiling. The cloister looked into a central chamber, perhaps 60-70 feet high, ringed by the openings that looked down into it. Columns soared up to support the vaulted ceiling that had partially collapsed to allow Rachel a glimpse down many hours ago. The sea of bones that confronted you was formed into drifts at the columns and against the walls, undulating unevenly across the chamber. And Rachel realised that the tallest pile lay directly below the plugged well opening, filled with green liquid into which you fell from the waste chute and the sloped passage that the sarcastic statue allowed you to access without squishing you.",
                "It was from here that the dead arose to confront the chirurgeons and the clerics, who summoned the oozes to consume them, and who were in turn consumed by them.",
                "And from this damnable pit led four exits. Two had doors but all had inscribed archways over them. Nilsen sent the driftglobe to each one in turn.",
                "To the North was inscribed 'The Path of Ignorance' in Vallasaari;",
                "Immediately to the East was 'The Path of Those Who Fail' in Draconic;",
                "Opposite this was 'The Path of Those Doomed to Know' in Abyssal;",
                "And finally to the South was 'The Path of Endless Death', in a tongue even Pryce could not recall.",
                "As Pryce read these aloud, Bragi chuckled at the choice of which horrible journey to embark!",
                "You winced again as your feet crunched through the bones of the dead and set off towards the least worst option: The northern 'Path of Ignorance'.",
                "The passageway was wide, enough to fight two abreast, but it ended shortly in a heap of rubble. The passageway itself was tall, with a decorative frieze at the upper third, it too damaged. The deeper you went in the complex, the worse it got. But there was a gap in the rubble at the end, and you careful edged around the corner, where it opened into the room that Sárgo had explored earlier. The withered corpse with the decorative scabbard and damaged armour lay in one corner. Nilsen picked over the armour and you found enough buckles and metal to patch up your own damaged mail. Riswyn and Bragi examined the rest of the corpse. Dead for many decades, perhaps a century. It wore a belt, and in the belt was a little scroll tube. Whilst Bragi tried the knight's bastard sword for size, Pryce opened the little case. Within was a small scroll, and it read:",
                "'I am Ser Reygal Mannaster and this is the testament of my final wishes. My sacred oath compels my fight against the undead and to whom they serve. My oath is to my Vorennus, but it is my love for my darling Serri that casts my will in iron. I have no nobler quest than to free this world from evil and remake it a better and safer one for her and my children. Should I fall, seek her out and to her grant the tithes I have set aside for her. In the name of all the gods, in the year of 1018.’ ",
                "Rachel and Agis looked through the rubble, and saw great chunks of the former walls of this room inscribed with Vallasaari. It read 'Cleansing Your Mind of Mortal [unknown] is the Path to Immortal Knowledge'",
                "The way out of this room was through a narrow gap in the rubble leading East. Sárgo had found a little pond there with things that swam within. So you decided against that way, and turned back.",
                "You returned to the cloister. Agis led the way to the Western passage, 'The Path of Those Damned to Know', closed off by a pair of ornate double doors. Pryce and Rachel followed close by, then Bragi, Nilsen, and Riswyn. The ground shifted. Several of you stumbled as the mass of bones rumbled and shifted. There came a low moan. Pryce and Rachel felt it in their minds, but you all felt a surge of horror. The sea of bones , and a towering mass of red and green slime exploded from beneath your feet. It writhed everywhere, forming face-like shapes here and there to moan and snarl. Within its translucent bulk there were a dozen or more armed skeletons suspended, peering out with hate. And as it moved towards Agis, you felt the fear and hatred of thousands of the plague dead, of the trapped chirurgeons it was summoned to protect, and of dozens of clerics of Vorennus that could not fight it back. They were wrong to think it could not be corrupted. It fed off malevolence of the undead it was sent to fight and the evil of those who cast the living aside, and grew powerful over the centuries. ",
                "This creature of living death, a slime of souls, lunged and grabbed at Agis nearby. And at once you were engulfed, your life draining slowly as you struggled for breath. Pryce Pulled from the Ethereum a creature of shadow and despair, draining the energy of all nearby with its presence. The slime could not move."
            ]
        },
        {
            "heading": "Hold Still, This Might Hurt",
            "image": "./img/slime.webp",
            "paragraphs": [
                "Rachel and Bragi inspired you and hexed the creature, but it countered its immobility by expelling a band of skeletons from its innards. These ran to attack all of you, and whilst Riswyn and Nilsen struggled to get free of their new assailants, Rachel recalled the devastation her little stones made on the brittle undead, and made short work of them. Pryce saw the gasping Agis within the mass of souls, unable to move and dying. You lined up an angle on the creature from behind a column, and unleashed a pair of psychic surges. One struck the thing, and it shrieked with pain. The other struck Agis as you intended, sending him hurtling back out of its innards.",
                "Gasping for breath but alive, Agis stood and choked down a healing potion before drawing your bow. The creature was not an animal; it understood the threat, and lashed out at the demon of despair summoned by Pryce as Bragi’s crossbow bolts peppered its translucent skin. As the demon was quickly overwhelmed and banished once more, the mass of souls slowly crawled towards Pryce. Within its mass, you watched as it pulled more skeletons from the floor below and began to slowly reform them for another burst of reinforcements. Riswyn and Nilsen, having destroyed your skeletal opponents, nodded to each other. Riswyn threw one end of a thick rope around her arm, and tossed the other end to Nilsen. You wrapped the rope around your muscle-knotted arm, and both of you pulled it tight. You both sprinted around the soul mass, avoiding the skeletons, and to the opposite side of the nearest pillar behind it. And with all of your strength, inspired by Bragi and taking advantage of Rachel’s curse, you pulled the rope through the slime like a cheese wire. The rope rent it in two momentarily, but pulled all of the skeletons from within it and, with your combined strength, bludgeoned them against the pillar. The thing roared, a dull rumble beneath the sharp noise of dry, shattering bones. ",
                "Agis now took a measure of revenge, circling around the slime and sending one volley after another into the centre of its body. The first arrow marked it, the second tore a hole in its flank. The acolyte darted alongside you, himself covered in shards of newly-crushed undead bones, and healed you further. Pryce followed this with a further blast of eldritch force, and Bragi with more crossbow bolts. The thing reared up, the skulls and faces that form it grasping defiantly at Riswyn and Nilsen. But as it turned to face Agis, it let out an abrupt gasp as its translucent hide was pierced for the final time. The Vallasaari bodkin found its mark. You severed its connection to the souls of the dead and slowly the hatred and fear that gave it form dispersed. All of its slimy mass turned into air. Seconds later it was no more.",
                "Rachel and Pryce felt the pressure on their minds ease a little. This was still a place of dread, but you no longer felt the instinctive fear that heralded the appearance of this horrid manifestation."
            ]
        },
        {
            "heading": "Doomed to Know... Where the Trap Is",
            "paragraphs": [
                "You took a moment to recover. The doors of the Western pathway stood firmly closed, and it took all of Nilsen’s strength to push them open. Beyond, there was another wide hall. This one ended with another broken statue of a scholar. A door on either side of the hall led North and South.",
                "Agis progressed into the hall, taking great care. And it was well-warranted. Halfway along the hall, you spotted a tile that showed signs of mechanical movement. Looking around, you saw evidence of stonework scored by something powerful coming from the disfigured statue ahead. Agis stepped in to help locate an assured trap mechanism. But without the required expertise, you merely located the trigger. Stepping over it, you found three holes, surely the nozzles of a trap. Stepped out of its way, you tested the trap, and watched as it launched shards of metal at the area around the tiles. Once launched, you discerned a ticking mechanism, like a timer that reset the trap. Counting down the timer, it stopped, and you triggered the trap again, but this time Nilsen put a chunk of stone to weigh the tile down, and hopefully exhaust its ammunition. In the meantime, the trap fired, with slightly fewer metal shards than before. In the aftermath, you chose to step over the tiles, and go through the door to the South. "
            ]
        },
        {
            "heading": "Student Accommodation",
            "paragraphs": [
                "You stepped over the trapped tiles and opened the door to the South. The air smelled foul, almost briny. Beyond was a room that was lit by a pair of torches on sconces that illuminated a collapsed stone well in the middle of the room. You stiffened at the sign of habitation so far down here.",
                "It was a square chamber, from which five doors led in all other directions. Some doors, some barred gates like jail cells. Around a corner to the South lay a pair of strong, silvered doors, and the torchlight reflected off some water at the foot of the staircase that led to them. Within several of the jail cells you saw manacles attached to the wall, and in one cell lay the clothes of a man, covering the restraints and fully fastened. The floor of this cell was a drying dark liquid and it smelled briny. You heard the trap fire again outside, again, with less ammunition than before. ",
                "Pryce looked at the stone of the well, and Riswyn saw that it was old stone and a finely built well, but its parapet had collapsed in, and the shaft was full of masonry. But the ceiling hadn't collapsed. Bragi looked at the base of the well and saw a ring of polished, black stone. When you speak around the well, you almost hear it resonate back at you. Outside, the trap fired again, but nothing burst from the nozzles. It was empty.",
                "Nilsen checked the other doors and found them empty. Pryce looked above them and saw symbols that you knew to be numbers, like room numbers, with the largest room being the highest number. Having checked each room briefly, you turned back and decided to try the Northern side of the entrance passage."
            ]
        },
        {
            "heading": "Noote the Doubtful",
            "image": "./img/noote.webp",
            "paragraphs": [
                "The chamber beyond was mostly intact, and clear of the rubble in rooms elsewhere in the complex. In the driftglobe light you saw several doors, each leading to store rooms, and a man-sized statue with one red and one missing red eye. You investigated the stores and found one containing sacks of grain and barrels of fresh water. The barrels were marked with the personal seal of the Ardsere, which gave the acolyte pause for thought. Riswynn looked at him as he pondered.",
                "He caught your gaze and explained, 'Smugglers I think, captured the grain of my lord';",
                "You considered it for a moment and replied, 'Actually, what's your name? You never told us.'",
                "'You never asked. My name is Noote.' He replied.",
                "But even with his wisdom he couldn't understand why bags of grain were down here - hardly a valuable commodity to smuggle.",
                "You looked into another store and it was piled high with backpacks, weapons, armour, and a few town watchmen uniforms. Elsewhere were items you'd associate with gangs: knives, shivs, and blackjacks. Difficult to say where they came from. But you replenished your stores of rope and mundane items, and opened a few other doors. At the end of the chamber were two doors; one lay ajar, and the other led into an empty store room. "
            ]
        },
        {
            "heading": "An Old Nemesis",
            "paragraphs": [
                "Nilsen pushed the ajar door open fully, and saw a crumpled corpse at the end of this otherwise empty store room. You looked closer, and saw it to be a robed human, a quarterstaff lying alongside, with fatal injuries. But before you can discern what killed this man, you felt the air rush from above you, and a huge spider leapt down from the ceiling.",
                "It jabbed at you from above before you could raise a defence, biting into your thick forearm. You rolled and caught it square with a crossguard strike, before seeing it rise up to strike again. You waited and dodged the blow before stamping down on its overreach, drawing its blood with an upward arc of the greatsword. It panicked, looking for a way out, but you had it trapped. It stabbed with chitinous hairy nails, threatening to turn your guard, but you crouched under its lunging bite, and thrust the blade up into its sternum. You backed off as its legs flailed uncontrollable in the small cell and eventually it slumped against the wall, dead.",
                "You pulled away the giant spider and examined the corpse again.",
                "Riswynn looked in the robes and found a small set of lead tablets with notes scrawled into them, and a single red gemstone. Pryce collected the quarter staff and you made your way back to the central chamber. Here, Riswynn recalled the statue with the single red eye, while Pryce thumbed through the note tablets. They cryptically said the following:",
                "“Stones in order … all four incantations first.”",
                "“Mortal first, then Immortal. Memorise.”",
                "“If it's blue let it through, If … it is unseen, if red then we’re ….”",
                "“Thanks, DH”"
            ]
        },
        {
            "heading": "An Eye on My Belongings",
            "paragraphs": [
                "Riswyn took out the red gem and inserted it into the empty eye socket. A grinding noise came from the empty store room to the North, and you all quickly went to investigate. And here, on the left-hand wall, opened a narrow passage into a room with a smell of soot.",
                "The chamber had the appearance of a hideaway for a wizard. In the middle of the room was a small campfire covered by a metal lid in a ring of stones. A bedroll and backpack lay at one corner, and a carpet was spread out in front of a makeshift bookrest that held the wizard's spellbook. Pryce stepped in and examined the book, seeing the signature of a Logrim Fenbald, and began consulting with you all over who could make use of spells therein. But at the back of the book was a journal, and Pryce was diverted to read through the different entries:",
                "‘Finally got in. My trouble travelling upstream without a pilot was clue enough, but the calculations of water currents proved my point. A sinkhole. But not just a sinkhole, a whole tunnel network. Likely only traversed by those wretched, swimming, dregs. Took me a few attempts but they seem to prowl in the river during the late watches of the night.’",
                "‘Huge complex here, large central chamber with many rooms off. Rubbings below indicate verses of a ritual, or chant of warding. I suspect four, one per route, some incomplete.’",
                "‘So, specimen two was not like the swimming horrors at all. Much bigger, like a crab crossed with an insect. Much more dangerous. Followed me everywhere, chased me in fact. Seemed to sense me from a long way off too.’",
                "‘Of course, there’s a spider here. Avoided it this time, and dealt it a nasty wound, so it’ll hopefully leave me alone.’",
                "And as you closed the book, you pondered its meaning, and took stock before pressing on."
            ]
        },
        {
            "paragraphs": [
                "You took stock quickly, assessing the routes you had not yet chosen, and decided to make your way South to the silvered doors again. There, Pryce recognised the runes on the door, and with assistance from Rachel deciphered a little of their character as a powerful warding against something. But Rachel detected only a trace of the powerful magic that once worked here. Wary of danger beyond the doors, Nilsen and Pryce devised a pulley using the well parapet as a lever. Whilst at the well, Nilsen heard whispering voices in his mind, but could not make out what they said. You made a mental note to stay clear of the collapsed well."
            ]
        },
        {
            "heading": "Pincer Movement",
            "image": "./img/crab-people.webp",
            "paragraphs": [
                "Riswyn stood near the top step above the silver doors, and together you hauled them open. They moved easily for their size, and Riswyn saw a large room beyond, half-filled with water, with a light misty haze above it. And through the haze you saw reeds sprouting from the floor, kelp and seaweeds reaching up the walls, and tall broken statues becoming overgrown with mosses. A set of similar doors led out to the left, and a stubby pillar of some sort reached up out of the water, like a drum. But through the murk of the water you could see a huge hole in the floor, completely submerged. And somewhere, something large moved ripples through the water, coming from around the corner. Riswyn reached the doors in time to close them as a hulking thing scuttled into view. It towered overhead, and moved on six stemmed legs, protected by overlapping moss-green chitinous shell armour, and bearing two formidable pincers on the end of long foreclaws. But its lobster-like body was crowned by a head that bore two beady eyes above a maw of tentacles. And as one came around the corner, another loomed behind it as the doors slammed on them.",
                "Nilsen dashed down the stairs and barred them with your hammer haft. It allowed time to draw rope out and make a basic tie. But as the first hammer blow came from the creature beyond the door, it almost buckled. At the top of the stairs, Rachel felt the ground rumble briefly. A drumming sound reverberated through the complex. And then the assault on the door stopped abruptly.",
                "Pryce began a ritual, slowly sketching out a pattern on the floor, oblivious to the threat close at hand. Nilsen rushed down the stairs and, with help from Rachel and Riswyn, bound the doors together with a better knot. But it was Sargo who raised the alarm from the passageway behind you. Three creatures, humanoid, but with horrid malformities that looked like tentacles, coral growths, and spines overrunning their bodies, came stalking along the hallway, paying no heed to the invisible rat familiar. And behind them lumbered one of the lobster beasts, driving them before it. Sargo darted out of the way, and you rushed to intercept them. But at that moment the silvered doors burst open with several monstrous thuds from the bulk of the other lobster giant. Riswyn and Nilsen scrambled you all into one of the cells to make your stand, forcing them to use the doorway one at a time."
            ]
        },
        {
            "heading": "Feeding Time in Prison",
            "paragraphs": [
                "As Riswyn slid into the cell, you spotted a sea zombie turn the corner, and put a bolt in its thigh. Rachel conjured magic stones in her hand and the zombie took one on the head. And then Pryce pushed you both back into the room and obliterated the thing with two volleys of howling eldritch power. But the others came on, driven on by the lobster horror outside the door. Nilsen backed into the room as the claws of the other lobster giant reached into the chamber, slicing your shoulder and trying to pin you down. But you swung your greatsword up and sliced a claw tip off. You switched to half-swording in the tight confines, reacting defensively as the thing struck in again and again, pushing you back with its longer reach. Rachel and Pryce mounted psychic and eldritch assaults on it, as Riswyn peppered it with crossbow bolts. Its carapace was hard, and it turned blow after blow until your blade began to hit home at last.",
                "It was relentless, still reaching in. Pryce realised that once defeated, another would take its place, reinforced by several smaller horrors. Too much, and Pryce began to babble obscene summonings in the corner. You felt the hairs on your neck lift as Pryce splintered the mortal realm momentarily. A manifestation of endless hunger entered the world, blotting out the light of the room beyond your doorway, and filling the academy chambers with the sound of crunching, chewing, slurping, and the roars of those things crunched and chewed upon. Nilsen's rage kept his mind oddly focused. Pryce smiled as the giant lobster horror's tiny eyes widened for a second before it was pulled swiftly into the pitched black maw, where you could feel the hunger barely satisfied for a moment. Then the chewing stopped, and the rift to the Ethereum moaned its endless hunger around the complex. Pryce snuffed it out, and sealed it away into the Ethereum again. Noote the acolyte just stared at you, scared witless. ",
                "The coast seemed clear. No trace of the creatures remained. You picked a set of rusty keys from the leftovers of one 'sea zombie', as Sargo piped up that the other lobster horror escaped the maw and returned back along the trapped corridor. So you followed it back out.",
                "You rushed out to the cavernous bone yard. The lumbering creature turned to face Riswyn and Pryce first, as Nilsen and Rachel followed with Noote. You both fired off bolts of your crossbow and eldritch force, slamming into the bison-sized thing, knocking it back for Nilsen to wade in. The Huor barbarian charged, fending off a claw and slamming the blade deep into the carapace of the beast. You took it in turns to weaken it, until it fell for Nilsen's feint and left its flank exposed. You needed no invitation, and wedged your blade deep into the tentacled head. Deep green and black fluid flowed down your arm, and the creature slumped dead to the ground."
            ]
        },
        {
            "heading": "Quite UnWell",
            "paragraphs": [
                "Rachel peered at the lobster shell and you licked your lips. At once you directed the others as to which bits of poison sac could be harvested, and which parts of carapace armour were worth dumping into the bag of holding for later.",
                "Now you all returned to the large water-logged chamber and investigated that room now that its inhabitants were defeated. Almost every surface was covered in moss or some aquatic flora. The walls were green with algae, covering the recesses in which stood more disfigured statues. At the foot of the staircase was a lever. As Riswyn soon discovered, this slammed shut and unlocked the large silvered doors. Nilsen didn't let the prospect of a warning drum pass him by, and you burst the membrane of the thing before anyone could ruin your hearing. Pryce was curious as to how the statues were damaged. Large lumps that had an arm or leg had fallen into the water, but the faces of these statues were disfigured by other, pettier means, as if hacked at through malice instead of the mere passage of time. None of you relished the prospect of going deeper down the huge hole in the floor, so you tried the ther doors leading East. They opened easily, like the Northern set, sending a slow wave of water into the next room, which was also flooded.",
                "This chamber was like many rooms that had collapsed into one. Some walls still stood, holding rusted metal gates into what seemed like destroyed cells. Plants grew in every recess, and algae overran the walls above the water-line. But in the middle of the chamber stood the parapet walls of another well. But this one was not blocked. Rachel could determine very strong conjuration magic from within, but also abjuration magic around the outside. The well shaft seemed deep, and an eerie purple fog gathered some way below. Through the murky water, you discerned a ring of smooth, polished black stone. Noote stood alongside it nonchalantly, peering over the edge.",
                "As you searched the rubble of these broken chambers, Nilsen asked Noote to be careful around the well walls. Noote replied, sarcastically, that he should have taken more care not to be kidnapped. Far from being 'fun' as Nilsen jibed, this was a horrifying trial for him, confronting creatures that lived just below his feet. His path to being a priest was in danger, and you were all contorting the will of god by taking him from his calling. Pryce interjected, perhaps this was his will, and Noote nodded 'perhaps.' He mused a little on what he'd learned in the last two days. And then you noticed that as he spoke, writing glowed on the polished stone under the water. Then it disappeared. Noote jumped back from the walls. When asked which word glowed, Noote replied, helpfully, 'THE'."
            ]
        },
        {
            "heading": "From My Cold Dead Hands",
            "image": "./img/clutching-sword.webp",
            "paragraphs": [
                "Meanwhile, Riswyn and Rachel were struggling to locate a mechanism in a side-room. A mini-treasure trove yielded some gems here, but when Riswyn located an alcove and found the mechanism, a stone in the wall revealed a well-wrapped and gleaming sword, with the skeletal hand of its former owner still clutching its hilt. Along the fuller read (in an old dialect of Carcaddis, across the Mur-i-nRos) 'None May Strike at Me With Impunity'. You packed the sword into your pack for inspection later.",
                "Nilsen and Pryce checked the metal gate East for trapped mechanisms but found none. The door was stiff but opened with a good shove, and at this you heard movement across the wide hallway and gate opposite. There, you saw another flooded but less overgrown room, and to your left a set of steps up to some doors, inevitably leading to the corpse cloister. But to your right, where you expected to see a defaced statue, like the other wide corridor from the bone chamber, was merely an empty alcove. Nilsen checked the floor for traps, but found none. The passage served a different purpose, it seemed. Keeping one eye out for movement ahead, you and Rachel turned left to examine the statueless alcove.",
                "Here was a plinth inscribed with the words 'The Stone Scholar : Heed His Warnings And Learn Evermore'. A decorative scene with books and scrolls on the ground and laurel wreaths on the ceiling above frame what would have been a tall, imposing statue, but now nothing remains. You turned to the rusty gate East which, followed at a distance by Rachel, Nilsen unlocked and stepped across the threshold. Several gates, both open and closed, led from the central room which was illuminated by a flickering yellow light from one cell to the North. You passed a small, totem-like statuette behind the door, and you almost turned to face it as your attention was caught by the lurching limbs and tentacles of three more sea mutants. ",
                "You reacted in time to defend yourself, and called to the others for help!"
            ]
        }
    ]
}