{
    "title": "The Prison and the Caves",
    "sections": [
        {
            "paragraphs": [
                "Nilsen knew that if he let himself go into a rage, he would be exhausted by the end of this fight. He was relieved that these new arrivals presented no real threat to him. He glanced round, picking the nearest of the three sea-spawn, and hefted his sword. With his friends’ spells whistling past his ears, Nilsen barely noticed when an approaching monster tripped as it ran towards him. Still, he swiped at it as it stumbled past and before long the last monster crumbled beneath his onslaught.",
                "Growing frustrated with Noote’s lack of input into these fights, Nilsen took out his old sledgehammer and passed it over. “This should help you to get involved,” he said. Ignoring Noote’s protests, he continued, “It’s about time you started developing the skills to look after yourself. We won’t always be here to watch over you.”",
                "Rachel and Bragi began to check the nearby rooms for treasure while Riswynn, Pryce and Nilsen went to investigate the body of a man that had been chained to a nearby wall. The man turned out to be alive and, to everybody’s surprise, he bore a tattoo that matched those of the company. Price began questioning the man and it was not long before he introduced himself as Felix."
            ]
        },
        {
            "image": "./img/felix.webp",
            "paragraphs": [
                "Felix told Pryce a story that chimed closely with their company’s own experiences; kidnap and shipwreck. However his freedom was short lived, as he was quickly captured by the Ardseer's men and imprisoned here, with at least one other unfortunate Branded soul. Felix had been helpless as the other man had been questioned under magical torture until he eventually expired. It was clear that the Ardseer was deeply interested in our common situation, and was none too sympathetic. However, like Pryce, Felix had no explanation for their shared markings. ",
                "It wasn’t long before Nilsen trusted the man well enough to free him from his shackles and together with the others, they headed north to rest in their secure room. Nilsen spotted a second driftglobe next to Felix’s shackles and passed it to Noote. Passing the store, Felix took the opportunity to arm himself from the materials that the adventurers had previously found there.",
                "As they rested, Nilsen took Noote to the side and began showing him how to use his new weapon more effectively. Noote continued to protest, but he swung the hammer experimentally and began to feel a little more comfortable holding it.",
                "Bragi also took the opportunity to spend time with the weapons that he had acquired. He quickly realised that his style was better suited to the rapier that Riswynn had found, and he began to attune himself to it. Before long, he couldn’t imagine himself using any other weapon. In fact, he wondered how he had ever felt comfortable with another’s hilt in his hand.",
                "Once everyone felt rested, the company moved on. They approached the final exit from the boneyard to the east. Pryce glanced up and re-read the inscription above the archway, “The path of those who fail”. The corridor turned to the north before opening to a room with clear evidence of occult activity, containing a scrying device at the centre of the room. However Pryce was more interested in the mantra inscribed on the wall, 'knowledge will open the doors but discipline will secure them behind you'. Frowning, Pryce looked further ahead where another mantra was inscribed, 'failure is the pain of a mind reforged into surest steel'. Curious, he moved forward again, to a section that had crumbled with age. Pryce grunted with frustration, as the section was badly damaged. All he could read was, 'mistakes... success... from great stem.. can.. only... surest...'. All of this must mean something... but what? ",
                "Nilsen quickly grew bored with all this writing and followed the corridor further north. He emerged into a room with a large pool of water that he recognised from earlier. As he watched, an odd ripple spread from the centre of the pool. Nilsen waded in to see closer and before long the water erupted around him. Three giant Larva emerged above the water and turned to face him, their gaping maws dripping goo as they blindly groped towards him.",
                "In the Sunless Citadel, Nilsen had turned up a potion of fire-breathing. He remembered thinking that he could never see why he would use such a thing, but he had tucked it away anyway. As he gazed at these watery horrors, he wondered if now was the time. He pulled the bottle out and popped the cork with his thumb before throwing the potion down his throat.",
                "As they entered the room, the others were greeted by the sight of Nilsen surrounded by giant, gross worms, breathing fire over one of them while he swung his sword at a second.",
                "They quickly finished the larvae off before working out what to do next. As they talked it quickly became clear that there were two possible routes out of the area. They could either return to the temple above, or they could explore the space below the flooded floor to the south-west of the compound. Nilsen mentioned the wells, but the others hushed quickly him.",
                "The gang were not known for retreating so downwards, and wetwards, it was. Asking to borrow Nilsen’s driftglobe, Pryce jumped into the pool and drifted out of view. Before long, Nilsen borrowed the second driftglobe back from Noote, and jumped in after him. The pair began exploring the cave complex that they discovered below the floor. ",
                "Nilsen swam through the caves, little wondering when he would catch up with Pryce. Despite his limited vision underwater, he thought little of the risks involved with swimming alone. Suddenly a tentacle shot below and swatted at him, attempting to draw him down towards the floor of the cavern. Nilsen spotted the giant eyes of an enormous octopus beneath him and knew he was in trouble. Taking a chance, he spoke to his driftglobe and daylight flooded the chamber. As the octopus cringed away from the dazzling orb, its tentacles flailing to cover its eyes, Nilsen took the opportunity to flee.",
                "The company regrouped in the initial chamber and made plans to explore further. The group followed Pryce down the passage he had most recently explored. They began to head north until they spotted a group of chuuls. Although two of the chuuls appeared to be inactive, the group swiftly turned south away from them. Pryce and Valthoom explored a small chamber to the east of the main cavern, although what they found remained a secret between them.",
                "While Pryce and Valthoom were out of sight, Agis continued south. Chastened by his recent experience, Nilsen refused to split the group again and remained near the alcove containing Pryce and Valthoom. Eventually the pair emerged and the crew followed Agis south, but not before Rachel signalled that she needed to return to the surface. Riswynn agreed to accompany her.",
                "As his friends swam towards him, Agis turned and pressed on. He quickly spotted a group of seaspawn approaching and turned back towards the others, but it was too late; the first of the seaspawn reached out and grabbed his ankle. Without thinking, Agis drew his daggers and stabbed down towards his feet. He continued stabbing until he felt the cold grip on his ankle loosen, and the now twice-dead corpse began to drift past him. Nilsen, Pryce and Felix caught up with the fray and battle commenced. Before long the group had despatched the remaining seaspawn, and they returned to the surface to rejoin the others. As they turned to swim, Agis noticed that the seaspawn corpses were floating alongside them, carried on a current that they hadn’t previously noticed.",
                "Once again, the group reunited at the surface chamber to discuss their options. They agreed to continue exploring the same passage and set off together. This time, Nilsen insisted that Noote join the exploration. As they progressed, the current continued to grow and it became clear that they were approaching an exit of some sort, from the cave. Before they found it, Rachel had to return once more and Noote, grateful for the excuse, agreed to accompany him back to the surface. The others continued until Nilsen, the fastest swimmer, spotted daylight filtering through the water ahead.",
                "As they returned to the cavern, Nilsen spotted that the chuuls they had avoided previously were awake and on the move. He reported this to the others as they emerged from the water. After some discussion, they agreed that it would be better to fight the chuuls on dry land, so Pryce reentered the water and called to them. Soon, he hopped back out, followed by three chuuls.",
                "As the chuuls emerged, they were greeted by a flurry of arrows and spells. Battle commenced. To Nilsen’s delight, Noote joined in the battle, swinging his hammer with all his might, and even occasionally connecting with one of the chuuls. As he swung, Noote let out a fierce cry, “take that, PRAWN!” Despite Noote’s greatest efforts, the battle was going poorly for our heroes. Agis became separated from the rest of the crew and quickly found himself held down by a massive claw and then paralysed as the chuul’s disgusting tentacles began to explore his face. Nilsen found himself crushed between a chuul and the ground, while Riswynn also was paralysed.",
                "Behind them Pryce muttered some dark words as Valthoom giggled. With an awful sucking, tearing noise, reality appeared to collapse into a hole behind the chuuls. Where there once had been a pool of still dark water, now there remained only sucking blackness. And tentacles. So many tentacles. The battle began to turn. One by one, the monsters fell to the hunger behind, to Nilsen’s sword, and to Pryce’s incantations.",
                "As the dust settled, a wheezing cough drew Nilsen’s attention. He fell to his knees beside Felix. Felix’s breastplate had been crushed and blood oozed from beneath it. As Nilsen held him, Felix caught his eye and smiled, “I will not become one of them, it is good!”",
                "The company mourned their new friend before turning to face their next adventure."
            ]
        }
    ]
}