{
    "title": "The Archives",
    "sections": [
        {
            "heading": "Book stacks, Stonework and Statues",
            "paragraphs": [
                "The party emerged from the gloom of the well into a blaze of light, as the breathtaking expanse of an immense library formed before them. As their eyes gradually adjusted to the brightness, they were able to take in the vast scale of this repository of knowledge. Hundreds of candles suspended from two enormous chandeliers illuminated countless rows of books. Two further galleries soared above them, reached by spiral staircases and connected by walkways at regular intervals. Pryce, his expression one of wonder and pure joy, uttered under his breath, “this is the library we were promised”.",
                "Stepping out of the well, the party take in their surroundings. Nilsen immediately notices a huge elk hide on the floor and takes a fancy to it. Without a moment’s pause, he rolls up the hide and places it into his bag of holding. “That might come in handy”, he said as he continued to inspect the immediate vicinity of the well. Meanwhile, Riswynn spends time examining the masonry and notices that the well is a more recent addition to the more ancient stonework of the library.",
                "Rachel takes the opportunity to try and discern if any magical emanations can be detected within the library. Although she feels the unmistakable vibrations of magic in the air, it is the soft breathing of something in the far-off distance that gives her pause…",
                "The rest of the party fan out to investigate their immediate surroundings. Bragi recognises a sculpture depicting the banshee Ifhalla, in her prime. An inscription on the statue reads “For brave Ifhalla”. Riswynn moves through the library, awed by the incredible workmanship on display. Satisfied that they have covered the area, the party move through the colonnade to the central section of the ground floor to investigate further.",
                "Moving through the library, the party decide to split up to cover more of the area. Riswynn takes the central stair to the west and ascends to the first gallery, while Bragi inspects a large circular platform, which appears to function as an elevator. He finds a pressure plate, activates the platform and slowly rises to the floor above.",
                "Exiting the staircase, Riswynn looks to the north and makes out a large, covered chamber, in which can be seen an enormous bell, its purpose a mystery. As she moves cautiously towards the peculiar structure, she lifts her gaze upwards and spots a large door to the east on the upper floor, surmising that this could be another exit from the library."
            ]
        },
        {
            "heading": "Reading Material, Finding the Casting Dies at last, Remulen’s Desk",
            "paragraphs": [
                "Nilsen, Rachel, Agis and Pryce continue to the northern extent of the ground floor. Three sizeable, ornate desks stand arrayed in a broad semicircle, with various volumes laid open for reading. There, on the central desk they find a large volume, titled “The Lineage and Heraldry of the Lands of Man, Volume 59”. A separate illustration depicts the family tree of King Edric I (grandfather to the current king, Edric II). Pryce discovers a detailed prison log and begins thumbing through the pages…",
                "Nilsen searches the central desk drawers and finds a small black box, lifting it onto the desk, its weight surprising even him. Wasting no time, and throwing any caution to the wind, he opens the box to reveal three wax casting dies, typically used to make signet rings for nobles. He calls over Rachel, Agis and Pryce. They discover that the designs on the seals partly resemble the brands they found on their bodies when they arrived on the shipwreck many months prior.",
                "Agis inspects the book on lineage and heraldry more closely, finding a marked page. He recognises the names listed under the Tarrowby region: “Lord Carrick”, “Heward Bryce”, “Lord Camelborne” and “Aldred Caster”, amongst others. Finally, they are beginning to make some sense of what has been happening…",
                "Rachel notices a very specific piece of wooden inlay on the central desk, which is triangular in shape, appearing as thought something is meant to be placed there. She realises that the prism she took from the banshee Ifhalla might be intended as some kind of device to interact with the desk in some way, although she is unable to discern its purpose and decides to leave this alone, for now…",
                "Pryce leafs through the pages of the prison logbook. He finds references to familiar names (including Basso and Mattis) from the voyage that brought them to these lands. As he turns the next page he is momentarily taken aback by a detailed illustration of the mysterious brands they all bear upon their bodies. He finds a harbour logbook, from Hullwater and other ports along the neighbouring coastline. One vessel is noted, “The Black Fin”, which discharged no-one and took on only food and water before departing for Sedbergh. A note in the book details provisions taken on. Agis suggested this seemed like a lot of food and water for a prison hulk, although he is no expert on the matter.",
                "Nilsen, his boredom growing, inspects a broken statue to the north east to discover that the face matches that of the huge animated statue they parleyed with when they entered the complex. An inscription reads “For Beloved Remulen the Wise”."
            ]
        },
        {
            "heading": "The Bell",
            "paragraphs": [
                "On the first floor, Riswynn and Bragi converge at the entrance to the chamber. They find a huge bronze bell, gilded with gold, with sinister, ornate glyphs etched into its edge. A clapper fashioned from a narwhal tusk sits off to the side, next to a small chair. Riswynn discerns some dark religious purpose from its dolorous knell and they decide to give it a wide berth.",
                "As they stepped out of the small room, Bragi senses a faint, rasping breath coming from the north west corner of the first floor. As Riswynn relays a magical message to Rachel to inform her of what they have found, Bragi moves cautiously towards the sound to investigate further."
            ]
        },
        {
            "heading": "The Armour Enclosure, Dwarven and Vallasaari Reading Rooms, and Krant",
            "paragraphs": [
                "He finds a small area sectioned off by metal bars. Two suits of incredibly ornate armour face each other, while a plush chair sits in front of a desk with an open book atop it. Pacing around the metal barriers, Bragi finds a door, which appears to require a key.",
                "He is unable to pinpoint the source of the sound, but notices a small chamber in the north east corner and makes his way there to investigate. Within the room, he finds various books and scrolls detailing the history of Vallasaari culture. His attention is drawn to a book that refers to notes on the “fall” or “sundering” of the Elves. One passage from a well-thumbed page reads:",
                "“In an instant, the power of the Ethereum that coursed through the very stones of the temples, the foundations of the cities, and held aloft their impossible structures was gone. Only in the grave-trees, the Kalenuraa, which are rooted in the spirit realm, did the power still thrive, and these places became refuges for Elven culture.",
                "“But these Elves aged as men do, and in that ageing they grew jealous and petty. Families fought for possession of their Kalenuraa, and their culture grew apart from what came before. Thus, in the space of perhaps 100 years, the once mighty Elven civilisation was gone, replaced by pockets of this new Vallasaari – meaning ‘The Sundered”.",
                "Riswynn supposes that the wall sconces have magical properties, which enable the torches to ignite and remain lit without any external source of ignition. She quickly heads downstairs, grabs two torches from the ground floor and brings them back up the spiral staircase to test her theory. Right enough, when she places the torches in the enchanted sconces, the torches light up with magical fire.",
                "She then makes her way to the south west corner to inspect a small chamber, a study or reading room set apart from the main floor. She finds a small collection of books written in Dwarvish and common, an empty desk sits in the centre of the room. She realises that a wealth of knowledge spanning Dwarven history is held in this room. She espies one book in particular that piques her interest and takes it for later reading.",
                "Meanwhile, Bragi returns to the caged area to inspect further. Looking up, he realises that the bars don’t extend to the ceiling, leaving a gap just big enough for him to fit through. He deftly runs up the wall, boosting himself over the metal bars and landing between the two suits of armour. He cautiously approaches the desk",
                "A book lies open, its pages detailing the events of the conflict in Heath. He steps towards the desk when, all of a sudden, a rasping voice utters “I mean you know harm, remember this when you look upon me. You are no brigand?”. A moment later, a hideous desecration of a man emerges from beneath the desk where he had been hiding. Bragi takes a cautious step backwards, but senses no ill-intent.",
                "The creature introduced himself as Krant, the archivist, and apologised for his appearance. He spoke of the “Master” and the “puppet” of the archives, and explained that he was the original archivist, and stayed here as a spirit with Remulen to tend to the archive. But Remulen had statues crafted so that he might defend the archive, and he defended it across all the ages. But when the servants of the Master destroyed his stone form, the Master broke his will and made him a servant, a watchdog to guard this place. And so, the master toyed with Krant, and grafted a form to humiliate and denigrate him, but it knew the value of the archivist, and kept him alive.",
                "Agis approaches Bragi and Krant while they converse, intrigued by the archivist. They then descend to the ground floor together and join the rest of the party, while Riswynn moves to the top floor to continue her explorations."
            ]
        },
        {
            "heading": "The Mimic",
            "paragraphs": [
                "She finds a door to the east that looks somewhat familiar. A small wooden chest sits in front of the door. She inspects the chest and reaches for the lock. At that moment, a set of gnashing teeth and a long tongue reach out to grab her, taking her by surprise. The creature slowly extends its long, gangly legs, towering over the dwarf as a desperate fight ensues.",
                "Agis and Bragi sprint for the nearest staircase to try and get into the fight. Nilsen runs to the lift, using a lever to recall it to the ground floor. Pryce grabs Rachel and utters an incantation that results in a deafening boom, as the two warlocks disappear in a great clap of thunder, only to reappear on the balcony two floors up.",
                "Rachel then pulls a wand from her tunic and sends a stream of magic missiles towards the creature, before conjuring some magic stones, should they be needed. Nilsen and Noote start ascending the lift to the upper floor, while Agis and Bragi continue their sprint into the fray.",
                "Sensing the danger, the mimic breaks from combat, leaving its flanks clear for Riswynn to stab at the creature as it attempts to escape. She manages to catch it with a swiping blow from her sword. As the mimic sprints down the corridor, she fires off a crossbow bolt, but the shot goes harmlessly wide.",
                "Nilsen now charges towards the fleeing creature, not quite getting into melee range. He takes a javelin from his back and hurls it at full pelt. The mimic darts out of the way of the first throw, but Nilsen hurls a second with pinpoint accuracy, piercing the creature's hindquarters. The mimic flails momentarily as it collapses to the ground, severely wounded and out of the fight."
            ]
        },
        {
            "heading": "Krant’s Familiar Sketch",
            "paragraphs": [
                "After the brief fight with the mimic, the archivist explains the indexing system to an interested Pryce, offering to help find anything the party needs in the library. He describes how Ardsere Mausel uses the library. He speaks of the items in the desk, which he notes are now missing. He sheds a tear when he sees the small prism in Rachel's hand, which he recognises as an item that once belonged to Ifhalla.",
                "Pryce convinces Krant to use a quill and parchment to try and illustrate who the master is. Krant clumsily begins to draw a long worm-like shape with a toothy maw at one end, crowed in many eyes. Pryce is immediately reminded of something disturbing...",
                "Agis asks Krant if any of the books could help explain the nature of the Master, so they might better understand what it is, but there was nothing here that could help."
            ]
        },
        {
            "heading": "The Door Opens",
            "paragraphs": [
                "Krant goes on to describe Mausel's movements in more detail. While he continues to talk, the party feel a rhythmic vibration coming from the floor. Deducing that something large is approaching from the other side of the door, likely the stone guardian statue encountered previously, the party step back from the door and attempt to conceal themselves from the apparent threat.",
                "Quickly discussing amongst themselves, they decide to place the prism, which they believe the guardian statue will recognise, on the floor in front of the door. Nilsen elects to stand in full view, while Bragi sings a song of inspiration, should Nilsen need it..."
            ]
        }
    ]
}